{
    "recipes": [
{
  "id": 1,
  "uid": "P-STY_000001",
  "name": "Media Luna de Manteca (Hojaldrado Rápido)",
  "description": "Clásicas medialunas hojaldradas, aireadas y con el característico sabor a manteca que se deshace en la boca.",
  "imageUrl": "https://example.com/medialuna-manteca.jpg",
  "detailedInfo": "Receta de medialunas de manteca elaboradas con un hojaldrado rápido. El secreto está en mantener la masa y la manteca bien frías, logrando capas livianas y un sabor inconfundible. Incluye amasijo, empaste, tres vueltas simples y un almíbar brillante final.",
  "ingredients": [
    { "name": "Harina 000", "quantity": "250g" },
    { "name": "Harina 0000", "quantity": "250g" },
    { "name": "Levadura", "quantity": "25g" },
    { "name": "Miel", "quantity": "15g" },
    { "name": "Sal", "quantity": "10g" },
    { "name": "Azúcar", "quantity": "50g" },
    { "name": "Esencia de vainilla", "quantity": "c/n" },
    { "name": "Leche", "quantity": "300g" },
    { "name": "Manteca", "quantity": "200g" },
    { "name": "Harina (empaste)", "quantity": "25g" },
    { "name": "Azúcar (almíbar)", "quantity": "300g" },
    { "name": "Agua (almíbar)", "quantity": "300cc" },
    { "name": "Miel (almíbar)", "quantity": "1 cda" }
  ],
  "steps": [
    { "step": "Mezclar las harinas (000 y 0000) formando un volcán en la mesada." },
    { "step": "Incorporar sal, azúcar, miel, esencia de vainilla, leche y levadura. Amasar hasta lograr una masa homogénea." },
    { "step": "Formar un bollo, cubrir con film y dejar reposar en frío (idealmente toda la noche o 1 hora en freezer)." },
    { "step": "Para el empaste, mezclar la manteca fría con la harina hasta obtener una mezcla flexible pero firme. Enfriar nuevamente." },
    { "step": "Estirar la masa fría, colocar el empaste en el centro y envolverlo completamente (masa-manteca-masa)." },
    { "step": "Realizar la primera vuelta simple: estirar y doblar en tres capas. Llevar al frío por una hora." },
    { "step": "Repetir la segunda y tercera vuelta simple, girando la masa antes de cada estirado. Refrigerar entre cada una." },
    { "step": "Estirar la masa fría a medio dedo de grosor y cortar triángulos de 8x10 cm." },
    { "step": "Enrollar desde la base hacia la punta y curvar las puntas formando la medialuna." },
    { "step": "Dejar espacio en la bandeja para el levado, pincelar con doradura y hornear a 180°C por 20-25 minutos." },
    { "step": "Preparar el almíbar calentando azúcar, agua y miel hasta hervir." },
    { "step": "Con las medialunas aún calientes, pincelar con el almíbar tibio una o más veces según el brillo deseado." }
  ],
  "images": [
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/Medialuna/Medialuna+1.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/Medialuna/Medialuna+2.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/Medialuna/Medialuna+3.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/Medialuna/Medialuna+4.webp"
  ],
  "rating": null,
  "tips": [
    "Usar 50% Harina 000 y 50% Harina 0000. La 000 da elasticidad y la 0000 da color blanco y terminación fina.",
    "Dar frío a la masa inmediatamente para controlar la acción de la levadura.",
    "No añadir más harina de la necesaria durante el amasado ni el hojaldrado.",
    "La manteca y la masa deben estar bien frías y el empaste debe prepararse rápido para no darle calor.",
    "Después de cada vuelta de hojaldrado, girar el cierre de la masa antes de estirar.",
    "La combinación ideal es medialuna caliente con almíbar tibio para un brillo perfecto."
  ]
},
{
  "id": 2,
  "uid": "P-STY_000002",
  "name": "Medialunas V2",
  "description": "Medialunas hojaldradas con manteca, de miga esponjosa y capas delicadas, elaboradas con paciencia y reposos en frío para lograr un resultado perfecto.",
  "imageUrl": "https://example.com/medialunas-caseras.jpg",
  "detailedInfo": "Versión casera de las clásicas medialunas de manteca, con un proceso de hojaldrado que genera múltiples capas livianas. La masa requiere reposos y pliegues sucesivos, lo que aporta la textura aireada y el sabor característico. Incluye empaste, cuatro vueltas simples y un almíbar brillante final.",
  "ingredients": [
    { "name": "Harina 0000", "quantity": "500g" },
    { "name": "Leche tibia", "quantity": "225cc" },
    { "name": "Levadura", "quantity": "25g" },
    { "name": "Huevo", "quantity": "1 unidad" },
    { "name": "Azúcar", "quantity": "100g" },
    { "name": "Miel", "quantity": "15g" },
    { "name": "Sal", "quantity": "15g" },
    { "name": "Manteca", "quantity": "200g" },
    { "name": "Harina (empaste)", "quantity": "25g" },
    { "name": "Azúcar (almíbar)", "quantity": "c/n (proporciones iguales con agua)" },
    { "name": "Agua (almíbar)", "quantity": "c/n (proporciones iguales con azúcar)" },
    { "name": "Huevo (pincelar)", "quantity": "c/n" }
  ],
  "steps": [
    { "step": "Disolver la levadura en la leche tibia." },
    { "step": "Formar una corona con la harina y colocar la sal en los bordes." },
    { "step": "En el centro, agregar azúcar, huevo, miel y la levadura disuelta. Mezclar desde el centro hacia afuera." },
    { "step": "Amasar hasta obtener una masa firme y homogénea. Dejar reposar 20-30 minutos." },
    { "step": "Preparar el empaste mezclando la manteca pomada con la harina." },
    { "step": "Estirar la masa en forma de rectángulo y colocar el empaste en el tercio central." },
    { "step": "Doblar en tres capas (una vuelta simple) y enfriar por 30-60 minutos." },
    { "step": "Repetir el proceso de estirar, doblar y enfriar un total de cuatro veces." },
    { "step": "Estirar la masa a 4-5 mm de grosor y cortar triángulos medianos." },
    { "step": "Enrollar desde la base hacia la punta y colocar en una bandeja enmantecada, con las puntas hacia abajo." },
    { "step": "Dejar levar tapadas en un lugar cálido durante 40-60 minutos." },
    { "step": "Pincelar con huevo y hornear a 190-200°C hasta que estén doradas." },
    { "step": "Preparar el almíbar con partes iguales de azúcar y agua, hervir 3-4 minutos." },
    { "step": "Pinchar las medialunas calientes con un escarbadientes y pincelar con el almíbar tibio para dar brillo." }
  ],
  "images": [
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/MedialunaCasera/MedialunaCasera+1.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/MedialunaCasera/MedialunaCasera+2.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/MedialunaCasera/MedialunaCasera+3.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/MedialunaCasera/MedialunaCasera+4.webp"
  ],
  "rating": null,
  "tips": [
    "Paciencia y tiempo: esta receta requiere múltiples reposos y vueltas, por lo que es ideal empezar temprano.",
    "Separar sal y levadura al armar la corona para evitar que la sal inhiba la levadura.",
    "El origen de las capas y los agujeritos chiquitos se logra con las cuatro vueltas y los reposos en frío.",
    "Acomodar correctamente las medialunas en la fuente, con las puntas debajo de la siguiente, evita que se quemen.",
    "Pinchar las medialunas al salir del horno ayuda a que absorban mejor el almíbar y queden más brillantes."
  ]
},
{
  "id": 3,
  "uid": "P-STY_000003",
  "name": "Medialunas V3",
  "description": "Medialunas esponjosas y tiernas, ideales para el desayuno o la merienda, que pueden rellenarse con ingredientes dulces o salados. Una receta más rápida que la tradicional, sin hojaldrado, pero con excelente sabor y textura.",
  "imageUrl": "https://example.com/medialunas-cuernitos.jpg",
  "detailedInfo": "Receta de medialunas caseras sin hojaldrado complicado, usando mantequilla incorporada directamente a la masa. Incluye activación de levadura, amasado, dos fermentaciones, formado de triángulos y horneado con pincelado suave de huevo. Se puede espolvorear azúcar glas al final.",
  "ingredients": [
    { "name": "Harina de trigo", "quantity": "500 g" },
    { "name": "Leche", "quantity": "120 ml" },
    { "name": "Azúcar", "quantity": "100 g" },
    { "name": "Huevo", "quantity": "1 unidad" },
    { "name": "Sal", "quantity": "un poco", "detail": "Colocar en un borde para que no toque la levadura" },
    { "name": "Mantequilla sin sal", "quantity": "75 g", "detail": "Cortada en dados, fría pero no demasiado blanda" },
    { "name": "Agua tibia", "quantity": "80 ml" },
    { "name": "Levadura de panadería seca", "quantity": "10 g", "detail": "O 30 g de levadura fresca" },
    { "name": "Harina para activación", "quantity": "1 cda" },
    { "name": "Huevo para pincelar", "quantity": "1 unidad" },
    { "name": "Azúcar glas (opcional)", "quantity": "c/n" }
  ],
  "steps": [
    { "step": "Mezclar agua tibia, levadura y 1 cda de harina. Dejar reposar 15 minutos hasta que espume." },
    { "step": "Hacer un hueco en la harina, agregar leche, azúcar, huevo y levadura activada. Poner sal en un borde sin tocar la levadura." },
    { "step": "Mezclar los ingredientes en el centro y poco a poco incorporar harina de los bordes hasta integrar. Continuar a mano si es necesario." },
    { "step": "Agregar la mantequilla en dados, doblar y estirar hasta que se integre completamente (unos 3 minutos). Amasar 7 minutos más hasta masa suave y lisa." },
    { "step": "Formar una bolita, cubrir con film y dejar fermentar hasta que duplique tamaño (aprox. 1.5 horas)." },
    { "step": "Estirar la masa sobre la encimera ligeramente enharinada formando un rectángulo. Cortar los bordes y luego cortar en 12-16 triángulos." },
    { "step": "Hacer un pequeño corte en la base de cada triángulo, enrollar y curvar las puntas hacia dentro." },
    { "step": "Colocar en bandeja con papel de hornear, cubrir sueltecita con film y dejar levar 1.5 horas hasta que estén gorditas." },
    { "step": "Pincelar suavemente con huevo batido, evitando que la masa se baje." },
    { "step": "Hornear en horno precalentado a 180°C por 15 minutos o hasta que estén doradas." },
    { "step": "Dejar templar 10 minutos. Espolvorear azúcar glas opcionalmente antes de servir." }
  ],
  "images": [
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/MedialunaRápida/MedialunaRápida+1.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/MedialunaRápida/MedialunaRápida+2.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/MedialunaRápida/MedialunaRápida+3.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/MedialunaRápida/MedialunaRápida+4.webp"
  ],
  "rating": null,
  "tips": [
    "Diferencia Cruasán: Alternativa más rápida y fácil que las medialunas tradicionales, sin hojaldrado complicado.",
    "Mantequilla: Integrar los 75g de mantequilla fría requiere unos 3 minutos de amasado hasta quedar totalmente incorporada.",
    "Pincelado Suave: Pintar con huevo batido suavemente para no afectar el levado final.",
    "Masa Relajada: Después de la primera fermentación, la masa está tan elástica que no hace falta rodillo para estirarla.",
    "Punto de Cocción: Hornear en tandas separadas si es necesario hasta lograr un dorado uniforme y bonito."
  ]
},
{
  "id": 4,
  "uid": "P-STY_000004",
  "name": "Medialunas V4",
  "description": "Receta express de facturas argentinas, incluyendo medialunas y vigilantes, con laminado de manteca para lograr la textura característica y relleno de pastelera.",
  "imageUrl": "https://example.com/facturas-argentinas.jpg",
  "detailedInfo": "Facturas argentinas tradicionales, elaboradas con masa laminada de manteca y relleno de pastelera. Incluye preparación de masa, laminado, formado de medialunas y vigilantes, horneado y baño en almíbar para brillo y textura final. La receta tiene opción lenta o rápida de reposo en frío.",
  "ingredients": [
    { "name": "Harina", "quantity": "750g" },
    { "name": "Levadura", "quantity": "50g" },
    { "name": "Huevos", "quantity": "3 grandes" },
    { "name": "Azúcar", "quantity": "180g" },
    { "name": "Leche tibia", "quantity": "225ml" },
    { "name": "Miel", "quantity": "1 C" },
    { "name": "Sal", "quantity": "1 c" },
    { "name": "Manteca (laminado)", "quantity": "150g" },
    { "name": "Leche (pastelera)", "quantity": "200ml" },
    { "name": "Fécula de maíz", "quantity": "15g" },
    { "name": "Azúcar (pastelera)", "quantity": "40g" },
    { "name": "Yema", "quantity": "1" },
    { "name": "Manteca (pastelera)", "quantity": "20g" }
  ],
  "steps": [
    { "step": "Preparar la pastelera: mezclar leche, fécula de maíz, azúcar, yema y manteca en una olla, revolviendo constantemente hasta hervir y espesar. Reservar." },
    { "step": "Preparar la masa: mezclar harina, leche tibia, azúcar, levadura, miel y sal hasta obtener masa lisa." },
    { "step": "Primer reposo: dejar la masa reposar 40 minutos." },
    { "step": "Laminado: estirar la masa a 0.5 cm, cubrir con manteca a temperatura ambiente y espolvorear un poco de harina. Doblar tipo libro, estirar y volver a doblar (doble simple)."},
    { "step": "Segundo reposo en frío: opción lenta 2 horas en heladera, opción rápida 30 min heladera + 30 min freezer." },
    { "step": "Estirado final: estirar la masa a 0.5 cm, cortar a la mitad y luego en triángulos." },
    { "step": "Formado de medialunas: hacer un corte en la parte superior del triángulo, estirar y enrollar curvando las puntas hacia dentro." },
    { "step": "Formado de vigilantes: cortar triángulos más anchos y enrollar, sin doblar extremos. Agregar pastelera encima." },
    { "step": "Tercer reposo: dejar levar hasta que dupliquen tamaño." },
    { "step": "Pincelar con huevo y hornear a 180°C hasta dorar." },
    { "step": "Al salir del horno, bañar en almíbar para brillo y textura final." }
  ],
  "images": [
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/Facturas/Facturas+1.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/Facturas/Facturas+2.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/Facturas/Facturas+3.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/Facturas/Facturas+4.webp"
  ],
  "rating": null,
  "tips": [
    "Comodidad: La receta se disfruta con mate y remite a la nostalgia, usar una yerba suave para acompañar.",
    "Acelerando el Reposo: Reposo en frío puede acortarse a 30 min en heladera + 30 min en freezer si tienes prisa.",
    "Pastelera: No dejar de revolver hasta hervir para que espese correctamente y tenga textura suave.",
    "Acabado: El baño de almíbar al salir del horno es esencial para dar brillo, color y textura final inmejorable.",
    "Laminado: Doblar tipo libro y realizar doble simple ayuda a lograr la textura hojaldrada característica sin complicarse."
  ]
},
{
  "id": 5,
  "uid": "P-STY_000005",
  "name": "Torta de Manzana",
  "description": "Torta húmeda de manzana, fácil de preparar con pocos ingredientes, ideal para un postre rápido y delicioso.",
  "imageUrl": "https://example.com/torta-manzana.jpg",
  "detailedInfo": "Receta de torta de manzana súper húmeda y rápida. La preparación incluye batido de ingredientes húmedos, integración con los secos y la incorporación de manzanas en rodajas. Se hornea hasta dorar y se puede decorar con azúcar impalpable. Perfecta para cuando se busca un postre delicioso en poco tiempo.",
  "ingredients": [
    { "name": "Manzanas", "quantity": "4 unidades" },
    { "name": "Azúcar", "quantity": "100g" },
    { "name": "Polvo para Hornear", "quantity": "2 cda" },
    { "name": "Harina", "quantity": "140g" },
    { "name": "Leche", "quantity": "200ml" },
    { "name": "Huevos", "quantity": "4 unidades" },
    { "name": "Aceite", "quantity": "40ml" },
    { "name": "Canela", "quantity": "c/n" },
    { "name": "Jugo de Limón", "quantity": "c/n" },
    { "name": "Azúcar Impalpable", "quantity": "c/n" }
  ],
  "steps": [
    { "step": "Cortar las manzanas en rodajas y rociarlas con jugo de limón para evitar oxidación." },
    { "step": "Batir huevos, azúcar, aceite y leche hasta integrar bien." },
    { "step": "Tamizar harina y polvo para hornear; agregar canela si se desea." },
    { "step": "Mezclar los ingredientes secos con los húmedos hasta no tener grumos." },
    { "step": "Incorporar las rodajas de manzana a la mezcla y revolver suavemente." },
    { "step": "Verter la mezcla en un molde enmantecado y colocar las rodajas más bonitas encima para decorar." },
    { "step": "Hornear a 180°C hasta que la torta esté cocida y dorada." },
    { "step": "Espolvorear azúcar impalpable antes de servir." }
  ],
  "images": [
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TortaManzana/TortaManzana+1.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TortaManzana/TortaManzana+2.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TortaManzana/TortaManzana+3.webp"
  ],
  "rating": null,
  "tips": [
    "Velocidad: Perfecta para cuando no hay mucho tiempo pero se quiere sorprender con un postre delicioso.",
    "Textura: La torta queda súper húmeda y de textura increíble.",
    "Opcional: Pelar las manzanas es opcional; la canela también se puede omitir si no gusta.",
    "Corte: Puedes cortar las manzanas a cuchillo o usar una mandolina para rodajas más uniformes.",
    "Decoración: Colocar las rodajas más bonitas encima le da un toque visual muy atractivo al servir."
  ]
},
{
  "id": 6,
  "uid": "P-STY_000006",
  "name": "Tarta de Manzana V2",
  "description": "Tarta de manzana rápida y sencilla, con masa triturada en un solo paso y acabado glaseado con mermelada.",
  "imageUrl": "https://example.com/tarta-manzana-facil.jpg",
  "detailedInfo": "Receta de tarta de manzana súper fácil. La masa se prepara triturando huevos, azúcar, leche, harina y manzanas. Se hornea primero la base, luego se decora con láminas de manzana y se glasea con mermelada de durazno o albaricoque para un acabado brillante. Ideal para postres rápidos y deliciosos.",
  "ingredients": [
    { "name": "Huevos", "quantity": "2 unidades" },
    { "name": "Azúcar", "quantity": "200g" },
    { "name": "Leche", "quantity": "250ml" },
    { "name": "Harina de Trigo", "quantity": "220g" },
    { "name": "Manzanas Golden", "quantity": "3 unidades" },
    { "name": "Mermelada de melocotón o albaricoque", "quantity": "c/n" }
  ],
  "steps": [
    { "step": "Colocar en un bol los 2 huevos, azúcar, leche y harina." },
    { "step": "Pelar y trocear 2 manzanas Golden e incorporarlas al bol." },
    { "step": "Triturar todos los ingredientes con batidora hasta obtener una crema homogénea." },
    { "step": "Verter la crema en un molde y hornear a 180°C por aproximadamente 20 minutos." },
    { "step": "Pelar la tercera manzana, cortarla en láminas finas y colocar sobre la tarta horneada." },
    { "step": "Poner cucharaditas de mermelada por encima de las manzanas." },
    { "step": "Volver a hornear con calor superior hasta que la tarta esté doradita." },
    { "step": "Sacar del horno, dejar enfriar y servir." }
  ],
  "images": [
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TartaManzanaFacil/TartaManzanaFacil+1.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TartaManzanaFacil/TartaManzanaFacil+2.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TartaManzanaFacil/TartaManzanaFacil+3.webp"
  ],
  "rating": null,
  "tips": [
    "Tarta Express: Masa lista en un solo paso de batido, ideal para postres rápidos.",
    "Doble Horneado: Primero se hornea la base, luego se decora y se vuelve a hornear para dorar la superficie.",
    "Glaseado: La mermelada de melocotón o albaricoque aporta brillo y sabor dulce.",
    "Manzanas: Pelar las manzanas para la decoración es opcional, pero las láminas finas quedan más elegantes.",
    "Textura: El triturado de la masa garantiza una tarta cremosa y uniforme."
  ]
},
{
  "id": 7,
  "uid": "P-STY_000007",
  "name": "Tarta de Manzana V3",
  "description": "Pastel rápido, húmedo y muy frutal, con abundante manzana en la masa y láminas decorativas en la superficie. Ideal para un postre clásico y reconfortante.",
  "imageUrl": "https://example.com/pastel-manzana-mucha.jpg",
  "detailedInfo": "Receta de pastel de manzana con gran cantidad de fruta. La masa se prepara en un solo bol, incorporando manzana troceada a la mezcla y decorando con láminas por encima. Se hornea en un molde pequeño de 18 cm a 180ºC durante 1 hora, logrando un pastel húmedo, aromático y delicioso. La mantequilla y la ralladura de limón realzan el sabor clásico del pastel.",
  "ingredients": [
    { "name": "Huevos", "quantity": "3 unidades" },
    { "name": "Azúcar", "quantity": "60g (4 cucharadas)" },
    { "name": "Leche", "quantity": "100ml (1/2 vaso)" },
    { "name": "Mantequilla derretida", "quantity": "30g (30ml)" },
    { "name": "Harina de trigo común", "quantity": "80g (4 cucharadas)" },
    { "name": "Levadura química", "quantity": "1/2 cda" },
    { "name": "Manzanas", "quantity": "2 grandes o 4 pequeñas" },
    { "name": "Sal", "quantity": "1 pizca" },
    { "name": "Ralladura de limón", "quantity": "1/2 piel" }
  ],
  "steps": [
    { "step": "Batir los huevos con el azúcar y la pizca de sal hasta que espumen." },
    { "step": "Añadir la leche, la mantequilla derretida y la ralladura de limón. Mezclar bien." },
    { "step": "Tamizar la harina junto con la levadura química e incorporar a la mezcla húmeda. Batir hasta obtener una masa homogénea." },
    { "step": "Pelar y cortar las manzanas. Trocear una parte e incorporarla a la masa, reservar el resto en láminas para decorar la superficie." },
    { "step": "Verter la masa en un molde de 18 cm previamente enmantecado y colocar las láminas de manzana encima." },
    { "step": "Hornear en horno precalentado a 180ºC con calor arriba y abajo durante 1 hora, hasta que esté cocido y dorado." },
    { "step": "Retirar del horno, dejar enfriar y servir." }
  ],
  "images": [
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/PastelManzanaMucha/PastelManzana+1.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/PastelManzanaMucha/PastelManzana+2.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/PastelManzanaMucha/PastelManzana+3.webp"
  ],
  "rating": null,
  "tips": [
    "Sin Horno: Aunque esta receta se hornea, se puede adaptar a sartén para versiones rápidas sin horno.",
    "Doble Uso de Manzanas: Troceadas para la masa y laminadas para la decoración, aportan sabor y humedad.",
    "Molde Pequeño: Usar un molde de 18 cm ayuda a que la tarta quede más alta y húmeda.",
    "Horneado Uniforme: Calor arriba y abajo asegura que la tarta se cocine de manera pareja.",
    "Aroma Extra: La ralladura de limón y la mantequilla aportan un sabor clásico y aromático al pastel."
  ]
},
{
  "id": 8,
  "uid": "P-STY_000008",
  "name": "Tarta de Manzana V4",
  "description": "Tarta de manzana infalible, fácil y rápida, usando la medida de un vaso estándar para la mayoría de los ingredientes. Perfecta para cualquier ocasión.",
  "imageUrl": "https://example.com/tarta-manzana-perfecta.jpg",
  "detailedInfo": "Receta de tarta de manzana destacada por su facilidad y consistencia. Todos los ingredientes principales se miden con un vaso estándar de 200 ml, lo que simplifica la preparación. La tarta combina masa con manzana troceada, decorada con láminas por encima y pincelada con mermelada tras hornearla. Se hornea a 180ºC durante 40-50 minutos y se recomienda enfriar antes de servir para obtener la textura ideal.",
  "ingredients": [
    { "name": "Manzanas", "quantity": "1 kg" },
    { "name": "Harina", "quantity": "200 ml" },
    { "name": "Azúcar o edulcorante", "quantity": "200 ml" },
    { "name": "Leche", "quantity": "200 ml" },
    { "name": "Mantequilla", "quantity": "2 cucharadas" },
    { "name": "Huevos", "quantity": "2 unidades" },
    { "name": "Canela", "quantity": "Al gusto" },
    { "name": "Mermelada", "quantity": "c/n para pincelar" }
  ],
  "steps": [
    { "step": "Batir los huevos con el azúcar o edulcorante hasta integrar." },
    { "step": "Añadir la leche, la harina tamizada, la mantequilla derretida y la canela. Mezclar hasta obtener una masa homogénea." },
    { "step": "Pelar y cortar las manzanas. Trocear parte de ellas e incorporarlas a la masa." },
    { "step": "Verter la mezcla en un molde enmantecado y colocar las láminas de manzana restantes por encima." },
    { "step": "Hornear en horno precalentado a 180ºC durante 40-50 minutos." },
    { "step": "Al sacar del horno, pincelar la superficie con mermelada para dar brillo y dulzor." },
    { "step": "Dejar enfriar al menos 1-2 horas antes de servir para que tome la consistencia ideal." }
  ],
  "images": [
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TartaManzanaPerfecta/TartaManzana+1.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TartaManzanaPerfecta/TartaManzana+2.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TartaManzanaPerfecta/TartaManzana+3.webp"
  ],
  "rating": null,
  "tips": [
    "Medida Única: Usar el mismo vaso de 200 ml para medir harina, azúcar y leche facilita la preparación y reduce errores.",
    "Endulzante: Ajustar el azúcar al gusto o sustituir por edulcorante según preferencia.",
    "Enfriado Vital: Refrigerar la tarta 1-2 horas después de hornear para que tome la consistencia perfecta.",
    "Decoración Simple: Reservar algunas manzanas en láminas para colocar sobre la masa y mejorar la presentación.",
    "Horneado Uniforme: Hornear a 180ºC asegura que la tarta se cocine pareja y adquiera un dorado ideal."
  ]
},
{
  "id": 9,
  "uid": "P-STY_000009",
  "name": "Pastel Tres Leches",
  "description": "Clásico pastel Tres Leches latinoamericano, ligero y jugoso gracias a la técnica del punto cinta y el empapado con la mezcla de leches. Ideal para ocasiones especiales o antojos de postres dulces.",
  "imageUrl": "https://example.com/pastel-tres-leches.jpg",
  "detailedInfo": "Receta de Pastel Tres Leches basada en la técnica del punto cinta. Separamos claras y yemas para lograr un bizcocho esponjoso y ligero, luego se empapa con una mezcla de leche condensada, leche evaporada y crema de leche. Se finaliza con merengue italiano o crema batida. Se recomienda refrigerar varias horas para obtener la mejor textura y sabor.",
  "ingredients": [
    { "name": "Huevos", "quantity": "5 unidades", "detail": "Separar claras y yemas" },
    { "name": "Azúcar", "quantity": "100 g" },
    { "name": "Extracto de vainilla", "quantity": "1 cdita" },
    { "name": "Harina 0000", "quantity": "150 g" },
    { "name": "Leche condensada", "quantity": "1 lata (aprox. 395 g)" },
    { "name": "Leche evaporada", "quantity": "1 lata (aprox. 354 ml) o 350 ml de leche entera" },
    { "name": "Crema de leche (nata)", "quantity": "200 ml" },
    { "name": "Merengue italiano o crema batida", "quantity": "c/n", "detail": "Para cubrir la superficie" },
    { "name": "Canela en polvo", "quantity": "c/n", "detail": "Opcional para espolvorear al final" }
  ],
  "steps": [
    { "step": "Separar claras y yemas de los huevos." },
    { "step": "Batir las yemas con la mitad del azúcar y el extracto de vainilla hasta espumar y obtener color amarillo pálido." },
    { "step": "Incorporar la harina tamizada en movimientos envolventes hasta integrar." },
    { "step": "Batir las claras a punto de nieve, agregando el resto del azúcar poco a poco hasta obtener picos firmes." },
    { "step": "Mezclar cuidadosamente las claras con la mezcla de yemas y harina usando movimientos envolventes, sin perder aire." },
    { "step": "Verter la mezcla en un molde enmantecado y hornear a 160°C por 30 minutos o hasta que al insertar un palillo, salga limpio." },
    { "step": "Mientras el bizcocho se hornea, preparar la mezcla de leches: combinar leche condensada, leche evaporada y crema de leche. Calentar ligeramente si se desea." },
    { "step": "Al sacar el bizcocho caliente del horno, darle unos golpes suaves sobre la mesa y pinchar con un palillo por toda la superficie." },
    { "step": "Verter la mezcla de leches poco a poco sobre el bizcocho, asegurando que se absorba completamente." },
    { "step": "Cubrir con merengue italiano o crema batida." },
    { "step": "Espolvorear canela en polvo si se desea y refrigerar varias horas antes de servir para obtener la textura ideal." }
  ],
  "images": [
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TresLeches/TresLeches+1.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TresLeches/TresLeches+2.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TresLeches/TresLeches+3.webp"
  ],
  "rating": null,
  "tips": [
    "Absorción: Verter la mezcla de las tres leches sobre el bizcocho cuando aún está caliente para que la absorba mejor.",
    "Merengue: El Merengue Italiano es la cobertura clásica, pero la crema batida es una alternativa fácil y deliciosa.",
    "Reposo Largo: Refrigerar el pastel varias horas o toda la noche para que los sabores y la humedad se asienten correctamente.",
    "Punto Cinta: Batir bien las yemas y separar claras es clave para lograr un bizcocho ligero y esponjoso.",
    "Pinchado: Pinchar el bizcocho antes de verter la mezcla de leches permite que se absorba uniformemente."
  ]
},
{
  "id": 10,
  "uid": "P-STY_000010",
  "name": "Tres Leches V2",
  "description": "Bizcocho aireado a punto cinta, empapado con jarabe de tres leches y terminado con crema chantilly o merengue. La absorción uniforme del jarabe asegura un pastel húmedo y delicioso.",
  "imageUrl": "https://example.com/tres-leches-definitivo.jpg",
  "detailedInfo": "Receta enfocada en obtener un bizcocho ligero y esponjoso mediante la técnica del punto cinta. La absorción gradual del jarabe de leches evita que se empoche y permite un pastel húmedo y perfectamente equilibrado. Se puede cubrir con crema chantilly o merengue y espolvorear canela en polvo al gusto.",
  "ingredients": [
    { "name": "Huevos", "quantity": "4 unidades" },
    { "name": "Azúcar", "quantity": "90 g" },
    { "name": "Harina cernida", "quantity": "120 g" },
    { "name": "Leche evaporada", "quantity": "c/n" },
    { "name": "Leche condensada", "quantity": "c/n" },
    { "name": "Crema de leche (nata)", "quantity": "c/n" },
    { "name": "Canela en polvo", "quantity": "c/n" },
    { "name": "Azúcar en polvo", "quantity": "opcional" }
  ],
  "steps": [
    { "step": "Batir los 4 huevos con los 90 g de azúcar a velocidad media hasta obtener el punto cinta o letra." },
    { "step": "Incorporar la harina cernida en 3 a 5 dosis, usando movimientos envolventes para no bajar la mezcla." },
    { "step": "Verter la mezcla en un molde enmantecado y hornear a 160°C durante 30 minutos." },
    { "step": "Al sacar del horno, golpear suavemente el bizcocho contra la mesa y dejar enfriar." },
    { "step": "Preparar el jarabe mezclando la leche evaporada, leche condensada y crema de leche. Calentar ligeramente si se desea." },
    { "step": "Pinchar el bizcocho con muchos huequitos y verter el jarabe poco a poco, asegurando absorción uniforme y evitando que se empoche." },
    { "step": "Cubrir opcionalmente con merengue o crema chantilly (batir la crema hasta obtener picos suaves, añadir azúcar en polvo solo si se desea)." },
    { "step": "Espolvorear canela en polvo al gusto y refrigerar varias horas antes de servir." }
  ],
  "images": [
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TresLeches/TresLeches_Definitivo_1.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TresLeches/TresLeches_Definitivo_2.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TresLeches/TresLeches_Definitivo_3.webp"
  ],
  "rating": null,
  "tips": [
    "Punto Cinta: Esencial para un bizcocho aireado que absorba bien el jarabe.",
    "Harina Envolvente: Incorporar la harina cernida en dosis y con movimientos envolventes para no bajar el batido.",
    "Empapado Lento: Verter el jarabe gradualmente para evitar que el bizcocho se empoche y asegurar absorción uniforme.",
    "Crema Chantilly: El chef prefiere la crema chantilly sobre el merengue como cobertura.",
    "Reposo: Refrigerar varias horas para que los sabores y la humedad se asienten correctamente antes de servir."
  ]
},
{
  "id": 11,
  "uid": "P-STY_000011",
  "name": "Pastel Tres Leches V3",
  "description": "Bizcocho aireado empapado con una mezcla de tres leches y cubierto con nata montada. El pinchado y reposo largo aseguran máxima jugosidad y sabor.",
  "imageUrl": "https://example.com/pastel-tres-leches-11.jpg",
  "detailedInfo": "Receta completa de Pastel Tres Leches con cobertura de nata montada. El bizcocho se bate hasta incorporar aire, se incorpora harina con movimientos envolventes, se hornea, se empapa lentamente con el jarabe de tres leches y se cubre con nata montada muy fría. Reposo de 8 horas mínimo o de un día para otro para mejor absorción.",
  "ingredients": [
    { "name": "Huevos", "quantity": "6 unidades" },
    { "name": "Azúcar", "quantity": "150 g" },
    { "name": "Azúcar vainillado", "quantity": "8 g (1 cdta)" },
    { "name": "Aceite de girasol", "quantity": "50 ml" },
    { "name": "Harina de trigo", "quantity": "200 g" },
    { "name": "Levadura química", "quantity": "1/2 cda" },
    { "name": "Leche evaporada", "quantity": "350 ml" },
    { "name": "Nata para montar", "quantity": "200 ml" },
    { "name": "Leche condensada", "quantity": "350 g" },
    { "name": "Opcional: esencia o pasta de vainilla", "quantity": "1 cdta" },
    { "name": "Nata para montar (muy fría)", "quantity": "300 ml" },
    { "name": "Azúcar vainillado", "quantity": "8 g (1 cdta)" },
    { "name": "Azúcar glas", "quantity": "20 g (1 cda)" },
    { "name": "Canela molida", "quantity": "Al gusto" }
  ],
  "steps": [
    { "step": "Batir los 6 huevos con 150 g de azúcar y 8 g de azúcar vainillado durante 5 minutos hasta que duplique volumen y adquiera un color amarillo muy claro." },
    { "step": "Incorporar poco a poco los 50 ml de aceite de girasol a baja velocidad." },
    { "step": "Tamizar la harina de trigo con la levadura química y añadir a la mezcla usando movimientos envolventes para no perder aire." },
    { "step": "Verter la mezcla en un molde rectangular (32 x 22 cm) previamente engrasado y hornear a 180°C durante 35-40 minutos." },
    { "step": "Comprobar con un palillo y dejar enfriar completamente sobre una rejilla." },
    { "step": "Preparar la salsa tres leches mezclando 350 ml de leche evaporada, 200 ml de nata para montar y 350 g de leche condensada. Añadir opcionalmente 1 cdta de esencia de vainilla." },
    { "step": "Pinchar toda la superficie del bizcocho con un palillo y verter la salsa poco a poco hasta que se absorba completamente." },
    { "step": "Cubrir con papel film y refrigerar mínimo 8 horas, idealmente de un día para otro." },
    { "step": "Montar 300 ml de nata muy fría con 8 g de azúcar vainillado y 20 g de azúcar glas hasta obtener picos firmes." },
    { "step": "Cubrir el pastel con la nata montada y decorar con canela molida al gusto. Opcionalmente añadir trocitos de chocolate." }
  ],
  "images": [
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TresLeches/TresLeches_11_1.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TresLeches/TresLeches_11_2.webp",
    "https://d3rbsa8yi0571o.cloudfront.net/Pastry_Recipe/TresLeches/TresLeches_11_3.webp"
  ],
  "rating": null,
  "tips": [
    "Bizcocho Esponjoso: Batir los huevos con azúcar por 5 minutos es esencial para que quede aireado.",
    "Movimientos Envolventes: Al añadir la harina, usar espátula con movimientos envolventes para no perder el aire del batido.",
    "Nata Muy Fría: Fundamental para que monte correctamente.",
    "Reposo Largo: Mínimo 8 horas o toda la noche para máxima absorción y sabor.",
    "Empapado Lento: Verter la salsa tres leches poco a poco para absorción uniforme y evitar que se empoche."
  ]
},
{
  "id": 12,
  "uid": "P-STY_000012",
  "name": "Tres Leches V4",
  "description": "Versión chef con base de queque Cuatro Cuartos, cobertura de Merengue Italiano, toques de coco rallado y manjar para un sabor único y húmedo.",
  "imageUrl": "https://example.com/tres-leches-chef-12.jpg",
  "detailedInfo": "Receta de Álvaro Barrientos Montero para 8 personas. Base de queque Cuatro Cuartos, empapado con mezcla de tres leches aromatizada con canela, cobertura de Merengue Italiano y decorado con coco rallado y manjar. La técnica de perforación, baño lento y gratinado asegura máxima jugosidad y textura.",
  "ingredients": [
    { "name": "Mantequilla", "quantity": "250 g" },
    { "name": "Azúcar granulada", "quantity": "250 g" },
    { "name": "Ralladura de naranja y limón", "quantity": "1 cdta" },
    { "name": "Vainilla líquida", "quantity": "1 cda sopera" },
    { "name": "Huevos enteros", "quantity": "4 unidades" },
    { "name": "Harina", "quantity": "250 g" },
    { "name": "Polvos de horneo", "quantity": "20 g" },
    { "name": "Leche evaporada", "quantity": "1 lata" },
    { "name": "Leche condensada", "quantity": "1 lata" },
    { "name": "Crema de leche / Nata", "quantity": "250 g" },
    { "name": "Canela en polvo", "quantity": "5 g (1/2 cdta)" },
    { "name": "Agua fría", "quantity": "120 cc" },
    { "name": "Azúcar granulada", "quantity": "240 g" },
    { "name": "Claras de huevo", "quantity": "4 unidades" },
    { "name": "Coco rallado", "quantity": "Cantidad necesaria" },
    { "name": "Manjar / Dulce de leche", "quantity": "Cantidad necesaria" }
  ],
  "steps": [
    { "step": "Cremar mantequilla con azúcar y ralladura de cítricos durante 4 minutos. Añadir vainilla." },
    { "step": "Agregar los huevos uno a uno, asegurando incorporación total antes de añadir el siguiente." },
    { "step": "Tamizar harina con polvos de horneo e incorporar gradualmente a la mezcla cremosa a velocidad baja." },
    { "step": "Verter la mezcla en molde enmantequillado y enharinado. Hornear a 180°C por 30 minutos y luego a 170°C los últimos 10 minutos." },
    { "step": "Preparar la salsa tres leches mezclando leche evaporada, leche condensada y crema de leche. Añadir canela." },
    { "step": "Preparar el merengue italiano: Cocinar agua con azúcar hasta punto de pelo. Batir claras a nieve y añadir almíbar en hilo mientras se bate. Continuar hasta que el bol esté frío." },
    { "step": "Perforar el queque recién horneado por todos lados con un tenedor." },
    { "step": "Bañar lentamente con la mezcla de tres leches, pinchando y ayudándose con el tenedor para asegurar penetración uniforme." },
    { "step": "Esparcir coco rallado sobre el queque empapado y agregar puntos de manjar sobre el coco." },
    { "step": "Cubrir con merengue italiano frío, sellando bien los bordes. Dorar la superficie con soplete o gratinador." },
    { "step": "Reposar 30 minutos antes de servir para permitir absorción y asentamiento de sabores." }
  ],
  "images": [
    "https://example.com/tres-leches-chef-12-1.webp",
    "https://example.com/tres-leches-chef-12-2.webp",
    "https://example.com/tres-leches-chef-12-3.webp"
  ],
  "rating": null,
  "tips": [
    "Bizcocho Esponjoso: Batir mantequilla con azúcar y huevos correctamente asegura aireación del queque.",
    "Incorporación Gradual: Integrar harina y polvos de horneo con movimientos envolventes para no perder aire.",
    "Merengue Estable: Cocinar almíbar hasta punto de pelo y añadir lentamente a claras batidas para lograr consistencia firme.",
    "Empapado Lento: Verter la salsa tres leches poco a poco para absorción uniforme.",
    "Reposo Corto: Dejar reposar 30 minutos antes de servir para que los sabores se asienten."
  ]
},
{
  "id": 13,
  "uid": "P-STY_000013",
  "name": "Dulce de Leche",
  "description": "Reducir y concentrar leche con azúcar y bicarbonato mediante cocción lenta para lograr un dulce de leche casero con color, textura y sabor inconfundibles.",
  "imageUrl": "https://example.com/dulce-leche-13.jpg",
  "detailedInfo": "Receta casera de dulce de leche para 2 litros. Cocción lenta con azúcar y bicarbonato, controlando la reducción y color. Se aromatiza con esencia de vainilla y se envasa caliente, tomando cuerpo en la heladera.",
  "ingredients": [
    { "name": "Leche entera", "quantity": "2 Litros" },
    { "name": "Azúcar", "quantity": "500 g" },
    { "name": "Bicarbonato de sodio", "quantity": "1/2 cucharadita" },
    { "name": "Esencia de vainilla", "quantity": "Chorrito" }
  ],
  "steps": [
    { "step": "En una cacerola grande, mezclar la leche, el azúcar y el bicarbonato de sodio." },
    { "step": "Llevar a fuego medio, revolviendo constantemente para evitar que rebalse." },
    { "step": "Cocinar aproximadamente 2 horas, removiendo con frecuencia. Ajustar el fuego si amenaza con rebalsar." },
    { "step": "A los 50 minutos, observar el cambio de color y continuar revolviendo." },
    { "step": "La cocción final tarda alrededor de 1 hora y 40 minutos. El dulce estará listo cuando al levantarlo deje surcos temporales en la superficie." },
    { "step": "Añadir un chorrito de esencia de vainilla al final." },
    { "step": "Pasar el dulce de leche a frascos. Tomará más cuerpo al enfriarse en la heladera." }
  ],
  "images": [
    "https://example.com/dulce-leche-13-1.webp",
    "https://example.com/dulce-leche-13-2.webp",
    "https://example.com/dulce-leche-13-3.webp"
  ],
  "rating": null,
  "tips": [
    "Usar leche entera (3% grasa) para obtener la textura y sabor adecuados.",
    "El bicarbonato es clave para la caramelización y color característico.",
    "Para evitar que se pegue, se pueden colocar canicas en el fondo de la cacerola o remover constantemente.",
    "Usar utensilios de acero inoxidable o madera según el tipo de cacerola.",
    "Conservar en heladera máximo 3-4 semanas; es un producto casero."
  ]
},
{
  "id": 14,
  "uid": "P-STY_000014",
  "name": "Dulce de Leche V2",
  "description": "Dulce de leche cremoso y de color marrón claro, obtenido mediante evaporación controlada de la leche con azúcar, crema y bicarbonato.",
  "imageUrl": "https://example.com/dulce-leche-clasico-14.jpg",
  "detailedInfo": "Receta clásica de Dulce de Leche al estilo Cocineros Argentinos. La mezcla de leche, azúcar, crema y bicarbonato se cocina lentamente, controlando la reducción y color. Se logra un dulce de leche líquido que tomará cuerpo al enfriarse.",
  "ingredients": [
    { "name": "Leche entera", "quantity": "2 Litros" },
    { "name": "Azúcar", "quantity": "440 g" },
    { "name": "Crema de leche", "quantity": "80 g" },
    { "name": "Bicarbonato de sodio", "quantity": "2 g" }
  ],
  "steps": [
    { "step": "En una olla de fondo grueso, mezclar la leche, azúcar, crema de leche y bicarbonato de sodio en frío." },
    { "step": "Llevar a fuego fuerte hasta que hierva, luego bajar inmediatamente a mínimo." },
    { "step": "Revolver constantemente al principio para disolver el azúcar y evitar que se pegue." },
    { "step": "Cocinar lentamente durante aproximadamente 1 hora y 30 minutos, observando el cambio de color de blanco a marrón claro." },
    { "step": "Cuando alcance color y consistencia deseada, hacer la prueba del plato frío: una gota de dulce de leche en un plato del freezer debe formar un surco que no se junte." },
    { "step": "Apagar el fuego inmediatamente al alcanzar el punto, ya que el dulce espesará al enfriar." },
    { "step": "Dejar enfriar y envasar. El dulce de leche tomará cuerpo y textura final en la heladera." }
  ],
  "images": [
    "https://example.com/dulce-leche-clasico-14-1.webp",
    "https://example.com/dulce-leche-clasico-14-2.webp",
    "https://example.com/dulce-leche-clasico-14-3.webp"
  ],
  "rating": null,
  "tips": [
    "Agregar crema de leche aumenta la materia grasa y da un dulce más cremoso.",
    "Usar exactamente 1 g de bicarbonato por litro de leche para lograr color y sabor correctos.",
    "Olla de fondo grueso para distribución uniforme del calor y evitar que se pegue.",
    "El dulce debe estar líquido al apagar el fuego, se espesará al enfriar.",
    "Métodos antiguos para evitar que se pegue: colocar un plato al revés en el fondo de la olla o usar canicas de vidrio."
  ]
},
{
  "id": 15,
  "uid": "P-STY_000015",
  "name": "Manjar Rápido con Leche Condensada",
  "description": "Manjar (dulce de leche) espeso y tostado preparado mediante la cocción controlada de una lata de leche condensada, ideal para postres y rellenos.",
  "imageUrl": "https://example.com/manjar-leche-condensada-15.jpg",
  "detailedInfo": "Este método rápido transforma leche condensada en un manjar con cuerpo y sabor profundo. La lata se cocina sumergida en agua, aprovechando la caramelización interna sin agregar ingredientes adicionales.",
  "ingredients": [
    { "name": "Leche condensada", "quantity": "1 lata (aprox. 400 g)" },
    { "name": "Agua", "quantity": "Cantidad necesaria para cubrir la lata" }
  ],
  "steps": [
    { "step": "Retirar completamente la etiqueta de papel de la lata de leche condensada para evitar restos o obstrucciones durante la cocción." },
    { "step": "Colocar la lata cerrada dentro de una olla (a presión o tradicional) y cubrirla completamente con agua, dejando al menos dos o tres dedos por encima." },
    { "step": "Cocinar según el método elegido: en olla a presión, 30 minutos para un manjar claro, 45 minutos para uno intermedio, o 1 hora para un manjar más oscuro y espeso." },
    { "step": "Si se usa olla tradicional, cocinar durante 3 horas a fuego bajo con la tapa puesta, verificando periódicamente que la lata permanezca siempre cubierta de agua." },
    { "step": "Una vez finalizada la cocción, apagar el fuego y dejar enfriar completamente la lata a temperatura ambiente antes de abrirla." },
    { "step": "Abrir solo cuando esté fría. Al hacerlo, la leche condensada se habrá transformado en un manjar cremoso, espeso y de color tostado." }
  ],
  "images": [
    "https://example.com/manjar-leche-condensada-15-1.webp",
    "https://example.com/manjar-leche-condensada-15-2.webp",
    "https://example.com/manjar-leche-condensada-15-3.webp"
  ],
  "rating": null,
  "tips": [
    "Nunca abrir la lata mientras esté caliente: puede explotar por la presión interna.",
    "Mantén la lata siempre completamente cubierta de agua durante toda la cocción.",
    "Tiempos de referencia: olla a presión 30–45 min para manjar claro, 1 hora para oscuro y espeso; olla tradicional 3 horas a fuego bajo.",
    "Enfriar completamente antes de abrir para evitar accidentes y lograr mejor textura.",
    "El tiempo define la consistencia: menos tiempo produce un manjar suave; más tiempo, uno más firme y concentrado.",
    "Ideal para rellenar alfajores, galletas o tortas; se conserva refrigerado por varios días."
  ]
},
{
  "id": 16,
  "uid": "P-STY_000016",
  "name": "Dulce de Leche V3",
  "description": "Versión rápida de dulce de leche preparada con leche, leche condensada y caramelo de azúcar, logrando un sabor tostado y color intenso en pocos minutos.",
  "imageUrl": "https://example.com/dulce-leche-rapido-lila-16.jpg",
  "detailedInfo": "Receta práctica que combina leche y leche condensada con un caramelo de azúcar, logrando una caramelización controlada sin necesidad de largas horas de cocción. Ideal para quienes buscan un dulce de leche rápido y sabroso.",
  "ingredients": [
    { "name": "Leche", "quantity": "500 ml" },
    { "name": "Leche condensada", "quantity": "400 g" },
    { "name": "Azúcar blanco", "quantity": "200 g" }
  ],
  "steps": [
    { "step": "En una cacerola, mezclar la leche y la leche condensada, removiendo a fuego bajo hasta que se integren y se templen (unos 2–3 minutos)." },
    { "step": "En otra olla honda, colocar el azúcar a fuego medio y remover constantemente hasta obtener un caramelo dorado y líquido (aprox. 4–5 minutos)." },
    { "step": "Reducir el fuego al mínimo y agregar con cuidado la mezcla de leches templada sobre el caramelo caliente. El caramelo se aglutinará por el choque térmico, lo cual es normal." },
    { "step": "Remover constantemente a fuego lento hasta que el caramelo disuelto se integre por completo, lo que tomará entre 10 y 15 minutos." },
    { "step": "Subir el fuego a medio y seguir revolviendo hasta que la mezcla espese y adquiera la consistencia deseada (unos 5 minutos adicionales)." },
    { "step": "Retirar del fuego y dejar enfriar antes de envasar o utilizar. El dulce de leche tomará más cuerpo al enfriarse." }
  ],
  "images": [
    "https://example.com/dulce-leche-rapido-lila-16-1.webp",
    "https://example.com/dulce-leche-rapido-lila-16-2.webp",
    "https://example.com/dulce-leche-rapido-lila-16-3.webp"
  ],
  "rating": null,
  "tips": [
    "El choque térmico entre el caramelo caliente y la leche templada es intencional; remover constantemente para disolver los grumos.",
    "Usar fuego bajo al unir ambas mezclas para evitar salpicaduras peligrosas.",
    "El caramelo define el color y sabor del dulce; controlar el tostado según preferencia.",
    "Remover durante 10–15 minutos para disolver el caramelo por completo antes del espesado final.",
    "Cocinar 5 minutos adicionales a fuego medio para lograr una textura cremosa y brillante.",
    "Ideal para rellenos de tortas, alfajores o como acompañamiento de postres."
  ]
},
{
  "id": 17,
  "uid": "P-STY_000017",
  "name": "Brigadeiros (Bombones de Chocolate Brasileños)",
  "description": "Clásicos bombones brasileños elaborados con leche condensada, manteca y cacao amargo, con una cocción rápida que logra una textura suave, brillante y fácil de moldear.",
  "imageUrl": "https://example.com/brigadeiros-17.jpg",
  "detailedInfo": "Receta tradicional brasileña donde la mezcla de leche condensada, manteca y cacao amargo se cocina hasta obtener una masa espesa que se separa del fondo de la sartén. Una vez enfriada, se forman pequeñas bolitas cubiertas con cacao, coco o granas de chocolate.",
  "ingredients": [
    { "name": "Leche condensada", "quantity": "2 potes (aprox. 800 g)" },
    { "name": "Manteca", "quantity": "50 g" },
    { "name": "Cacao amargo", "quantity": "8 cucharadas" },
    { "name": "Cobertura (cacao, granas o coco)", "quantity": "cantidad necesaria" }
  ],
  "steps": [
    { "step": "Colocar la leche condensada, la manteca y el cacao amargo en una sartén o cacerola a fuego medio." },
    { "step": "Remover constantemente con una espátula para evitar que se pegue o queme." },
    { "step": "Cocinar durante unos 10 minutos hasta que la mezcla se espese y se despegue fácilmente del fondo." },
    { "step": "Pasar la mezcla caliente a una fuente y cubrir con una bolsita plástica en contacto para mantener la humedad." },
    { "step": "Llevar a la heladera hasta que esté fría y firme, aproximadamente 1 hora." },
    { "step": "Mojar ligeramente las manos con agua y formar bolitas con pequeñas porciones de masa." },
    { "step": "Rebozar cada bolita en la cobertura elegida: cacao, coco rallado o granas de chocolate." }
  ],
  "images": [
    "https://example.com/brigadeiros-17-1.webp",
    "https://example.com/brigadeiros-17-2.webp",
    "https://example.com/brigadeiros-17-3.webp"
  ],
  "rating": null,
  "tips": [
    "Usar cacao amargo de buena calidad mejora notablemente el sabor.",
    "Remover sin parar durante los 10 minutos de cocción para evitar que se queme.",
    "El punto ideal es cuando la mezcla se despega del fondo de la sartén sin romperse.",
    "Cubrir con una bolsita en contacto evita que se forme costra y mantiene la textura cremosa.",
    "Formar las bolitas solo cuando la mezcla esté completamente fría para lograr una superficie lisa.",
    "Enfriar bien antes de servir para que los bombones conserven su forma y brillo."
  ]
},
{
  "id": 18,
  "uid": "P-STY_000018",
  "name": "Brigadeiro V2",
  "description": "Versión clásica del brigadeiro brasileño, con punto de cocción preciso para usar como bombón, relleno o cobertura. Su textura suave y brillante lo hace irresistible.",
  "imageUrl": "https://example.com/brigadeiro-clasico-nestle-18.jpg",
  "detailedInfo": "Receta tradicional de la marca Nestlé, donde la mezcla de leche condensada, mantequilla y chocolate en polvo se cocina lentamente hasta lograr la textura deseada. Puede adaptarse para formar bombones, rellenar postres o disfrutar como brigadeiro de cuchara.",
  "ingredients": [
    { "name": "Leche condensada ", "quantity": "400 g (1 lata)" },
    { "name": "Mantequilla sin sal", "quantity": "30 g (2 cucharadas rasas)" },
    { "name": "Chocolate en polvo ", "quantity": "30 g (1 cucharada colmada)" },
    { "name": "Crema de leche (opcional)", "quantity": "1 caja" },
    { "name": "Cobertura (granulado, confites o coco)", "quantity": "cantidad necesaria" }
  ],
  "steps": [
    { "step": "En una sartén, colocar la mantequilla, la leche condensada y el chocolate en polvo. Mezclar bien en frío para evitar grumos." },
    { "step": "Llevar la sartén a fuego bajo, removiendo constantemente para que no se pegue ni se formen grumos." },
    { "step": "Cocinar durante aproximadamente 10 minutos hasta que la mezcla se espese y se desprenda del fondo de la sartén. Este es el punto de enrollar." },
    { "step": "Retirar del fuego y pasar la mezcla a un plato untado con mantequilla. Esparcir para acelerar el enfriado." },
    { "step": "Esperar a que se enfríe completamente antes de formar las bolitas." },
    { "step": "Untar las manos con mantequilla y tomar porciones con una cuchara para formar las esferas." },
    { "step": "Rebozar las bolitas en la cobertura elegida (granulado, coco o azúcar refinada) y colocarlas en capacillos de papel." }
  ],
  "images": [
    "https://example.com/brigadeiro-clasico-nestle-18-1.webp",
    "https://example.com/brigadeiro-clasico-nestle-18-2.webp",
    "https://example.com/brigadeiro-clasico-nestle-18-3.webp"
  ],
  "rating": null,
  "tips": [
    "Cocinar a fuego bajo y remover constantemente es clave para evitar grumos o que se queme la mezcla.",
    "El punto exacto para enrollar es cuando la masa se despega del fondo sin romperse, alrededor de 10 minutos de cocción.",
    "Si se desea usar como relleno o cobertura, retirar del fuego un poco antes para mantener una textura más líquida.",
    "Para hacer brigadeiro de cuchara, añadir una caja de crema de leche una vez que la mezcla base esté lista.",
    "Untar el plato y las manos con mantequilla ayuda a manipular fácilmente la masa sin que se adhiera.",
    "También puede usarse para rellenar bombones con frutas enteras como fresas o uvas, evitando que suelten líquido.",
    "Variaciones: quitar el chocolate en polvo para un brigadeiro blanco, o reemplazarlo por Nesquik de fresa para una versión rosa."
  ]
},
{
  "id": 19,
  "uid": "P-STY_000019",
  "name": "Brigadeiro Clásico V3",
  "description": "El clásico dulce brasileño hecho con leche condensada, mantequilla y cacao, ideal para formar bombones, usar como relleno o disfrutar a cucharadas.",
  "imageUrl": "https://example.com/brigadeiro-clasico-19.jpg",
  "detailedInfo": "Receta tradicional de brigadeiro, el dulce brasileño que se cocina lentamente hasta lograr la textura perfecta para enrollar o usar como cobertura. Se puede añadir crema de leche al final para obtener la versión cremosa 'brigadeiro de cuchara', ideal como postre.",
  "ingredients": [
    { "name": "Leche condensada", "quantity": "400 g (1 lata)" },
    { "name": "Mantequilla sin sal", "quantity": "30 g (1 cucharada)" },
    { "name": "Cacao en polvo", "quantity": "7 cucharadas" },
    { "name": "Crema de leche (opcional)", "quantity": "1 caja" },
    { "name": "Cobertura (granulado, coco rallado o azúcar)", "quantity": "cantidad necesaria" }
  ],
  "steps": [
    { "step": "En una sartén, colocar la mantequilla, la leche condensada y el cacao en polvo antes de encender el fuego. Mezclar bien en frío para evitar grumos." },
    { "step": "Cocinar a fuego bajo, revolviendo sin parar para evitar que la mezcla se pegue o queme." },
    { "step": "Continuar la cocción durante unos 10 minutos, hasta que la masa espese y se desprenda fácilmente del fondo de la sartén (punto de enrollar)." },
    { "step": "Retirar del fuego y transferir la mezcla a un plato untado con mantequilla. Esparcirla para que enfríe más rápido." },
    { "step": "Una vez fría, untar las manos con mantequilla sin sal, tomar porciones con una cuchara y formar bolitas." },
    { "step": "Pasar cada bolita por granas, coco rallado o azúcar para cubrirlas completamente." }
  ],
  "images": [
    "https://example.com/brigadeiro-clasico-19-1.webp",
    "https://example.com/brigadeiro-clasico-19-2.webp",
    "https://example.com/brigadeiro-clasico-19-3.webp"
  ],
  "rating": null,
  "tips": [
    "Cocinar a fuego bajo y revolver constantemente durante unos 10 minutos para alcanzar el punto justo de masa que se desprende del fondo.",
    "Si se desea usar como relleno o cobertura, retirar del fuego antes de alcanzar el punto de despegue para mantener una textura más fluida.",
    "Agregar crema de leche al final si se busca una versión más suave tipo 'brigadeiro de cuchara'.",
    "Untar las manos con mantequilla evita que la masa se adhiera durante el formado.",
    "Usar fruta entera como relleno (fresas o uvas sin semilla) evita que suelte líquido y mantenga la forma del bombón.",
    "Variaciones: eliminar el cacao para un brigadeiro blanco o reemplazarlo por cacao con sabor (como fresa en polvo) para obtener un tono diferente."
  ]
},
{
  "id": 20,
  "uid": "P-STY_000020",
  "name": "Brigadeiro V4",
  "description": "Bombones de chocolate brasileños blanditos y deliciosos, hechos con solo mantequilla, leche condensada y cacao, sin horno, con reposo en frío para lograr la consistencia ideal.",
  "imageUrl": "https://example.com/brigadeiro-facil-20.jpg",
  "detailedInfo": "Receta muy fácil de brigadeiros con solo 3 ingredientes. La mezcla se cocina a fuego medio hasta espesar, se enfría en varias etapas y se forma en bolitas que se pueden decorar con granas, coco o azúcar. Ideal para postres rápidos y festivos.",
  "ingredients": [
    { "name": "Mantequilla", "quantity": "30 g (2 cucharadas rasas)" },
    { "name": "Leche condensada", "quantity": "400 g (1 lata pequeña)" },
    { "name": "Cacao en polvo", "quantity": "30 g (1 cucharada colmada)" },
    { "name": "Decoración (granas, coco rallado, bolitas de colores)", "quantity": "cantidad necesaria" }
  ],
  "steps": [
    { "step": "En un cazo o sartén, colocar la mantequilla, la leche condensada y el cacao en polvo." },
    { "step": "Cocinar a fuego medio-alto, mezclando constantemente hasta que la mantequilla se derrita y todos los ingredientes se integren (aprox. 3–4 minutos)." },
    { "step": "Continuar moviendo; cuando la mezcla comience a espesar, bajar el fuego y seguir revolviendo hasta que se despegue del fondo de la sartén al inclinarla (aprox. 2–3 minutos adicionales)." },
    { "step": "Transferir la mezcla a un recipiente y cubrir con plástico film en contacto con la superficie para evitar que se forme costra." },
    { "step": "Dejar templar a temperatura ambiente unos 20 minutos y luego refrigerar durante mínimo 8 horas (ideal de un día para otro) hasta que esté completamente firme." },
    { "step": "Tomar porciones con una cucharita (aprox. 20 g cada una) y bolear con las manos." },
    { "step": "Pasar cada bolita por la decoración elegida y colocar en canastillas de papel si se desea para presentación." }
  ],
  "images": [
    "https://example.com/brigadeiro-facil-20-1.webp",
    "https://example.com/brigadeiro-facil-20-2.webp",
    "https://example.com/brigadeiro-facil-20-3.webp"
  ],
  "rating": null,
  "tips": [
    "Remover constantemente durante la cocción para evitar que se pegue a la sartén, especialmente cuando espesa rápidamente.",
    "Bajar el fuego cuando la mezcla espese para controlar el despegue y evitar quemar la base.",
    "El reposo en frío mínimo de 8 horas (mejor de un día para otro) es clave para que la masa se solidifique y se pueda bolear fácilmente.",
    "Cubrir con plástico film en contacto con la superficie evita costra y sequedad.",
    "Se puede decorar con granas, coco rallado o azúcar al gusto.",
    "Conservar los brigadeiros en la nevera hasta una semana."
  ]
},
{
  "id": 21,
  "uid": "P-STY_000021",
  "name": "Suspiro Limeño",
  "description": "Postre peruano tradicional compuesto por un manjar blanco cremoso y un merengue de vino dulce, decorado con canela molida.",
  "imageUrl": "https://example.com/suspiro-limena-21.jpg",
  "detailedInfo": "Receta paso a paso del Suspiro de Limeña, combinando la base de manjar blanco con un merengue italiano hecho con vino dulce. Ideal para copas o vasos individuales, este postre destaca por su textura cremosa y su merengue firme y brillante.",
  "ingredients": [
    { "name": "Leche condensada", "quantity": "1 lata (aprox. 397 g)" },
    { "name": "Leche evaporada", "quantity": "1 lata (aprox. 400 g)" },
    { "name": "Yemas de huevo", "quantity": "4 unidades" },
    { "name": "Claras de huevo", "quantity": "4 unidades" },
    { "name": "Azúcar", "quantity": "250 g" },
    { "name": "Vino dulce", "quantity": "1 taza" },
    { "name": "Canela molida", "quantity": "cantidad necesaria para espolvorear" }
  ],
  "steps": [
    { "step": "En una olla de fondo grueso, verter la leche condensada y la leche evaporada." },
    { "step": "Cocinar a fuego bajo, revolviendo constantemente con cuchara de palo o espátula durante aproximadamente 47-50 minutos, hasta que la mezcla espese y cambie a un color ligeramente dorado." },
    { "step": "Apagar el fuego y dejar que el manjar blanco enfríe hasta estar tibio." },
    { "step": "Incorporar las yemas de huevo tibias al manjar blanco y mezclar hasta obtener una mezcla homogénea." },
    { "step": "Verter el manjar blanco en copas, vasos o moldes individuales y llevar al refrigerador para que enfríe y tome consistencia." },
    { "step": "En una olla pequeña, calentar el azúcar con el vino dulce hasta obtener un almíbar a punto de bolitas semiduras." },
    { "step": "Batir las claras a punto de nieve y agregar el almíbar caliente en forma de hilo mientras se sigue batiendo, hasta obtener un merengue firme y brillante." },
    { "step": "Colocar el merengue en una manga pastelera y decorar sobre el manjar blanco ya refrigerado." },
    { "step": "Espolvorear canela molida sobre el merengue antes de servir." }
  ],
  "images": [
    "https://example.com/suspiro-limena-21-1.webp",
    "https://example.com/suspiro-limena-21-2.webp",
    "https://example.com/suspiro-limena-21-3.webp"
  ],
  "rating": null,
  "tips": [
    "Usar olla de fondo grueso para evitar que el manjar blanco se pegue o se queme durante la cocción larga.",
    "Revolver constantemente durante casi 50 minutos garantiza textura espesa y caramelizada.",
    "Añadir las yemas solo cuando la mezcla esté tibia para evitar que se cuajen.",
    "Para el merengue, agregar el almíbar caliente lentamente mientras se baten las claras asegura un merengue firme y estable.",
    "El vino dulce reemplaza al agua en el almíbar y aporta sabor característico al merengue.",
    "Se puede servir en copas individuales o vasos pequeños para mejor presentación."
  ]
},
{
  "id": 22,
  "uid": "P-STY_000022",
  "name": "Suspiro Limeño V2",
  "description": "Postre peruano tradicional con base de manjar blanco y merengue de vino dulce, preparado con dos métodos de manjar: uno tradicional de 30 minutos y otro rápido de 5 minutos.",
  "imageUrl": "https://example.com/suspiro-limena-22.jpg",
  "detailedInfo": "Receta paso a paso del Suspiro de Limeña, combinando manjar blanco cremoso con merengue italiano hecho con vino dulce. Incluye métodos tradicional y rápido para la base de manjar, y un merengue estable y brillante para decorar.",
  "ingredients": [
    { "name": "Leche condensada", "quantity": "1 lata (aprox. 400 g)" },
    { "name": "Leche evaporada", "quantity": "1 lata" },
    { "name": "Yemas de huevo", "quantity": "4 unidades" },
    { "name": "Esencia de vainilla líquida", "quantity": "1 cucharada sopera (20 ml)" },
    { "name": "Canela en rama", "quantity": "2–3 cortezas" },
    { "name": "Manjar o dulce de leche", "quantity": "1 cucharada sopera (solo para versión rápida)" },
    { "name": "Claras de huevo", "quantity": "4 unidades (aprox. 125 g)" },
    { "name": "Azúcar granulada", "quantity": "250 g" },
    { "name": "Vino dulce tipo Oporto", "quantity": "80 ml" },
    { "name": "Canela molida", "quantity": "cantidad necesaria para espolvorear" }
  ],
  "steps": [
    { "step": "Manjar Blanco Tradicional: En una olla de fondo grueso, combinar leche condensada, leche evaporada, esencia de vainilla y canela en rama." },
    { "step": "Calentar a fuego alto hasta hervir, luego bajar el fuego y cocinar 30 minutos, revolviendo constantemente, hasta que espese y tome color dorado/café." },
    { "step": "Templar las yemas: verter un poco de la mezcla caliente en un bowl, agregar las yemas y mezclar rápido para evitar que se cocinen." },
    { "step": "Agregar la mezcla templada con yemas al resto del manjar en la olla y mezclar hasta integrar completamente." },
    { "step": "Colar la mezcla para retirar canela y servir en copas hasta un tercio de su capacidad. Refrigerar para que tome consistencia." },
    { "step": "Manjar Blanco Rápido: Mezclar todos los ingredientes desde el principio (incluyendo la cucharada de manjar) y calentar a fuego fuerte, batiendo constantemente." },
    { "step": "Cuando hierva, bajar el fuego y batir por 5 minutos adicionales hasta espesar. Colar y verter en los pocillos." },
    { "step": "Merengue de Oporto: Calentar azúcar con vino dulce hasta formar almíbar (punto 118 °C o bolita semidura en agua fría)."} ,
    { "step": "Batir las claras a velocidad baja hasta espumosas, luego aumentar velocidad y añadir almíbar caliente en hilo fino, batiendo constantemente." },
    { "step": "Continuar batiendo hasta que el bowl esté frío al tacto para asegurar estabilidad del merengue." },
    { "step": "Montaje: Colocar el merengue sobre el manjar ya frío usando manga pastelera y espolvorear con canela molida antes de servir." }
  ],
  "images": [
    "https://example.com/suspiro-limena-22-1.webp",
    "https://example.com/suspiro-limena-22-2.webp",
    "https://example.com/suspiro-limena-22-3.webp"
  ],
  "rating": null,
  "tips": [
    "Usar olla de fondo grueso para evitar que el manjar blanco se queme durante la cocción larga.",
    "Revolver constantemente garantiza textura homogénea y evita que se pegue al fondo.",
    "Templar las yemas antes de incorporarlas evita que se cocinen y formen grumos.",
    "El merengue debe batirse hasta que el bowl esté frío para que sea estable y no suelte agua al refrigerar.",
    "Se puede optar por la versión rápida del manjar para reducir tiempo de preparación a 5 minutos.",
    "Espolvorear canela molida al final para un acabado clásico y aromático."
  ]
},
{
  "id": 23,
  "uid": "P-STY_000023",
  "name": "Suspiro Limeño V3",
  "description": "Postre peruano tradicional con base de manjar blanco y merengue de vino dulce, preparado para 3 vasos grandes. Combina yemas y esencias para un sabor delicado y merengue estable.",
  "imageUrl": "https://example.com/suspiro-limena-23.jpg",
  "detailedInfo": "Receta paso a paso del Suspiro de Limeña según Juliana Postres, con manjar blanco aromatizado con vainilla y almendras, y merengue italiano de vino dulce. Ideal para presentaciones en vasos individuales o copas.",
  "ingredients": [
    { "name": "Leche condensada", "quantity": "200 g" },
    { "name": "Leche evaporada", "quantity": "200 g" },
    { "name": "Yemas de huevo", "quantity": "2 unidades" },
    { "name": "Esencia de vainilla", "quantity": "1/4 cucharadita" },
    { "name": "Esencia de almendras", "quantity": "1/4 cucharadita" },
    { "name": "Claras de huevo", "quantity": "80 g" },
    { "name": "Azúcar granulada", "quantity": "160 g" },
    { "name": "Vino dulce tipo Oporto", "quantity": "80 g" },
    { "name": "Canela molida", "quantity": "cantidad necesaria para espolvorear" }
  ],
  "steps": [
    { "step": "Crema (Manjar): En una olla, combinar leche condensada, leche evaporada, esencia de vainilla y esencia de almendras." },
    { "step": "Cocinar a fuego medio-bajo, revolviendo constantemente hasta que la mezcla reduzca y cambie de color." },
    { "step": "Retirar del fuego y agregar inmediatamente las yemas de huevo, mezclando bien para integrar sin que se cuajen." },
    { "step": "Dividir la mezcla en vasos o copas y refrigerar por al menos 30 minutos." },
    { "step": "Merengue de Oporto: En una olla, combinar azúcar y vino dulce. Calentar hasta formar almíbar al punto de bola." },
    { "step": "Batir las claras a velocidad baja hasta espumosas, luego aumentar velocidad. Añadir el almíbar caliente lentamente en hilo fino mientras se baten." },
    { "step": "Continuar batiendo hasta que el bowl esté frío y el merengue estable." },
    { "step": "Montaje: Colocar el merengue sobre la crema ya fría usando manga pastelera." },
    { "step": "Espolvorear canela molida o decorar con astillas de canela antes de servir." }
  ],
  "images": [
    "https://example.com/suspiro-limena-23-1.webp",
    "https://example.com/suspiro-limena-23-2.webp",
    "https://example.com/suspiro-limena-23-3.webp"
  ],
  "rating": null,
  "tips": [
    "Usar pequeñas cantidades de esencia de almendras y vainilla para evitar sabor amargo.",
    "Agregar las yemas inmediatamente después de retirar la crema del fuego para que actúen como espesante.",
    "Se puede usar cualquier vino tinto seco o dulce si no se tiene Oporto.",
    "Punto del almíbar: verificar con técnica de bolita en agua fría o burbujas seguidas con varita de papel aluminio.",
    "Servir en vasos pequeños (3–5 onzas) si es para una mesa dulce debido a su gran dulzor."
  ]
},
{
  "id": 24,
  "uid": "P-STY_000024",
  "name": "Torta de Banana Invertida con Dulce de Leche",
  "description": "Torta húmeda de banana invertida con corazón de dulce de leche, basada en una receta viral. Bizcochuelo suave y jugoso con base caramelizada de bananas.",
  "imageUrl": "https://example.com/torta-banana-24.jpg",
  "detailedInfo": "Receta paso a paso de torta de banana invertida con dulce de leche en el centro. La preparación incluye base caramelizada de bananas, bizcochuelo húmedo y horneado adecuado para obtener textura jugosa y uniforme.",
  "ingredients": [
    { "name": "Bananas", "quantity": "2 unidades" },
    { "name": "Caramelo", "quantity": "cantidad necesaria para la base" },
    { "name": "Dulce de leche repostero", "quantity": "3 cucharadas" },
    { "name": "Mantequilla para enmantecar el molde", "quantity": "cantidad necesaria" },
    { "name": "Mantequilla pomada", "quantity": "100 g" },
    { "name": "Azúcar", "quantity": "100 g" },
    { "name": "Esencia de vainilla", "quantity": "1 cucharada" },
    { "name": "Huevo", "quantity": "1 unidad" },
    { "name": "Leche", "quantity": "120 ml" },
    { "name": "Harina 0000", "quantity": "180 g" },
    { "name": "Polvo de hornear", "quantity": "1 cucharada" },
    { "name": "Sal", "quantity": "1 cucharadita" }
  ],
  "steps": [
    { "step": "Enmantecar el molde completamente. Cortar 1 y media banana en rodajas y disponer en la base." },
    { "step": "Preparar caramelo simple y verter sobre las bananas, distribuyendo uniformemente." },
    { "step": "Batir la mantequilla pomada con el azúcar durante 3–4 minutos hasta cremosa." },
    { "step": "Agregar esencia de vainilla y huevo, seguir batiendo." },
    { "step": "Hacer puré con la media banana restante y añadir a la mezcla, continuar batiendo." },
    { "step": "Incorporar la leche, luego la harina, polvo de hornear y sal, batiendo hasta lograr mezcla homogénea." },
    { "step": "Verter la mezcla sobre la base de bananas y caramelo." },
    { "step": "Agregar 3 cucharadas de dulce de leche en el centro y hacer forma de espiral o vetas." },
    { "step": "Hornear a 180 °C por 30–40 minutos o hasta que el centro salga limpio al probar con palillo." },
    { "step": "Desmoldar la torta mientras esté caliente para evitar que el caramelo se adhiera al molde." }
  ],
  "images": [
    "https://example.com/torta-banana-24-1.webp",
    "https://example.com/torta-banana-24-2.webp",
    "https://example.com/torta-banana-24-3.webp"
  ],
  "rating": null,
  "tips": [
    "La mantequilla debe estar pomada y la leche a temperatura ambiente para lograr bizcochuelo húmedo.",
    "Enmantecar muy bien el molde para que la base caramelizada no se pegue.",
    "Usar dulce de leche repostero para mantener la forma dentro de la masa.",
    "Desmoldar en caliente para evitar que el caramelo se endurezca y la torta se adhiera."
  ]
},
{
  "id": 25,
  "uid": "P-STY_000025",
  "name": "Banana Bread",
  "description": "Pan de plátano húmedo y esponjoso, endulzado con eritritol o endulzantes alternativos, con opción de agregar chips de chocolate para un toque extra.",
  "imageUrl": "https://example.com/banana-bread-25.jpg",
  "detailedInfo": "Receta de banana bread que combina plátanos maduros, huevos y endulzante alternativo para obtener un pan esponjoso y húmedo. Ideal para desayuno o merienda saludable.",
  "ingredients": [
    { "name": "Plátanos maduros", "quantity": "3 unidades (240 g)" },
    { "name": "Huevos", "quantity": "2 unidades" },
    { "name": "Eritritol (u otro endulzante)", "quantity": "80 g" },
    { "name": "Aceite de coco o aceite de oliva suave", "quantity": "50 g" },
    { "name": "Esencia de vainilla", "quantity": "cantidad necesaria" },
    { "name": "Harina (avena o trigo)", "quantity": "125 g" },
    { "name": "Polvo de hornear", "quantity": "1 cucharadita" },
    { "name": "Chips de chocolate", "quantity": "cantidad necesaria" }
  ],
  "steps": [
    { "step": "Triturar los plátanos maduros en un bol con un tenedor hasta hacer puré." },
    { "step": "Agregar los huevos y mezclar bien con el puré de plátano." },
    { "step": "Incorporar la esencia de vainilla y el eritritol, mezclando hasta integrar completamente." },
    { "step": "Añadir el aceite (coco o oliva suave) e incorporarlo a la mezcla." },
    { "step": "Agregar la harina y la levadura (polvo de hornear), integrando suavemente sin sobrebatir." },
    { "step": "Incorporar las chips de chocolate a la masa y mezclar." },
    { "step": "Verter la mezcla en un molde tipo plum cake forrado con papel vegetal." },
    { "step": "Repartir algunas chips de chocolate adicionales sobre la superficie de la masa." },
    { "step": "Hornear a 180 °C durante 45 minutos o hasta que al insertar un palillo, éste salga limpio." },
    { "step": "Dejar enfriar antes de cortar y servir." }
  ],
  "images": [
    "https://example.com/banana-bread-25-1.webp",
    "https://example.com/banana-bread-25-2.webp",
    "https://example.com/banana-bread-25-3.webp"
  ],
  "rating": null,
  "tips": [
    "Usar plátanos maduros para mayor dulzor natural y humedad en la masa.",
    "El aceite puede ser de coco o de oliva suave según preferencia de sabor y dieta.",
    "El endulzante eritritol permite una versión sin azúcar añadida.",
    "Evitar sobrebatir la harina para mantener la esponjosidad del pan."
  ]
},
{
  "id": 26,
  "uid": "P-STY_000026",
  "name": "Bizcocho de Plátano",
  "description": "Bizcocho húmedo y esponjoso con sabor a plátano y un toque de canela, ideal para aprovechar plátanos maduros.",
  "imageUrl": "https://example.com/bizcocho-plátano-26.jpg",
  "detailedInfo": "Receta fácil y rápida para un bizcocho de plátano casero, con textura esponjosa y un sabor equilibrado a plátano y canela. Perfecto para desayunos o meriendas.",
  "ingredients": [
    { "name": "Plátanos maduros", "quantity": "3 unidades" },
    { "name": "Harina de trigo", "quantity": "150 g" },
    { "name": "Huevos", "quantity": "3 unidades" },
    { "name": "Aceite de oliva suave", "quantity": "150 ml" },
    { "name": "Azúcar", "quantity": "150 g" },
    { "name": "Levadura química (polvos de hornear)", "quantity": "10 g (2 1/2 cucharaditas)" },
    { "name": "Canela molida", "quantity": "1/2 cucharadita" },
    { "name": "Sal", "quantity": "una pizca" }
  ],
  "steps": [
    { "step": "Pelar y aplastar los 3 plátanos maduros hasta obtener un puré." },
    { "step": "En un bol aparte, mezclar los huevos, el azúcar y el aceite hasta integrar." },
    { "step": "Agregar el puré de plátano a la mezcla de huevos y aceite, mezclando bien." },
    { "step": "Tamizar la harina, la levadura, la canela y la sal, y añadirlos a los húmedos. Mezclar hasta obtener una masa homogénea." },
    { "step": "Verter la masa en un molde tipo plum cake de 21 cm previamente engrasado." },
    { "step": "Hornear a 180 °C durante 40 minutos, calor arriba y abajo, colocando el molde en la parte inferior del horno." },
    { "step": "Opcional: a los 10 minutos de horneado, hacer un corte superficial en el centro para mejorar la estética del bizcocho." },
    { "step": "Sacar del horno, dejar templar unos minutos y desmoldar." },
    { "step": "Dejar enfriar completamente sobre una rejilla antes de cortar y servir." }
  ],
  "images": [
    "https://example.com/bizcocho-plátano-26-1.webp",
    "https://example.com/bizcocho-plátano-26-2.webp",
    "https://example.com/bizcocho-plátano-26-3.webp"
  ],
  "rating": null,
  "tips": [
    "Receta ideal para aprovechar plátanos maduros, aportando dulzor natural y humedad a la masa.",
    "El aceite de oliva suave contribuye a la textura húmeda y ligera del bizcocho.",
    "El toque de canela le da un sabor característico sin ser dominante.",
    "Hacer un corte superficial a los 10 minutos de horneado mejora la estética del bizcocho."
  ]
},
{
  "id": 27,
  "uid": "P-STY_000027",
  "name": "Buñuelos",
  "description": "Buñuelos fritos de textura aireada y suave, con un delicado aroma a vainilla y cítricos. Fáciles de preparar y perfectos para acompañar el té o el café.",
  "imageUrl": "https://example.com/bunuelos-esponjosos-27.jpg",
  "detailedInfo": "Receta rápida y sencilla de buñuelos dulces, con una masa ligera y aireada gracias al polvo de hornear y una fritura en aceite caliente. Ideales para disfrutar recién hechos, espolvoreados con azúcar.",
  "ingredients": [
    { "name": "Harina común", "quantity": "250 g" },
    { "name": "Huevos", "quantity": "2 unidades" },
    { "name": "Azúcar", "quantity": "75 g (6 cucharadas)" },
    { "name": "Leche", "quantity": "120 ml (1/2 taza)" },
    { "name": "Ralladura de limón o naranja", "quantity": "ralladura de 1 fruta" },
    { "name": "Esencia de vainilla", "quantity": "5 ml (1 cucharadita)" },
    { "name": "Polvo de hornear", "quantity": "5 g (1 cucharadita)" },
    { "name": "Aceite para freír", "quantity": "c/n" },
    { "name": "Azúcar para rebozar", "quantity": "c/n" }
  ],
  "steps": [
    { "step": "En un bol, batir los huevos con el azúcar y la ralladura de limón o naranja hasta que el azúcar se disuelva completamente y la mezcla se vea espumosa." },
    { "step": "Agregar la leche y la esencia de vainilla, mezclando hasta integrar bien los líquidos." },
    { "step": "Añadir la harina común y el polvo de hornear, mezclando con movimientos envolventes hasta obtener una masa espesa y homogénea." },
    { "step": "Calentar abundante aceite en una sartén profunda hasta que esté bien caliente (unos 170-180 °C)." },
    { "step": "Con ayuda de una cuchara, dejar caer porciones pequeñas de masa en el aceite caliente. Freír por ambos lados hasta que estén inflados y dorados." },
    { "step": "Retirar los buñuelos y escurrir sobre papel absorbente. Aún calientes, pasarlos por azúcar para rebozarlos." }
  ],
  "images": [
    "https://example.com/bunuelos-esponjosos-27-1.webp",
    "https://example.com/bunuelos-esponjosos-27-2.webp",
    "https://example.com/bunuelos-esponjosos-27-3.webp"
  ],
  "rating": null,
  "tips": [
    "Batir bien los huevos con el azúcar hasta que se disuelva completamente mejora la textura final de los buñuelos.",
    "Usar ralladura de limón o de naranja aporta un aroma fresco y resalta el sabor dulce.",
    "El polvo de hornear es clave para lograr una masa ligera y esponjosa.",
    "El aceite debe estar bien caliente, entre 170 y 180 °C, para que los buñuelos crezcan y no absorban grasa.",
    "Freír pocas unidades por tanda para mantener la temperatura del aceite estable."
  ]
},
{
  "id": 28,
  "uid": "P-STY_000028",
  "name": "Buñuelos V2",
  "description": "Versión simple y rápida de buñuelos caseros, suaves, dorados y con un toque final de azúcar y canela. Ideales para preparar en menos de 10 minutos.",
  "imageUrl": "https://example.com/bunuelos-suaves-esponjosos-v2.jpg",
  "detailedInfo": "Receta práctica de buñuelos dulces, hechos con harina, huevos, leche y polvo de hornear. Su textura es aireada y esponjosa, y se finalizan con una cobertura aromática de azúcar y canela.",
  "ingredients": [
    { "name": "Harina de trigo", "quantity": "310 g (2 1/2 tazas)" },
    { "name": "Huevos", "quantity": "2 unidades" },
    { "name": "Azúcar blanca", "quantity": "100 g (1/2 taza)" },
    { "name": "Leche", "quantity": "240 ml (1 taza, tibia o a temperatura ambiente)" },
    { "name": "Polvo de hornear", "quantity": "10 g (1 cucharada)" },
    { "name": "Aceite para freír", "quantity": "c/n" },
    { "name": "Azúcar para rebozar", "quantity": "200 g (1 taza)" },
    { "name": "Canela en polvo", "quantity": "8 g (1 cucharada)" }
  ],
  "steps": [
    { "step": "En un bol, agregar los huevos, el azúcar y la leche tibia o a temperatura ambiente. Mezclar bien hasta integrar." },
    { "step": "Añadir la harina de trigo poco a poco mientras se bate con un batidor de globo hasta obtener una mezcla homogénea sin grumos." },
    { "step": "Incorporar el polvo de hornear y mezclar nuevamente hasta que la masa tenga una textura uniforme y ligeramente espesa." },
    { "step": "Calentar suficiente aceite en una sartén profunda a unos 170–180 °C." },
    { "step": "Con ayuda de dos cucharas, tomar porciones de masa y soltarlas suavemente en el aceite caliente." },
    { "step": "Freír los buñuelos hasta que estén inflados y dorados por ambos lados, girándolos con cuidado." },
    { "step": "Mezclar el azúcar con la canela en un recipiente aparte. Pasar los buñuelos recién fritos y aún calientes por la mezcla para rebozarlos." }
  ],
  "images": [
    "https://example.com/bunuelos-suaves-esponjosos-v2-1.webp",
    "https://example.com/bunuelos-suaves-esponjosos-v2-2.webp",
    "https://example.com/bunuelos-suaves-esponjosos-v2-3.webp"
  ],
  "rating": null,
  "tips": [
    "La receta completa puede prepararse en menos de 10 minutos.",
    "Usar leche tibia o a temperatura ambiente mejora la integración de los ingredientes y la textura final.",
    "El polvo de hornear es esencial para obtener buñuelos suaves y esponjosos.",
    "Formar los buñuelos con dos cucharas permite porciones uniformes y una fritura pareja.",
    "Mantener el aceite a una temperatura constante entre 170 y 180 °C evita que absorban grasa en exceso."
  ]
},
{
  "id": 29,
  "uid": "P-STY_000029",
  "name": "Buñuelos V3",
  "description": "Versión clásica y tradicional de buñuelos fritos hechos con masa choux. Crujientes por fuera, tiernos y aireados por dentro, perfectos para rellenar o disfrutar recién hechos con azúcar y canela.",
  "imageUrl": "https://example.com/bunuelos-de-viento-faciles.jpg",
  "detailedInfo": "Receta inspirada en la masa choux, en la que se cuecen los líquidos con mantequilla y se incorporan los huevos poco a poco para lograr una textura aireada. Los buñuelos se fríen hasta dorar y se rebozan en azúcar y canela.",
  "ingredients": [
    { "name": "Agua o leche", "quantity": "250 ml" },
    { "name": "Mantequilla sin sal", "quantity": "100 g" },
    { "name": "Azúcar", "quantity": "12 g (1 cucharada)" },
    { "name": "Esencia de vainilla o azúcar vainillado", "quantity": "5 ml (1 cucharadita)" },
    { "name": "Sal", "quantity": "5 g (1 cucharadita)" },
    { "name": "Harina de trigo", "quantity": "125 g" },
    { "name": "Huevos medianos", "quantity": "5 unidades" },
    { "name": "Aceite vegetal (para freír)", "quantity": "500 ml (aprox.)" },
    { "name": "Azúcar para rebozar", "quantity": "150 g" },
    { "name": "Canela molida", "quantity": "3 g (1 cucharadita)" }
  ],
  "steps": [
    { "step": "En una cacerola a fuego medio, calentar el agua o leche junto con la mantequilla hasta que se derrita por completo." },
    { "step": "Agregar el azúcar, la vainilla y la sal. Mezclar para integrar los sabores." },
    { "step": "Añadir de golpe la harina y remover rápidamente con una cuchara de madera hasta obtener una masa homogénea sin grumos." },
    { "step": "Cocinar la masa durante 3 minutos a fuego medio, removiendo constantemente para secarla y evitar que se pegue." },
    { "step": "Retirar del fuego y dejar templar unos 5 minutos antes de incorporar los huevos." },
    { "step": "Añadir los primeros 4 huevos uno a uno, mezclando bien después de cada adición." },
    { "step": "Batir el quinto huevo aparte e incorporarlo poco a poco hasta lograr la textura ideal: una masa lisa, brillante y que forme un 'pico de pato' al levantar la pala." },
    { "step": "Preparar la mezcla para rebozar combinando el azúcar con la canela en un recipiente." },
    { "step": "Calentar abundante aceite en un cazo a unos 175 °C." },
    { "step": "Con dos cucharitas pasadas por aceite, tomar porciones de masa y soltarlas suavemente en el aceite caliente." },
    { "step": "Freír los buñuelos hasta que estén dorados por ambos lados; suelen girarse solos durante la cocción." },
    { "step": "Retirar los buñuelos y colocarlos sobre papel absorbente. Pasarlos aún calientes por la mezcla de azúcar y canela." },
    { "step": "Servir de inmediato o rellenar con crema o nata antes de servir." }
  ],
  "images": [
    "https://example.com/bunuelos-de-viento-faciles-1.webp",
    "https://example.com/bunuelos-de-viento-faciles-2.webp",
    "https://example.com/bunuelos-de-viento-faciles-3.webp"
  ],
  "rating": null,
  "tips": [
    "Secar la masa durante 3 minutos después de añadir la harina mejora la textura y evita que absorba aceite al freír.",
    "Dejar templar la masa antes de añadir los huevos para que no se cuajen.",
    "Agregar el quinto huevo gradualmente hasta obtener la textura de pico de pato: debe caer lentamente y brillar.",
    "Usar dos cucharitas mojadas en aceite facilita el formado y evita que la masa se pegue.",
    "Freír a temperatura constante (170–180 °C) para lograr buñuelos dorados y livianos.",
    "Los buñuelos se pueden rellenar con crema pastelera, nata o dulce de leche."
  ]
},
{
  "id": 30,
  "uid": "P-STY_000030",
  "name": "Quesillo Venezolano",
  "description": "Postre cremoso y denso, similar al flan, con un delicado sabor a vainilla y toque opcional de ron. Ideal para servir frío.",
  "imageUrl": "https://example.com/quesillo-venezolano-30.jpg",
  "detailedInfo": "Receta tradicional de quesillo venezolano, con caramelo dorado y una mezcla cremosa de huevos, leche y leche condensada. Se cocina a baño de María para obtener la textura perfecta y se refrigera antes de desmoldar.",
  "ingredients": [
    { "name": "Azúcar (para caramelo)", "quantity": "1/2 taza (100 g)" },
    { "name": "Agua (para caramelo)", "quantity": "1/4 taza (60 ml)" },
    { "name": "Huevos", "quantity": "5 unidades" },
    { "name": "Leche condensada", "quantity": "1 lata (396 g)" },
    { "name": "Leche líquida", "quantity": "1 1/4 taza (275 ml)" },
    { "name": "Esencia de vainilla", "quantity": "2 cucharadas" },
    { "name": "Ron o brandy (opcional)", "quantity": "2 cucharadas" }
  ],
  "steps": [
    { "step": "En una olla, combinar el azúcar y el agua para el caramelo." },
    { "step": "Cocinar a fuego medio sin mover hasta obtener un color dorado." },
    { "step": "Verter el caramelo en la base de la quesillera, cubriendo toda la superficie." },
    { "step": "En una licuadora, agregar los huevos y la leche líquida. Licuar." },
    { "step": "Añadir la leche condensada, la esencia de vainilla y el ron o brandy opcional." },
    { "step": "Mezclar hasta obtener una preparación homogénea." },
    { "step": "Verter la mezcla en la quesillera con caramelo." },
    { "step": "Tapar con papel aluminio y colocar la quesillera dentro de una bandeja con agua caliente (baño de María)." },
    { "step": "Hornear a 350°F (175°C) por 1 hora." },
    { "step": "Verificar la cocción con un palillo; debe salir seco." },
    { "step": "Dejar enfriar a temperatura ambiente y luego refrigerar por mínimo 4 horas." },
    { "step": "Pasar un cuchillo por los bordes y desmoldar cuidadosamente." }
  ],
  "images": [
    "https://example.com/quesillo-venezolano-30-1.webp",
    "https://example.com/quesillo-venezolano-30-2.webp",
    "https://example.com/quesillo-venezolano-30-3.webp"
  ],
  "rating": null,
  "tips": [
    "No mover el caramelo mientras se cocina para obtener un color uniforme.",
    "El ron o brandy es opcional pero aporta un sabor característico.",
    "Refrigerar el quesillo por varias horas garantiza la textura ideal antes de desmoldar.",
    "Usar una bandeja profunda con agua caliente asegura un baño de María uniforme.",
    "Pasar un cuchillo por los bordes antes de desmoldar evita que se rompa."
  ]
},
{
    "id": 31,
    "uid": "P-STY_000031",
    "name": "Quesillo Venezolano V2",
    "description": "Versión simplificada del quesillo, con solo tres ingredientes principales y horneado directo sin baño de María. Cremoso, con huecos característicos y toque de ron opcional.",
    "imageUrl": "https://example.com/quesillo-venezolano-v2-31.jpg",
    "detailedInfo": "Quesillo tradicional venezolano, preparado con leche líquida, leche condensada y huevos. La mezcla se hornea directamente, caramelizando el molde previamente y obteniendo una textura cremosa con pequeños huecos internos, típicos del quesillo.",
    "ingredients": [
      { "name": "Leche condensada", "quantity": "240 g" },
      { "name": "Leche líquida", "quantity": "240 ml" },
      { "name": "Huevos enteros", "quantity": "5 unidades" },
      { "name": "Vainilla", "quantity": "5 ml" },
      { "name": "Ron", "quantity": "5 ml (opcional)" },
      { "name": "Azúcar granulada (para caramelo)", "quantity": "65 g" }
    ],
    "steps": [
      { "step": "Derretir el azúcar en el molde hasta obtener un caramelo dorado intenso." },
      { "step": "Cubrir cuidadosamente las paredes del molde con el caramelo y dejar reposar." },
      { "step": "En un bol, combinar la leche condensada, la leche líquida y los huevos. Batir durante 2-3 minutos." },
      { "step": "Añadir la vainilla y el chorrito de ron; mezclar nuevamente." },
      { "step": "Colar la mezcla y verterla sobre el molde caramelizado." },
      { "step": "Tapar el molde y hornear directamente a 190°C (375°F) durante 45 minutos." },
      { "step": "Comprobar la cocción con un palito; debe salir seco." },
      { "step": "Dejar reposar en el refrigerador varias horas antes de desmoldar." },
      { "step": "Despegar los bordes del quesillo con cuidado y voltear sobre un plato de presentación." }
    ],
    "images": [
      "https://example.com/quesillo-venezolano-v2-31-1.webp",
      "https://example.com/quesillo-venezolano-v2-31-2.webp",
      "https://example.com/quesillo-venezolano-v2-31-3.webp"
    ],
    "rating": null,
    "tips": [
      "El nombre 'quesillo' proviene de los huecos internos que se forman durante la cocción, similares al queso suizo.",
      "No exceder la temperatura del caramelo para evitar que se amargue.",
      "Colar la mezcla antes de verterla garantiza una textura más fina y homogénea.",
      "Hornear directamente a 190°C simplifica el proceso y requiere menos utensilios.",
      "Dejar reposar en la nevera antes de desmoldar asegura la consistencia ideal."
    ]
  },
  {
    "id": 32,
    "uid": "P-STY_000032",
    "name": "Quesillo Perfecto V3",
    "description": "Quesillo cremoso y delicado, sin los huecos típicos, logrando una textura similar a un flan. Toque opcional de cacao y ron para intensificar sabor.",
    "imageUrl": "https://example.com/quesillo-perfecto-v3-32.jpg",
    "detailedInfo": "Quesillo venezolano suave y cremoso, preparado con leche condensada, leche líquida, huevos, cacao, vainilla y un chorrito de ron. La mezcla se licúa para eliminar burbujas y se hornea a baño de María o en horno directo, obteniendo una textura fina y homogénea.",
    "ingredients": [
      { "name": "Azúcar granulada (para caramelo)", "quantity": "150 g" },
      { "name": "Agua (para caramelo)", "quantity": "60 ml" },
      { "name": "Huevos enteros", "quantity": "5 unidades" },
      { "name": "Leche condensada", "quantity": "395 g (1 lata pequeña)" },
      { "name": "Leche líquida", "quantity": "395 ml" },
      { "name": "Ron añejo", "quantity": "5 ml (opcional)" },
      { "name": "Vainilla", "quantity": "5 ml" },
      { "name": "Cacao en polvo", "quantity": "2 g (1/2 cucharadita)" }
    ],
    "steps": [
      { "step": "Colocar el azúcar y el agua directamente en el molde. Cocinar a fuego medio-alto sin remover hasta que el caramelo tome color ámbar." },
      { "step": "Mover suavemente el molde para distribuir el calor y cubrir las paredes con el caramelo. Dejar enfriar." },
      { "step": "En un bol, unir los huevos, la leche condensada, la leche líquida, el cacao, la vainilla y el ron." },
      { "step": "Licuar la mezcla hasta obtener una textura completamente homogénea y sin burbujas." },
      { "step": "Verter la mezcla en el molde caramelizado y tapar el molde con su tapa." },
      { "step": "Colocar el molde dentro de una bandeja con agua caliente hasta cubrir la mitad del molde (baño de María)."} ,
      { "step": "Hornear a 180 °C (350 °F) durante 70-90 minutos según la firmeza deseada." },
      { "step": "Comprobar cocción con un palito; debe salir limpio sin mezcla líquida." },
      { "step": "Dejar enfriar a temperatura ambiente y luego refrigerar 4-5 horas o toda la noche." },
      { "step": "Pasar un cuchillo por los bordes y voltear sobre un plato de presentación." }
    ],
    "images": [
      "https://example.com/quesillo-perfecto-v3-32-1.webp",
      "https://example.com/quesillo-perfecto-v3-32-2.webp",
      "https://example.com/quesillo-perfecto-v3-32-3.webp"
    ],
    "rating": null,
    "tips": [
      "Licuar muy bien la mezcla asegura un quesillo cremoso y sin huecos.",
      "El cacao intensifica el sabor del caramelo sin que sepa a chocolate.",
      "Usar la lata de leche condensada como medida para la leche líquida mantiene proporciones perfectas.",
      "No remover el caramelo con cuchara; mover solo el molde para distribuir el calor.",
      "Refrigerar toda la noche garantiza la textura perfecta antes de desmoldar."
    ]
  },
  {
    "id": 33,
    "uid": "P-STY_000033",
    "name": "Arroz con Leche",
    "description": "Postre cremoso tradicional venezolano, preparado con arroz, leche, cáscaras cítricas y canela. La remoción constante del arroz asegura una textura suave y homogénea.",
    "imageUrl": "https://example.com/arroz-con-leche-cremoso-tradicional-33.jpg",
    "detailedInfo": "Receta de arroz con leche que se cocina lentamente, removiendo constantemente para liberar el almidón del arroz y lograr una textura extremadamente cremosa sin ingredientes especiales. Finalizado con mantequilla y canela molida para un toque tradicional.",
    "ingredients": [
      { "name": "Arroz redondo", "quantity": "100 g" },
      { "name": "Leche entera", "quantity": "1000 ml" },
      { "name": "Cáscara de limón", "quantity": "1 trozo" },
      { "name": "Cáscara de naranja", "quantity": "1 trozo" },
      { "name": "Rama de canela", "quantity": "1 unidad" },
      { "name": "Azúcar", "quantity": "70 g" },
      { "name": "Mantequilla", "quantity": "10 g" },
      { "name": "Canela molida", "quantity": "c/n" }
    ],
    "steps": [
      { "step": "En una olla amplia, colocar la leche, el arroz, la cáscara de limón, la cáscara de naranja y la rama de canela." },
      { "step": "Calentar a fuego lento mientras se remueve constantemente para que la leche no hierva a borbotones." },
      { "step": "Pasados los primeros 5 minutos y luego cada 5 minutos, remover toda la mezcla para liberar almidón y generar cremosidad." },
      { "step": "Después de 40 minutos de cocción y remoción constante, añadir el azúcar y mezclar bien." },
      { "step": "Cocinar por 10 minutos adicionales para integrar el azúcar." },
      { "step": "Retirar las cáscaras de limón, naranja y la rama de canela." },
      { "step": "Añadir la mantequilla y mezclar hasta que se integre." },
      { "step": "Dejar reposar la mezcla durante 10 minutos a temperatura ambiente." },
      { "step": "Servir en cuencos individuales y espolvorear canela molida al gusto." },
      { "step": "Refrigerar durante toda la noche para obtener la textura final más cremosa." }
    ],
    "images": [
      "https://example.com/arroz-con-leche-cremoso-tradicional-33-1.webp",
      "https://example.com/arroz-con-leche-cremoso-tradicional-33-2.webp",
      "https://example.com/arroz-con-leche-cremoso-tradicional-33-3.webp"
    ],
    "rating": null,
    "tips": [
      "Remover cada cinco minutos durante la cocción asegura que el arroz libere su almidón y obtenga cremosidad natural.",
      "Retirar la parte blanca de las cáscaras de limón y naranja evita sabores amargos.",
      "Cocinar a fuego suave; hervir a borbotones arruina la textura del postre.",
      "Añadir el azúcar cerca del final de la cocción evita que se queme.",
      "Dejar enfriar toda la noche en la nevera garantiza la textura perfecta."
    ]
  },
  {
    "id": 34,
    "uid": "P-STY_000034",
    "name": "Arroz con Leche V2",
    "description": "Postre cremoso colombiano que combina arroz, leche, leche condensada, crema de leche y un toque secreto de leche en polvo. Opcionalmente se agregan pasas al final para un extra de sabor.",
    "imageUrl": "https://example.com/arroz-con-leche-tradicional-v2-34.jpg",
    "detailedInfo": "Receta tradicional colombiana enfocada en la cremosidad intensa. La adición de leche condensada, crema de leche y leche en polvo asegura un arroz con leche suave y muy cremoso. Pasas opcionales al final para un toque especial.",
    "ingredients": [
      { "name": "Arroz", "quantity": "200 g (1 taza)" },
      { "name": "Agua tibia", "quantity": "625 ml (2 1/2 tazas)" },
      { "name": "Sal", "quantity": "1 pizca" },
      { "name": "Astilla de canela", "quantity": "1 unidad" },
      { "name": "Leche líquida", "quantity": "625 ml (2 1/2 tazas)" },
      { "name": "Azúcar", "quantity": "25 g (2 cucharadas)" },
      { "name": "Canela en polvo", "quantity": "1/2 cucharadita" },
      { "name": "Leche condensada", "quantity": "200 g" },
      { "name": "Crema de leche", "quantity": "200 g" },
      { "name": "Esencia de vainilla", "quantity": "c/n" },
      { "name": "Leche en polvo", "quantity": "15 g (1 1/2 cucharadas)" },
      { "name": "Pasas (opcional)", "quantity": "c/n" }
    ],
    "steps": [
      { "step": "Hidratar el arroz en el agua tibia junto con la pizca de sal y la astilla de canela." },
      { "step": "Cocinar removiendo constantemente hasta que los granos comiencen a abrirse." },
      { "step": "Añadir las 2 cucharadas de azúcar tibia, la leche líquida y la canela en polvo." },
      { "step": "Cocinar a fuego medio, removiendo constantemente para que el arroz absorba la leche y no se pegue." },
      { "step": "Cuando el arroz haya absorbido casi toda la leche, añadir la leche condensada y la crema de leche." },
      { "step": "Agregar la esencia de vainilla y mezclar bien." },
      { "step": "Añadir la leche en polvo y mezclar hasta que se integre completamente para una cremosidad especial." },
      { "step": "Incorporar las pasas si se desea." },
      { "step": "Retirar del fuego cuando el arroz comience a espesar; seguirá espesando al enfriarse." },
      { "step": "Servir caliente, a temperatura ambiente o frío. Espolvorear canela y decorar con pasas." }
    ],
    "images": [
      "https://example.com/arroz-con-leche-tradicional-v2-34-1.webp",
      "https://example.com/arroz-con-leche-tradicional-v2-34-2.webp",
      "https://example.com/arroz-con-leche-tradicional-v2-34-3.webp"
    ],
    "rating": null,
    "tips": [
      "Remover constantemente para evitar que el arroz se pegue y asegurar la cremosidad.",
      "La leche en polvo es el secreto para lograr una textura especialmente cremosa.",
      "Retirar del fuego justo cuando comienza a espesar, ya que seguirá espesando mientras se enfría.",
      "Se puede sustituir azúcar por panela o ajustar la cantidad de leche condensada para variar el dulzor.",
      "La forma de consumo varía por región: fría en la costa, caliente en Antioquia, a veces con queso rallado."
    ]
  },
  {
    "id": 35,
    "uid": "P-STY_000035",
    "name": "Arroz con Leche Cremoso V3",
    "description": "Arroz con leche cremoso, aromatizado con cítricos y clavo de olor. Su textura se logra con remoción constante y leche entera, ideal para servir tibio o frío.",
    "imageUrl": "https://example.com/arroz-con-leche-cremoso-35.jpg",
    "detailedInfo": "Receta que enfatiza la cremosidad mediante el uso de leche entera y técnica de remoción constante. Aromatizada con cáscara de naranja, limón, canela y clavos de olor.",
    "ingredients": [
      { "name": "Leche entera", "quantity": "1000 ml" },
      { "name": "Arroz redondo", "quantity": "100 g" },
      { "name": "Piel de naranja", "quantity": "1 unidad" },
      { "name": "Piel de limón", "quantity": "1 unidad" },
      { "name": "Clavos de olor", "quantity": "4 unidades" },
      { "name": "Rama de canela", "quantity": "1 unidad" },
      { "name": "Azúcar", "quantity": "80 g" },
      { "name": "Mantequilla", "quantity": "10 g" },
      { "name": "Canela molida", "quantity": "c/n" }
    ],
    "steps": [
      { "step": "Preparar los saborizantes: pelar la naranja y el limón evitando la parte blanca. Pinchar los clavos de olor en una de las pieles." },
      { "step": "Infusión de leche: en una cacerola, poner la leche entera, la rama de canela y las pieles de cítricos con los clavos a fuego medio." },
      { "step": "Añadir el arroz: cuando la leche esté caliente, incorporar los 100 g de arroz redondo." },
      { "step": "Cocción lenta: cocinar a fuego medio durante 40 minutos, removiendo cada 3-4 minutos para que el arroz libere su almidón." },
      { "step": "Adición final: tras 40 minutos, añadir el azúcar y la mantequilla. Mezclar bien hasta que se integren completamente." },
      { "step": "Retirar saborizantes: sacar la rama de canela y las pieles con clavos." },
      { "step": "Servir: repartir en recipientes individuales, espolvorear canela molida al gusto." },
      { "step": "Consumo: se puede disfrutar tibio o refrigerado para obtener mayor cremosidad." }
    ],
    "images": [
      "https://example.com/arroz-con-leche-cremoso-35-1.webp",
      "https://example.com/arroz-con-leche-cremoso-35-2.webp",
      "https://example.com/arroz-con-leche-cremoso-35-3.webp"
    ],
    "rating": null,
    "tips": [
      "Usar piel de naranja y limón con clavos de olor para una infusión aromática intensa.",
      "Evitar la parte blanca (albedo) de los cítricos para que no amargue.",
      "Remover cada 3-4 minutos durante la cocción para que el arroz libere almidón y logre cremosidad.",
      "Añadir mantequilla al final ayuda a conseguir textura sedosa y cremosa."
    ]
  },
{
  "id": 36,
  "uid": "P-STY_000036",
  "name": "Picarones",
  "description": "Picarones tradicionales peruanos elaborados con camote y zapallo macre, fritos hasta dorarse y servidos con miel de chancaca aromática.",
  "imageUrl": "https://example.com/picarones-caseros-36.jpg",
  "detailedInfo": "Receta detallada de picarones, incluyendo preparación de la masa, fermentación, fritura y preparación de la miel con especias y hojas de higo.",
  "ingredients": [
    { "name": "Camote amarillo", "quantity": "700 g" },
    { "name": "Zapallo macre", "quantity": "150 g" },
    { "name": "Agua de cocción (camote/zapallo)", "quantity": "240 ml" },
    { "name": "Harina de trigo sin preparar", "quantity": "600 g" },
    { "name": "Levadura seca", "quantity": "15 g" },
    { "name": "Agua tibia para levadura", "quantity": "60 ml" },
    { "name": "Semillas de anís", "quantity": "1.5 cda" },
    { "name": "Azúcar", "quantity": "2 cda para la masa, 10-12 cda para la miel" },
    { "name": "Sal", "quantity": "1 pizca para la masa, 1/2 cdita en agua para manos" },
    { "name": "Chancaca o panela", "quantity": "2 trozos grandes" },
    { "name": "Agua para miel", "quantity": "240 ml" },
    { "name": "Zumo de naranja", "quantity": "120 ml" },
    { "name": "Especias para miel", "quantity": "2 astillas canela, anís estrella, clavo, 4-5 hojas de higo" },
    { "name": "Aceite para fritura", "quantity": "c/n" }
  ],
  "steps": [
    { "step": "Cocer camote y zapallo: pelar, cortar en trozos y cocinar en agua con especias hasta que estén blandos. Reservar 240 ml del agua de cocción. Aplastar hasta puré." },
    { "step": "Activar levadura: disolver 15 g de levadura seca en 60 ml de agua tibia y dejar formar espuma." },
    { "step": "Mezclar puré con anís, azúcar y sal. Incorporar la levadura activada y 600 g de harina, añadir agua de cocción poco a poco. Amasar 3-4 minutos hasta que la masa quede pegajosa." },
    { "step": "Primer reposo: cubrir la masa y dejar reposar hasta que duplique su tamaño." },
    { "step": "Preparar miel: poner chancaca, agua, zumo de naranja, canela, anís, clavo y hojas de higo a hervir hasta reducir a jarabe. Colar y reservar." },
    { "step": "Desgasificar masa: amasar 1-1.5 minutos para sacar aire. Mojar manos con agua salada para manejar la masa." },
    { "step": "Formar picarones: tomar porciones de masa, formar anillos y freír en aceite caliente pero no excesivamente. Usar un palito para abrir el centro. Freír hasta dorado." },
    { "step": "Servir: colocar los picarones en plato y napar con miel." }
  ],
  "images": [
    "https://example.com/picarones-36-1.webp",
    "https://example.com/picarones-36-2.webp",
    "https://example.com/picarones-36-3.webp"
  ],
  "rating": null,
  "tips": [
    "Usar camote amarillo y zapallo macre para mantener la autenticidad.",
    "La masa debe ser pegajosa; ajustar con agua de cocción si queda seca.",
    "Mojar las manos con agua salada para manejar la masa pegajosa.",
    "El sabor de la miel se obtiene gracias a la infusión con chancaca y hojas de higo.",
    "Al freír, abrir el centro con un palito para asegurar la forma y la cocción uniforme."
  ]
},
{
  "id": 37,
  "uid": "P-STY_000037",
  "name": "Picarones V2",
  "description": "Picarones peruanos con masa húmeda y pegajosa, fritos hasta dorarse y servidos con miel de chancaca aromática.",
  "imageUrl": "https://example.com/picarones-inf-37.jpg",
  "detailedInfo": "Receta detallada de picarones, desde la preparación de la masa con puré de zapallo camote, fermentación, fritura, hasta la miel de chancaca aromática con especias y cáscara de naranja.",
  "ingredients": [
    { "name": "Harina de trigo", "quantity": "300 g" },
    { "name": "Puré de zapallo camote", "quantity": "200 g" },
    { "name": "Polvo de horneo (leudante)", "quantity": "10 g" },
    { "name": "Azúcar", "quantity": "25 g" },
    { "name": "Sal", "quantity": "2 g" },
    { "name": "Levadura seca", "quantity": "6 g (o 15 g levadura fresca)" },
    { "name": "Leche", "quantity": "30 ml" },
    { "name": "Vainilla líquida", "quantity": "10 g" },
    { "name": "Chancaca (panela)", "quantity": "1 pieza" },
    { "name": "Agua fría para miel", "quantity": "el doble que la chancaca" },
    { "name": "Saborizantes para miel", "quantity": "canela en rama, cáscara de naranja, clavo de olor, anís al gusto" },
    { "name": "Aceite para fritura", "quantity": "c/n" },
    { "name": "Canela en polvo", "quantity": "c/n para espolvorear" },
    { "name": "Azúcar flor (impalpable)", "quantity": "opcional, c/n" }
  ],
  "steps": [
    { "step": "Cocinar el zapallo camote hasta que esté blando y triturarlo hasta obtener un puré liso." },
    { "step": "En un bol, mezclar harina, puré de zapallo, vainilla, polvo de horneo, sal, azúcar y levadura. Disolver la levadura en la leche y añadir. Incorporar todos los ingredientes sin amasar hasta que la masa sea homogénea y pegajosa." },
    { "step": "Cubrir la masa y dejar reposar en un lugar tibio hasta que crezca un poco (30-60 minutos)." },
    { "step": "Preparar la miel: colocar la chancaca y el doble de agua en una olla, agregar canela, cáscara de naranja, clavo y anís. Cocinar hasta que se disuelva y deje infusionar los sabores." },
    { "step": "Calentar aceite a 165-170 °C. Preparar agua con sal para humedecer los dedos." },
    { "step": "Formar los picarones con los dedos humedecidos, dándoles forma de anillo. Freír en aceite caliente, usando un palito para mantener el orificio abierto. Freír hasta dorados por ambos lados." },
    { "step": "Retirar los picarones y colocarlos sobre una rejilla para escurrir el aceite." },
    { "step": "Servir calientes bañados con la miel de chancaca. Espolvorear con canela en polvo y opcionalmente azúcar flor." }
  ],
  "images": [
    "https://example.com/picarones-37-1.webp",
    "https://example.com/picarones-37-2.webp",
    "https://example.com/picarones-37-3.webp"
  ],
  "rating": null,
  "tips": [
    "No amasar la masa; solo incorporar los ingredientes hasta que quede un todo homogéneo y pegajoso.",
    "Humedecer los dedos con agua y sal para formar los picarones sin que se adhieran a las manos.",
    "No usar papel absorbente para escurrir aceite; usar rejilla para evitar grasos.",
    "Mantener el aceite entre 165-170 °C para dorar y cocinar correctamente por dentro.",
    "Si la miel queda muy líquida, agregar un poco de maicena disuelta en agua para espesar ligeramente."
  ]
},
{
  "id": 38,
  "uid": "P-STY_000038",
  "name": "Picarones V3",
  "description": "Picarones peruanos tradicionales, con masa de zapallo y camote, fritos hasta dorarse y servidos con miel de chancaca aromática con frutas y especias.",
  "imageUrl": "https://example.com/picarones-38.jpg",
  "detailedInfo": "Receta completa de picarones tradicionales, desde la preparación del puré de zapallo y camote, activación de levadura fresca, amasado y batido a mano, fermentación, fritura y preparación de la miel de chancaca con hojas de higo, especias y frutas.",
  "ingredients": [
    { "name": "Zapallo (puré)", "quantity": "500 g" },
    { "name": "Camote (puré)", "quantity": "500 g" },
    { "name": "Harina de trigo", "quantity": "1000 g" },
    { "name": "Levadura fresca", "quantity": "50 g" },
    { "name": "Anís en grano", "quantity": "c/n" },
    { "name": "Azúcar", "quantity": "1 cucharada (aprox. 15 g)" },
    { "name": "Agua tibia para levadura", "quantity": "c/n" },
    { "name": "Agua de cocción (reservada)", "quantity": "c/n" },
    { "name": "Sal para manos", "quantity": "1 cucharadita (aprox. 5 g)" },
    { "name": "Chancaca (panela)", "quantity": "c/n" },
    { "name": "Saborizantes para miel", "quantity": "hojas de higo, canela, clavo, cáscara de naranja y limón, cáscara y rodajas de piña, membrillo" },
    { "name": "Aceite para fritura", "quantity": "1 litro" }
  ],
  "steps": [
    { "step": "Cortar y cocinar el zapallo y camote con anís hasta que estén blandos." },
    { "step": "Procesar o licuar para obtener un puré liso. Reservar el agua de cocción para ajustar la masa." },
    { "step": "Disolver la levadura fresca con azúcar y un poco de agua tibia. Dejar actuar hasta que levante y haga espuma." },
    { "step": "En un recipiente, mezclar el puré con los granos de anís y la levadura activada. Añadir la harina e incorporar amasando a mano. Ajustar con agua de cocción hasta lograr la consistencia deseada." },
    { "step": "Golpear la masa (ventilar) para que entre aire y levante mejor. Detener cuando aparezcan pequeños 'ojitos' en la masa." },
    { "step": "Cubrir la masa y dejar fermentar por aproximadamente 2 horas o hasta que crezca ligeramente." },
    { "step": "Preparar la miel: hervir la chancaca con hojas de higo, canela, clavo y frutas (naranja, limón, piña, membrillo) hasta infusionar los sabores." },
    { "step": "Disolver la sal en agua y mojar las manos para manipular la masa." },
    { "step": "Calentar aceite y formar los picarones con la masa, dándoles forma de anillo. Freír, volteando cuando el borde comience a dorar, hasta que estén cocidos y dorados." },
    { "step": "Servir los picarones calientes bañados con la miel aromática." }
  ],
  "images": [
    "https://example.com/picarones-38-1.webp",
    "https://example.com/picarones-38-2.webp",
    "https://example.com/picarones-38-3.webp"
  ],
  "rating": null,
  "tips": [
    "La experiencia es clave: ajustar la cantidad de líquido según la 'mano' y consistencia deseada.",
    "La masa debe quedar crocante por fuera y esponjosa por dentro.",
    "Golpear la masa ayuda a que le entre aire y se active mejor la levadura.",
    "Mojar las manos con agua y sal evita que la masa se pegue al formar los picarones.",
    "La miel aromatizada con hojas de higo y especias da el sabor tradicional característico."
  ]
},
{
  "id": 39,
  "uid": "P-STY_000039",
  "name": "Tembleque",
  "description": "Postre tradicional puertorriqueño a base de leche de coco y maicena, infusionado con especias y servido frío con canela.",
  "imageUrl": "https://example.com/tembleque-39.jpg",
  "detailedInfo": "Tembleque tradicional con leche de coco, maicena y azúcar, infusionado con un té de canela y clavo. Ideal para festividades, con textura que 'tiembla' al servirlo.",
  "ingredients": [
    { "name": "Leche de coco (lata)", "quantity": "800 ml (~2 latas)" },
    { "name": "Maicena (fécula de maíz)", "quantity": "96 g (~3/4 taza)" },
    { "name": "Azúcar granulada", "quantity": "200 g (~1 taza)" },
    { "name": "Extracto de vainilla", "quantity": "15 ml (1 cucharada)" },
    { "name": "Agua para infusión", "quantity": "240 ml (1 taza)" },
    { "name": "Canela en raja", "quantity": "c/n" },
    { "name": "Clavos de olor", "quantity": "5 unidades" },
    { "name": "Canela en polvo para decorar", "quantity": "c/n" }
  ],
  "steps": [
    { "step": "Hervir el agua con canela en raja y clavos de olor para hacer un té de especias y reservar." },
    { "step": "En una olla fuera del fuego, verter la leche de coco. Batir ligeramente si la leche está muy espesa." },
    { "step": "Agregar el extracto de vainilla y el azúcar. Mezclar hasta integrar." },
    { "step": "Añadir la maicena poco a poco, mezclando constantemente para evitar grumos." },
    { "step": "Colar la infusión de té y agregarla a la mezcla de coco." },
    { "step": "Cocinar a fuego medio-alto, meneando constantemente para espesar uniformemente." },
    { "step": "Cuando la mezcla comience a espesar, bajar el fuego a bajo y continuar cocinando hasta obtener la consistencia deseada." },
    { "step": "Verter el tembleque en un molde grande o en porciones individuales y dejar reposar sobre la encimera 20-30 minutos." },
    { "step": "Cubrir y refrigerar al menos 2 horas." },
    { "step": "Desmoldar cuidadosamente y espolvorear con canela en polvo antes de servir." }
  ],
  "images": [
    "https://example.com/tembleque-39-1.webp",
    "https://example.com/tembleque-39-2.webp",
    "https://example.com/tembleque-39-3.webp"
  ],
  "rating": null,
  "tips": [
    "Mover constantemente desde que se añade la maicena para evitar grumos.",
    "Elegir leche de coco de buena textura; muy espesa puede dificultar la mezcla.",
    "Dejar reposar a temperatura ambiente antes de refrigerar para lograr la textura correcta.",
    "El nombre 'tembleque' se debe a que el postre tiembla ligeramente al moverlo."
  ]
},
{
  "id": 40,
  "uid": "P-STY_000040",
  "name": "Tembleque V2",
  "description": "Versión simplificada del tembleque puertorriqueño, hecho únicamente con leche de coco, azúcar y maicena, con textura que 'tiembla' al servir.",
  "imageUrl": "https://example.com/tembleque-40.jpg",
  "detailedInfo": "Postre tradicional puertorriqueño muy fácil de preparar, usando solo leche de coco, azúcar y maicena. Se cocina hasta espesar y se refrigera para obtener la consistencia característica.",
  "ingredients": [
    { "name": "Leche de coco (lata)", "quantity": "960 ml (4 tazas / 2 latas)" },
    { "name": "Azúcar granulada", "quantity": "200 g (1 taza)" },
    { "name": "Maicena (fécula de maíz)", "quantity": "65 g (1/2 taza)" },
    { "name": "Aceite", "quantity": "c/n, para untar el molde" },
    { "name": "Canela en polvo", "quantity": "c/n, para decorar" },
    { "name": "Canela en rama", "quantity": "c/n, opcional para decorar" }
  ],
  "steps": [
    { "step": "Preparar el molde untando un poco de aceite para facilitar el desmolde." },
    { "step": "En una cazuela, combinar la leche de coco, el azúcar y la maicena aún en frío, mezclando ligeramente para disolver la maicena y evitar grumos." },
    { "step": "Llevar la mezcla a fuego medio, removiendo constantemente hasta que comience a espesar." },
    { "step": "Continuar removiendo hasta obtener una textura densa que cueste un poco caer de la cuchara." },
    { "step": "Verter la mezcla caliente en el molde previamente engrasado y alisar la superficie." },
    { "step": "Cubrir con papel film tocando toda la superficie para evitar costra y refrigerar al menos 4 horas." },
    { "step": "Desmoldar cuidadosamente golpeando suavemente los bordes para soltar el postre." },
    { "step": "Espolvorear canela en polvo y decorar con ramitas de canela si se desea." }
  ],
  "images": [
    "https://example.com/tembleque-40-1.webp",
    "https://example.com/tembleque-40-2.webp"
  ],
  "rating": null,
  "tips": [
    "Usar leche de coco cremosa para obtener mejor textura.",
    "Remover constantemente en el fuego para evitar grumos.",
    "El papel film debe tocar toda la superficie para evitar costra.",
    "El postre debe quedar firme pero con capacidad de 'temblar' al moverlo."
  ]
},
{
  "id": 41,
  "uid": "P-STY_000041",
  "name": "Tembleque de Chocolate Blanco",
  "description": "Tembleque puertorriqueño con la adición de chocolate blanco derretido en la base de leche de coco, logrando sabor y cremosidad mejorados.",
  "imageUrl": "https://example.com/tembleque-41.jpg",
  "detailedInfo": "Postre tradicional puertorriqueño, donde la leche de coco se aromatiza y se espesa con maicena. El chocolate blanco se incorpora para dar un sabor y textura más cremosa.",
  "ingredients": [
    { "name": "Leche de Coco (lata)", "quantity": "~800 ml (2 latas), reservar un poco para slurry" },
    { "name": "Azúcar (granulada o morena)", "quantity": "~150 g (3/4 taza)" },
    { "name": "Vainilla líquida", "quantity": "~15 ml (1 cucharada)" },
    { "name": "Nuez Moscada", "quantity": "c/n, al gusto" },
    { "name": "Canela molida", "quantity": "c/n, al gusto" },
    { "name": "Chips de Chocolate Blanco", "quantity": "~100 g" },
    { "name": "Fécula de Maíz (Maicena)", "quantity": "~32 g (1/4 taza), para slurry" },
    { "name": "Coco rallado tostado", "quantity": "c/n, para decorar" },
    { "name": "Canela molida", "quantity": "c/n, para espolvorear" }
  ],
  "steps": [
    { "step": "Calentar la mayor parte de la leche de coco en una olla y reservar una porción para el slurry de maicena." },
    { "step": "Agregar el azúcar, la vainilla, nuez moscada y canela a la leche caliente, mezclando hasta disolver el azúcar." },
    { "step": "Incorporar los chips de chocolate blanco y mezclar hasta que se disuelvan por completo." },
    { "step": "Preparar el slurry mezclando la maicena con la porción de leche reservada hasta que no queden grumos." },
    { "step": "Verter el slurry en el centro de la leche caliente y remover rápidamente hasta espesar al gusto." },
    { "step": "Mientras se espesa, tostar el coco rallado en una sartén a fuego medio-bajo, moviendo constantemente hasta dorar." },
    { "step": "Verter la mezcla espesa en moldes o envases individuales." },
    { "step": "Dejar enfriar y luego refrigerar hasta que esté firme." },
    { "step": "Decorar con coco rallado tostado y espolvorear canela en polvo antes de servir." }
  ],
  "images": [
    "https://example.com/tembleque-41-1.webp",
    "https://example.com/tembleque-41-2.webp"
  ],
  "rating": null,
  "tips": [
    "El chocolate blanco derretido aporta aroma y cremosidad extra.",
    "Disolver la maicena en leche fría (slurry) permite controlar la consistencia sin grumos.",
    "Tostar el coco rallado mejora sabor y textura como topping.",
    "El tembleque debe quedar cremoso y ligeramente firme, nunca demasiado duro."
  ]
},
{
  "id": 42,
  "uid": "P-STY_000042",
  "name": "Pionono",
  "description": "Masa ligera y flexible, ideal para preparar piononos dulces o salados. Su textura esponjosa permite enrollarla sin que se quiebre.",
  "imageUrl": "https://example.com/pionono-casero.jpg",
  "detailedInfo": "El pionono es una base de bizcocho fino y elástico, típico de la repostería española y latinoamericana. Esta versión casera se prepara con huevos batidos al punto letra, azúcar, miel y harina, obteniendo una masa perfecta para enrollar.",
  "ingredients": [
    { "name": "Huevos (tamaño L)", "quantity": "4 unidades (~260 g sin cáscara)" },
    { "name": "Azúcar granulada", "quantity": "40 g (~3 cucharadas)" },
    { "name": "Harina de trigo común (10-11% proteína)", "quantity": "40 g (~4 cucharadas colmadas)" },
    { "name": "Miel", "quantity": "15 ml (1 cucharada)" },
    { "name": "Mantequilla o manteca (para engrasar)", "quantity": "c/n" },
    { "name": "Papel de horno (encerado)", "quantity": "1 hoja, bien engrasada y adherida" }
  ],
  "steps": [
    { "step": "Precalentar el horno a 190 °C." },
    { "step": "Engrasar la bandeja de horno (28 × 35 cm) con mantequilla o manteca." },
    { "step": "Pegar papel de horno sobre la base engrasada, eliminando burbujas, y volver a engrasar la superficie del papel." },
    { "step": "En un bol, batir los huevos con el azúcar y la miel a velocidad media-alta hasta que la mezcla duplique su volumen y alcance el punto letra." },
    { "step": "Tamizar la harina y añadirla poco a poco mientras se mezcla suavemente hasta integrar. No sobrebatir." },
    { "step": "Verter la mezcla sobre la bandeja, distribuyendo de forma pareja con una espátula sin perder aire." },
    { "step": "Hornear durante 10–11 minutos, hasta que esté ligeramente dorado y flexible." },
    { "step": "Apenas salga del horno, voltear sobre una hoja nueva de papel de horno y retirar el papel usado con cuidado." },
    { "step": "Dejar enfriar completamente antes de rellenar. Una vez frío, estará listo para enrollar con rellenos dulces o salados." }
  ],
  "images": [
    "https://example.com/pionono-casero-1.webp",
    "https://example.com/pionono-casero-2.webp"
  ],
  "rating": null,
  "tips": [
    "La miel es clave para lograr una masa flexible que no se rompa al enrollar.",
    "El aire incorporado al batir los huevos da volumen; evita sobrebatir tras agregar la harina.",
    "Engrasar correctamente la bandeja y el papel evita que el pionono se pegue.",
    "Retira el papel de horno cuando aún esté caliente para evitar que se adhiera.",
    "La receta se puede escalar fácilmente según el tamaño de la bandeja, manteniendo proporciones iguales."
  ]
},
{
  "id": 43,
  "uid": "P-STY_000043",
  "name": "Pionono V2",
  "description": "Clásico pionono relleno con dulce de leche casero. Una masa esponjosa, flexible y ligeramente dulce que se enrolla fácilmente sin romperse.",
  "imageUrl": "https://example.com/pionono-manjarblanco.jpg",
  "detailedInfo": "Este pionono combina una masa ligera y flexible con un relleno de manjar blanco preparado al estilo tradicional, hirviendo una lata de leche condensada para obtener un dulce cremoso y uniforme. Ideal para servir como postre o merienda.",
  "ingredients": [
    { "name": "Huevos (tamaño L)", "quantity": "4 unidades" },
    { "name": "Azúcar granulada", "quantity": "45 g (1/4 taza aprox.)" },
    { "name": "Harina pastelera (sin preparar, 4 ceros)", "quantity": "60 g (1/2 taza aprox.)" },
    { "name": "Miel", "quantity": "20 g (1 cucharada)" },
    { "name": "Esencia de vainilla", "quantity": "5 ml (1 cucharadita)" },
    { "name": "Leche condensada", "quantity": "1 lata (395 g)" },
    { "name": "Mantequilla o manteca (para engrasar)", "quantity": "c/n" },
    { "name": "Papel manteca o de horno", "quantity": "1 hoja (para forrar la bandeja)" },
    { "name": "Azúcar impalpable (glas)", "quantity": "c/n (para decorar)" }
  ],
  "steps": [
    { "step": "Colocar una lata cerrada de leche condensada en una olla con agua y hervir durante 2 a 2.5 horas. Dejar enfriar completamente antes de abrir para obtener el manjar blanco." },
    { "step": "Engrasar una placa de 30 × 40 cm con mantequilla o manteca, adherir papel manteca y volver a engrasar la superficie." },
    { "step": "Batir los huevos con el azúcar, la miel y la esencia de vainilla durante 5–10 minutos, hasta alcanzar el punto cinta (la mezcla cae formando dibujos que se mantienen un momento)." },
    { "step": "Incorporar la harina poco a poco, mezclando suavemente o a velocidad mínima hasta integrar. No sobrebatir." },
    { "step": "Verter la mezcla sobre la bandeja, nivelar y hornear a 170–175 °C durante 10–12 minutos, hasta que esté apenas dorado." },
    { "step": "Voltear el pionono aún caliente sobre otro papel manteca y cubrirlo con la misma placa caliente. Dejar enfriar completamente para mantener la flexibilidad." },
    { "step": "Retirar el papel, recortar los bordes si es necesario y extender el manjar blanco sobre toda la superficie." },
    { "step": "Enrollar firmemente ayudándose con el papel. Para un acabado cilíndrico, empujar suavemente el rollo con una regla o rodillo." },
    { "step": "Espolvorear azúcar impalpable por encima y decorar con frutas frescas como fresas o arándanos." }
  ],
  "images": [
    "https://example.com/pionono-manjarblanco-1.webp",
    "https://example.com/pionono-manjarblanco-2.webp"
  ],
  "rating": null,
  "tips": [
    "Hervir la lata de leche condensada sellada durante 2 a 2.5 horas es un método casero clásico para obtener manjar blanco cremoso.",
    "Agregar miel a la masa mejora su flexibilidad sin aportar exceso de dulzor.",
    "Tapar el pionono caliente con la placa al enfriar mantiene la humedad y evita que se quiebre.",
    "Usar poca harina y azúcar en comparación con un bizcochuelo tradicional ayuda a conservar la elasticidad.",
    "Enrollar con ayuda de una regla o rodillo asegura un acabado prolijo y compacto."
  ]
},
{
  "id": 44,
  "uid": "P-STY_000044",
  "name": "Rollo Suizo",
  "description": "Bizcocho esponjoso y ligero, ideal para rellenar con mermelada o miel. Fácil de preparar y perfecto como postre o merienda.",
  "imageUrl": "",
  "detailedInfo": "Este pastel de rollo suizo se caracteriza por su masa suave y aireada, lograda mediante un batido cuidadoso de yemas y claras. La técnica de plegado y los cortes superficiales previenen grietas al enrollarlo, logrando un rollo compacto y uniforme.",
  "ingredients": [
    { "name": "Huevos (separados)", "quantity": "5 unidades" },
    { "name": "Azúcar (para yemas)", "quantity": "50 g" },
    { "name": "Sal", "quantity": "1 g" },
    { "name": "Claras de huevo", "quantity": "5 unidades" },
    { "name": "Azúcar (para claras)", "quantity": "70 g" },
    { "name": "Harina", "quantity": "90 g" },
    { "name": "Polvo de hornear", "quantity": "2 g" },
    { "name": "Leche", "quantity": "50 g" },
    { "name": "Aceite vegetal", "quantity": "50 g" },
    { "name": "Mermelada o miel", "quantity": "cantidad necesaria" }
  ],
  "steps": [
    { "step": "Precalentar el horno a 170 °C y preparar una bandeja con papel pergamino." },
    { "step": "Batir las yemas con el azúcar y la sal hasta que la mezcla esté espumosa y haya aumentado de volumen." },
    { "step": "Batir las claras con el azúcar en tres etapas hasta lograr un merengue de picos firmes." },
    { "step": "Incorporar un tercio del merengue a la mezcla de yemas y mezclar suavemente, luego añadir el resto con movimientos envolventes." },
    { "step": "Tamizar la harina con el polvo de hornear e incorporarlos a la masa suavemente." },
    { "step": "Mezclar la leche y el aceite, combinar con una porción de la masa y luego integrar al resto de la mezcla." },
    { "step": "Verter la masa en la bandeja y golpear suavemente para eliminar burbujas de aire." },
    { "step": "Hornear durante 30 minutos, retirar del horno y quitar el papel inmediatamente." },
    { "step": "Cortar uno de los bordes cortos en diagonal y realizar cortes superficiales en el borde opuesto." },
    { "step": "Extender mermelada o miel sobre el bizcocho, enrollar firmemente y refrigerar 1 hora antes de servir." }
  ],
  "images": [],
  "rating": null,
  "tips": [
    "Batir las yemas con azúcar hasta que la mezcla esté espumosa para una textura aireada.",
    "Añadir el merengue en movimientos envolventes para no perder aire en la masa.",
    "Golpear la bandeja suavemente antes de hornear elimina burbujas y asegura una miga uniforme.",
    "Retirar el papel de horno inmediatamente evita arrugas en la superficie.",
    "Realizar cortes superficiales en el borde permite enrollar sin romper la masa.",
    "Refrigerar el rollo envuelto ayuda a mantener la forma y firmeza al servir."
  ]
},
{
  "id": 45,
  "uid": "P-STY_000045",
  "name": "Rollo Suizo V2",
  "description": "Bizcocho de vainilla ultra suave y flexible con relleno cremoso de mascarpone y nata. Su textura se derrite en la boca y no se quiebra al enrollar.",
  "imageUrl": "https://example.com/rollo-vainilla.jpg",
  "detailedInfo": "Un pastel suizo de vainilla con una masa ligera y húmeda, lograda mediante un batido de claras en tres etapas y una cocción precisa. El relleno combina queso mascarpone y crema batida para una textura aterciopelada. Ideal para postres elegantes o té de la tarde.",
  "ingredients": [
    { "name": "Aceite de cocina", "quantity": "60 g (4.5 cucharadas)" },
    { "name": "Leche", "quantity": "80 g (1/3 taza)" },
    { "name": "Harina baja en gluten (cernida)", "quantity": "100 g (3/4 taza)" },
    { "name": "Huevos (separados)", "quantity": "6 unidades" },
    { "name": "Extracto de vainilla", "quantity": "1.25 ml (1/4 cucharadita)" },
    { "name": "Jugo de limón", "quantity": "2 g (unas gotas)" },
    { "name": "Azúcar granulada (para merengue)", "quantity": "65 g (5 cucharadas)" },
    { "name": "Queso mascarpone", "quantity": "100 g" },
    { "name": "Crema de leche (nata para batir)", "quantity": "120 g (1/2 taza)" },
    { "name": "Azúcar granulada (para crema)", "quantity": "18 g (1.5 cucharadas)" }
  ],
  "steps": [
    { "step": "Precalentar el horno a 170 °C (340 °F). Forrar una bandeja de 25 × 40 cm con papel pergamino." },
    { "step": "Mezclar el aceite y la leche hasta integrar. Agregar la harina tamizada y mezclar bien." },
    { "step": "Incorporar las yemas de los 6 huevos y el extracto de vainilla. Batir hasta obtener una masa lisa y sin grumos." },
    { "step": "En otro bol, batir las claras con el jugo de limón. Agregar el azúcar en tres etapas mientras se baten, hasta lograr un merengue de punto medio, suave y brillante." },
    { "step": "Incorporar un tercio del merengue a la mezcla de yemas y luego plegar el resto con movimientos envolventes hasta obtener una masa uniforme." },
    { "step": "Verter en la bandeja, alisar la superficie y hornear a 170 °C durante 35 minutos." },
    { "step": "Cubrir inmediatamente el bizcocho con papel pergamino al salir del horno para evitar que se reseque." },
    { "step": "Preparar el relleno mezclando el mascarpone con el azúcar y la vainilla. Agregar la crema y batir suavemente hasta formar una crema espesa." },
    { "step": "Voltear el bizcocho sobre papel nuevo, retirar el papel anterior y cortar los bordes duros. Realizar pequeños cortes en el borde inicial para facilitar el enrollado." },
    { "step": "Extender el relleno, enrollar con ayuda del papel y envolver el rollo. Refrigerar 1 hora antes de cortar y servir." }
  ],
  "images": [
    "https://example.com/rollo-vainilla-1.webp",
    "https://example.com/rollo-vainilla-2.webp"
  ],
  "rating": null,
  "tips": [
    "El merengue debe quedar húmedo y brillante, no seco, para mantener la flexibilidad del bizcocho.",
    "Cubrir el pastel recién horneado evita que la superficie se reseque o se pele.",
    "Corta los bordes duros y haz cortes leves antes de enrollar para prevenir grietas.",
    "No esperes a que el bizcocho enfríe por completo antes de enrollar; hazlo cuando esté tibio para mejor resultado.",
    "Si no tienes queso mascarpone, puedes reemplazarlo por queso crema.",
    "Si el pastel tiende a pelarse, aumenta ligeramente el tiempo o la temperatura del horneado para secar la superficie."
  ]
},
{
  "id": 46,
  "uid": "P-STY_000046",
  "name": "Brazo de Reina",
  "description": "Bizcocho suave y delicado relleno de manjar y coco rallado tostado, húmedo y fácil de enrollar. Ideal para sorprender con un postre clásico y elegante.",
  "imageUrl": "",
  "detailedInfo": "El Brazo de Reina es un pionono de textura ligera y flexible, gracias a la combinación de harina y maicena. Se caracteriza por su bizcocho aireado, un toque aromático en el almíbar y un relleno de manjar con coco tostado que potencia su sabor y aroma. La correcta separación de claras y yemas, el batido firme del merengue y la temperatura controlada del horno y relleno son clave para un resultado perfecto.",
  "ingredients": [
    { "name": "Harina de trigo", "quantity": "130 g" },
    { "name": "Maicena", "quantity": "20 g" },
    { "name": "Huevos (separados)", "quantity": "3 unidades" },
    { "name": "Azúcar", "quantity": "150 g" },
    { "name": "Almíbar (agua y azúcar)", "quantity": "2 partes agua, 1 parte azúcar" },
    { "name": "Ralladura de cítrico (opcional)", "quantity": "al gusto" },
    { "name": "Manjar (dulce de leche)", "quantity": "cantidad necesaria" },
    { "name": "Coco rallado tostado", "quantity": "cantidad necesaria" }
  ],
  "steps": [
    { "step": "Precalentar el horno a 180 °C y preparar la bandeja con papel pergamino." },
    { "step": "Batir las claras a punto de nieve hasta que estén firmes. Agregar el azúcar en lluvia y batir 2 minutos más hasta que brille." },
    { "step": "Incorporar las yemas con movimientos envolventes suaves, sin perder aire." },
    { "step": "Tamizar la harina y la maicena e integrarlas con movimientos envolventes cortos, cuidando no desinflar la mezcla." },
    { "step": "Verter la masa en la bandeja, alisar la superficie y hornear por 7 minutos. Comprobar que el bizcocho esté acolchado al tacto." },
    { "step": "Retirar del horno, enfriar unos minutos y desmoldar cuidadosamente sobre una rejilla." },
    { "step": "Preparar el almíbar con agua, azúcar y ralladura de cítrico. Empapar suavemente el bizcocho con una brocha, sin saturarlo." },
    { "step": "Calentar el manjar al baño maría hasta que esté blando y esparcirlo uniformemente sobre el bizcocho. Añadir coco rallado tostado." },
    { "step": "Usar el papel de hornear como guía para enrollar el pionono firmemente. Asegurarse de mantener la forma cilíndrica." },
    { "step": "Refrigerar unas horas antes de cortar para que el relleno se asiente y el corte sea limpio." }
  ],
  "images": [],
  "rating": null,
  "tips": [
    "Tamizar la harina y la maicena juntas antes de incorporarlas para evitar grumos y asegurar suavidad.",
    "Bate las claras con el azúcar hasta que estén firmes y brillantes para una estructura aérea estable.",
    "Calienta el manjar al baño maría para que se esparza fácilmente sin romper la textura del bizcocho.",
    "Controla el tiempo de horneado: 7 minutos es suficiente, si se sobrecocina el bizcocho se seca y quiebra al enrollar.",
    "Empapar el bizcocho solo lo necesario para mantener humedad sin volverlo pastoso.",
    "Refrigerar el pionono permite un corte limpio y que mantenga la forma cilíndrica."
  ]
},
{
  "id": 47,
  "uid": "P-STY_000047",
  "name": "Brazo de Reina V2",
  "description": "Bizcocho esponjoso y delicado, relleno de manjar abundante, húmedo y fácil de enrollar. Ideal como postre clásico y elegante.",
  "imageUrl": "",
  "detailedInfo": "Este Brazo de Reina destaca por su bizcocho ligero y aireado, logrado mediante claras batidas a punto nieve y yemas aireadas con azúcar flor y esencia de vainilla. El manjar templado esparcido uniformemente y el correcto enrollado con papel mantequilla garantizan un cilindro firme y un corte limpio. La combinación de textura esponjosa y relleno cremoso crea un postre clásico y delicioso.",
  "ingredients": [
    { "name": "Harina sin polvos de hornear", "quantity": "150 g" },
    { "name": "Azúcar flor o impalpable", "quantity": "150 g" },
    { "name": "Huevos (separados)", "quantity": "5 unidades" },
    { "name": "Esencia de vainilla", "quantity": "1 cucharadita" },
    { "name": "Manjar o dulce de leche", "quantity": "600 g" }
  ],
  "steps": [
    { "step": "Precalentar el horno a 180 °C y preparar la bandeja con papel mantequilla." },
    { "step": "Batir las claras a punto nieve, añadir la mitad del azúcar flor y continuar batiendo hasta obtener mezcla brillante y firme." },
    { "step": "Batir las yemas con el resto del azúcar flor y la esencia de vainilla hasta que estén pálidas y cremosas." },
    { "step": "Incorporar las yemas a las claras con movimientos envolventes suaves, cuidando no perder aire." },
    { "step": "Agregar la harina cernida con movimientos envolventes hasta que desaparezca, evitando sobre-mezclar." },
    { "step": "Verter la masa en la bandeja y hornear entre 10-12 minutos hasta que esté esponjosa y ligeramente dorada." },
    { "step": "Retirar del horno, despegar el papel y enrollar el bizcocho tibio con el mismo papel durante 10 minutos para darle memoria de forma." },
    { "step": "Desenrollar, esparcir el manjar templado uniformemente y volver a enrollar ayudándose del papel para mantener firme el cilindro." },
    { "step": "Refrigerar al menos media hora antes de cortar para un corte limpio y que el bizcocho mantenga su forma." }
  ],
  "images": [],
  "rating": null,
  "tips": [
    "Hornear solo el tiempo necesario para mantener el bizcocho húmedo y flexible; no exceder 12 minutos.",
    "Enrollar el bizcocho tibio para educar la forma y evitar que se quiebre.",
    "Usar la batidora solo para montar huevos; integrar harina y yemas con espátula para conservar aire.",
    "Templar el manjar antes de esparcirlo para que se deslice fácilmente y no rompa el bizcocho.",
    "Para una lata más grande (7 huevos), ajustar proporcionalmente harina y azúcar flor; procedimiento igual."
  ]
},
{
  "id": 48,
  "uid": "P-STY_000048",
  "name": "Brazo de Gitano con Crema Pastelera",
  "description": "Bizcocho genovés aireado y flexible, relleno con crema pastelera firme y aromática. Un clásico suave, equilibrado y de sabor delicado.",
  "imageUrl": "",
  "detailedInfo": "El Brazo de Gitano se basa en un bizcocho genovés sin polvos de hornear, donde el aire es el único agente de volumen. La mezcla aireada de claras y yemas batidas otorga una textura elástica y ligera. Se rellena con crema pastelera fría y espesa, que aporta suavidad y riqueza. El acabado con azúcar glas y un toque de canela lo convierte en un postre elegante y tradicional.",
  "ingredients": [
    { "name": "Huevos (separados)", "quantity": "4 unidades" },
    { "name": "Harina de trigo (cernida)", "quantity": "100 g (3/4 taza)" },
    { "name": "Azúcar granulada", "quantity": "100 g (1/2 taza)" },
    { "name": "Esencia de vainilla", "quantity": "1 cucharadita" },
    { "name": "Crema pastelera (fría y firme)", "quantity": "al gusto" },
    { "name": "Azúcar flor (para espolvorear)", "quantity": "cantidad necesaria" },
    { "name": "Canela en polvo (opcional)", "quantity": "al gusto" }
  ],
  "steps": [
    { "step": "Precalentar el horno a 180 °C y preparar una bandeja con papel mantequilla." },
    { "step": "Batir las claras a punto nieve firme y reservar." },
    { "step": "Batir las yemas con el azúcar y la vainilla hasta obtener una mezcla pálida y espesa." },
    { "step": "Incorporar las claras batidas a las yemas con movimientos envolventes suaves." },
    { "step": "Agregar la harina cernida en dos tandas, integrando con espátula sin perder aire." },
    { "step": "Verter la masa en la bandeja y hornear durante 10 a 11 minutos, hasta que esté cocido pero flexible." },
    { "step": "Retirar del horno, despegar el papel y enrollar el bizcocho caliente en un paño limpio. Dejar reposar 10 minutos." },
    { "step": "Desenrollar, rellenar con la crema pastelera completamente fría y volver a enrollar con ayuda del paño." },
    { "step": "Espolvorear con azúcar flor y opcionalmente canela. Refrigerar al menos 30 minutos antes de cortar y servir." }
  ],
  "images": [],
  "rating": null,
  "tips": [
    "Enrollar el bizcocho aún tibio en un paño para conservar humedad y flexibilidad.",
    "No usar polvo de hornear; el volumen depende del aire incorporado en el batido.",
    "Tamizar la harina para mantener la ligereza y evitar grumos.",
    "No usar crema tibia, ya que reblandece el bizcocho y puede hacerlo quebrar.",
    "Evitar el sobre-horneado: más de 11 minutos reseca la masa y dificulta el enrollado."
  ]
},
{
  "id": 49,
  "uid": "P-STY_000049",
  "name": "Brazo de Gitano de Chocolate con Chantilly",
  "description": "Bizcocho de cacao intenso, aireado y flexible, relleno con nata montada (Chantilly) y cubierto con glaseado de chocolate negro. Un postre delicado y elegante, equilibrado entre amargo y dulce.",
  "imageUrl": "https://example.com/brazo-gitano-chocolate.jpg",
  "detailedInfo": "El Brazo de Gitano de Chocolate combina un bizcocho ligero y aireado con cacao puro y un relleno de Chantilly suave y frío. El glaseado de chocolate negro aporta intensidad y sella la humedad, manteniendo la textura flexible del bizcocho. Cada capa se prepara con precisión para lograr un postre equilibrado y elegante, ideal para cualquier ocasión.",
  "ingredients": [
    { "name": "Huevos (separados)", "quantity": "4 unidades" },
    { "name": "Harina de trigo (cernida)", "quantity": "80 g" },
    { "name": "Cacao en polvo (sin azúcar)", "quantity": "20 g" },
    { "name": "Azúcar granulada", "quantity": "100 g" },
    { "name": "Nata para montar (bien fría)", "quantity": "300 ml" },
    { "name": "Esencia de vainilla", "quantity": "1 cucharadita" },
    { "name": "Azúcar glas", "quantity": "20 g" },
    { "name": "Azúcar avainillado", "quantity": "5 g" },
    { "name": "Glaseado de chocolate negro (Ganache)", "quantity": "al gusto" }
  ],
  "steps": [
    { "step": "Precalentar el horno a 180 °C y preparar una bandeja con papel mantequilla." },
    { "step": "Batir las claras a punto nieve firme y reservar." },
    { "step": "Batir las yemas con el azúcar granulada y la vainilla hasta que la mezcla esté pálida y espesa." },
    { "step": "Incorporar las claras a las yemas con movimientos envolventes suaves." },
    { "step": "Añadir la harina y el cacao tamizados, integrando con espátula sin perder aire." },
    { "step": "Verter la masa en la bandeja y hornear 12 minutos máximo, hasta que esté cocido pero flexible." },
    { "step": "Retirar del horno, voltear sobre un paño limpio y enrollar inmediatamente mientras está tibio. Dejar enfriar." },
    { "step": "Batir la nata fría, añadir azúcar glas y azúcar avainillado al iniciar, batir hasta picos firmes." },
    { "step": "Desenrollar el bizcocho frío, rellenar con la Chantilly y volver a enrollar ayudándose del paño." },
    { "step": "Cubrir con el glaseado de chocolate negro y dejar reposar unos minutos antes de refrigerar para estabilizar la forma y el relleno." }
  ],
  "images": [
    "https://example.com/brazo-gitano-chocolate-1.webp",
    "https://example.com/brazo-gitano-chocolate-2.webp"
  ],
  "rating": null,
  "tips": [
    "Todo el volumen depende del aire incorporado en los batidos; no mezclar agresivamente.",
    "Enrollar el bizcocho tibio en un paño para mantener la humedad y la forma cilíndrica.",
    "La nata debe estar muy fría y usar un bol metálico previamente enfriado para que monte correctamente.",
    "No sobre-hornear; el bizcocho debe estar flexible para poder enrollarse sin grietas.",
    "Dejar reposar en el frigorífico para que la Chantilly y el glaseado se estabilicen antes de cortar."
  ]
},
{
  "id": 50,
  "uid": "P-STY_000050",
  "name": "Empanadas de Alcayota",
  "description": "Empanadas dulces con masa tipo sablée, rellenas de alcayota (cabello de ángel) especiada, con un toque de nueces y canela. La masa es suave, ligeramente dulce y quebradiza, ideal para envolver un relleno potente.",
  "imageUrl": "https://example.com/empanadas-alcayota.jpg",
  "detailedInfo": "La receta se centra en una masa neutra y suave que permite que el relleno dulce y especiado de alcayota brille. El cremar correctamente la grasa con azúcar flor y controlar el amasado garantiza una textura desmenuzable y ligera. Pincelar con huevo o leche aporta color, brillo y ayuda al sellado de las empanadas.",
  "ingredients": [
    { "name": "Harina de trigo", "quantity": "350 g" },
    { "name": "Maicena", "quantity": "50 g" },
    { "name": "Azúcar flor (glass)", "quantity": "50 g" },
    { "name": "Margarina o mantequilla", "quantity": "100 g" },
    { "name": "Sal", "quantity": "1 pizca" },
    { "name": "Leche a temperatura ambiente", "quantity": "cant. necesaria" },
    { "name": "Relleno de Alcayota (cabello de ángel) con nueces y canela", "quantity": "al gusto" },
    { "name": "Huevo batido o leche para pincelar", "quantity": "al gusto" }
  ],
  "steps": [
    { "step": "Cremar la margarina o mantequilla con el azúcar flor hasta obtener mezcla suave y homogénea." },
    { "step": "Incorporar la harina, maicena y la sal, añadir leche poco a poco hasta formar una masa que se una." },
    { "step": "Si se usa mantequilla, refrigerar la masa al menos 30 minutos antes de estirar." },
    { "step": "Estirar la masa hasta un grosor medio, cortar círculos de 10-12 cm de diámetro." },
    { "step": "Colocar el relleno de alcayota en el centro, humedecer bordes con agua o leche y cerrar formando media luna." },
    { "step": "Pincelar las empanadas con huevo batido o leche para dar brillo y ayudar al sellado." },
    { "step": "Hornear a 180 °C durante 20-25 minutos hasta que estén doradas." },
    { "step": "Dejar enfriar a temperatura ambiente antes de cortar o servir." }
  ],
  "images": [
    "https://example.com/empanadas-alcayota-1.webp",
    "https://example.com/empanadas-alcayota-2.webp"
  ],
  "rating": null,
  "tips": [
    "No sobre-amasar la masa para evitar empanadas duras.",
    "Si se usa mantequilla, deja reposar la masa en refrigerador antes de estirar para facilitar manejo.",
    "Pincelar con huevo para dar color y brillo, leche como alternativa.",
    "Cortar las empanadas tibias o frías para mantener la presentación y sabor óptimo.",
    "Estirar la masa lo suficiente para sostener el relleno sin romperse."
  ]
},
{
  "id": 51,
  "uid": "P-STY_000051",
  "name": "Empanadas de Piña",
  "description": "Empanadas dulces con masa quebrada tipo 3-2-1, ligeramente salada, rellenas de piña fresca cocida con vainilla y una pizca de sal. El relleno se espesa con maicena para que sea firme y no humedezca la masa.",
  "imageUrl": "https://example.com/empanadas-pina.jpg",
  "detailedInfo": "La masa 3-2-1 se prepara con 3 partes de harina, 2 de mantequilla y 1 de líquido, logrando una textura arenosa y flexible. El relleno de piña se cocina y espesa con maicena, se enfría completamente antes de rellenar, y la masa se refrigera y, si se desea, se congela ligeramente antes de hornear para obtener empanadas estables y esponjosas.",
  "ingredients": [
    { "name": "Harina de trigo", "quantity": "360 g (3 tazas)" },
    { "name": "Mantequilla con sal", "quantity": "226 g (2 barras)" },
    { "name": "Crema o leche evaporada", "quantity": "240 ml (1 taza), agregar gradualmente" },
    { "name": "Piña fresca", "quantity": "500 g" },
    { "name": "Azúcar", "quantity": "50 g (ajustar al gusto)" },
    { "name": "Sal", "quantity": "1 pizca" },
    { "name": "Vainilla", "quantity": "1 cucharadita" },
    { "name": "Maicena", "quantity": "15 g (1 cucharada aprox.)" },
    { "name": "Huevo batido para pincelar", "quantity": "al gusto" }
  ],
  "steps": [
    { "step": "Preparar el relleno: cocinar la piña con azúcar, sal y vainilla hasta reducir el líquido." },
    { "step": "Disolver la maicena en agua fría y añadir al relleno caliente, mezclar hasta espesar y enfriar completamente." },
    { "step": "Preparar la masa: mezclar harina y mantequilla hasta obtener textura arenosa." },
    { "step": "Agregar la crema o leche poco a poco, amasar solo hasta unir en bollo homogéneo." },
    { "step": "Refrigerar la masa al menos 30 minutos; opcionalmente congelar bolitas de masa por 10-15 minutos antes de estirar." },
    { "step": "Estirar la masa en círculos, colocar relleno de piña en el centro y cerrar sin sobrellenar." },
    { "step": "Pincelar con huevo batido y hornear a 180 °C por 20-25 minutos hasta dorar." },
    { "step": "Dejar enfriar a temperatura ambiente antes de servir." }
  ],
  "images": [
    "https://example.com/empanadas-pina-1.webp",
    "https://example.com/empanadas-pina-2.webp"
  ],
  "rating": null,
  "tips": [
    "Respetar los reposos de la masa para obtener textura arenosa y flexible.",
    "No sobre-amasar para evitar que la masa se vuelva dura.",
    "Relleno debe estar frío o tibio al rellenar para evitar que la masa se abra.",
    "Pincelar con huevo para sellar y dar color dorado.",
    "Cortar círculos de masa cerca unos de otros para aprovechar toda la harina y refrigerar restos antes de estirar nuevamente."
  ]
},
{
  "id": 52,
  "uid": "P-STY_000052",
  "name": "Empanadas de Crema Pastelera",
  "description": "Empanadas dulces con masa tipo polvorón a base de mantequilla y queso crema, rellenas de crema pastelera espesa, aromatizada con vainilla y finalizadas con azúcar y canela. La masa es suave, desmenuzable y no elástica, ideal para rellenos firmes.",
  "imageUrl": "https://example.com/empanadas-crema.jpg",
  "detailedInfo": "La masa combina mantequilla y queso crema para lograr suavidad y textura desmenuzable. La crema pastelera se cocina hasta espesarse, se enfría completamente antes de rellenar y se pasa por un doble enfriado. El horneado es breve y se evita dorar demasiado la masa; el pincelado no es necesario, pero el acabado final con azúcar y canela añade aroma y contraste.",
  "ingredients": [
    { "name": "Harina de trigo", "quantity": "260 g (2 tazas + 2 cdas)" },
    { "name": "Mantequilla sin sal", "quantity": "180 g" },
    { "name": "Queso crema", "quantity": "105 g" },
    { "name": "Polvo de hornear", "quantity": "1/2 cucharadita" },
    { "name": "Vainilla", "quantity": "1 cucharadita" },
    { "name": "Leche", "quantity": "480 ml (2 tazas)" },
    { "name": "Yemas de huevo", "quantity": "4 unidades" },
    { "name": "Azúcar", "quantity": "120 g (1/2 taza)" },
    { "name": "Fécula de maíz (maicena)", "quantity": "40 g (5 cucharadas)" },
    { "name": "Azúcar + canela para espolvorear", "quantity": "al gusto" }
  ],
  "steps": [
    { "step": "Preparar la crema pastelera: batir yemas, azúcar, vainilla y fécula en frío hasta disolver la maicena." },
    { "step": "Agregar la leche y cocinar a fuego lento, batiendo constantemente hasta espesar (aprox. 20 minutos)." },
    { "step": "Enfriar la crema a temperatura ambiente, luego refrigerar hasta que esté firme." },
    { "step": "Preparar la masa: incorporar mantequilla y queso crema a la harina con polvo de hornear, amasar solo hasta formar masa manejable." },
    { "step": "Estirar la masa a 0.5 cm de grosor entre papeles encerados." },
    { "step": "Rellenar con crema pastelera, doblar y sellar con tenedor." },
    { "step": "Hornear a 180 °C por 12 minutos; la masa debe permanecer clara, no dorar demasiado." },
    { "step": "Dejar enfriar y espolvorear con mezcla de azúcar y canela antes de servir." }
  ],
  "images": [
    "https://example.com/empanadas-crema-1.webp",
    "https://example.com/empanadas-crema-2.webp"
  ],
  "rating": null,
  "tips": [
    "No perforar la masa para evitar desbordes; el sello con tenedor es suficiente.",
    "Doble enfriado de la crema pastelera garantiza firmeza al rellenar.",
    "Amasar lo justo para mantener textura desmenuzable tipo polvorón.",
    "Seguir tiempo exacto de horneado; la masa no debe dorar demasiado.",
    "Dejar enfriar antes de espolvorear azúcar y canela para evitar acabado pegajoso."
  ]
},
{
  "id": 53,
  "uid": "P-STY_000053",
  "name": "Empanadas de Coco",
  "description": "Empanadas tipo pan dulce con masa esponjosa fermentada con levadura, rellenas de dulce de coco caramelizado con piloncillo y aromatizadas con vainilla y canela. La masa es suave y ligeramente dulce, ideal para un relleno intenso y estable.",
  "imageUrl": "https://example.com/empanadas-coco.jpg",
  "detailedInfo": "La masa se prepara con levadura seca y manteca vegetal para obtener un pan dulce esponjoso. El relleno de coco con piloncillo se cocina hasta casi seco para evitar humedad excesiva. Se recomienda doble reposo de la masa y pincelado con huevo para lograr una empanada estable y con buen color.",
  "ingredients": [
    { "name": "Harina de trigo", "quantity": "500 g" },
    { "name": "Manteca vegetal", "quantity": "250 g" },
    { "name": "Levadura seca", "quantity": "1 cucharadita" },
    { "name": "Agua tibia", "quantity": "360 ml" },
    { "name": "Coco seco", "quantity": "250 g" },
    { "name": "Piloncillo", "quantity": "250 g" },
    { "name": "Vainilla", "quantity": "1 cucharada" },
    { "name": "Canela en polvo", "quantity": "1/2 cucharadita (opcional)" },
    { "name": "Clavo de olor", "quantity": "1 unidad (opcional)" },
    { "name": "Huevo batido para pincelar", "quantity": "al gusto" }
  ],
  "steps": [
    { "step": "Preparar el relleno: mezclar coco seco con agua, piloncillo y aromatizantes (vainilla, canela, clavo) y cocinar a fuego medio hasta que casi seque." },
    { "step": "Mezclar harina y manteca vegetal, integrar bien hasta textura arenosa." },
    { "step": "Agregar levadura y agua tibia poco a poco, amasar hasta formar masa homogénea y suave." },
    { "step": "Dejar reposar la masa fermentando 30-40 minutos hasta que doble su tamaño." },
    { "step": "Formar bolitas de masa y dejarlas reposar 10-15 minutos antes de estirar." },
    { "step": "Estirar cada bolita en círculo, colocar el relleno de coco en el centro y cerrar sin presionar demasiado." },
    { "step": "Pincelar con huevo batido los bordes para asegurar el sellado." },
    { "step": "Hornear a 180 °C durante 25-30 minutos hasta dorar y obtener pan dulce esponjoso." },
    { "step": "Dejar enfriar a temperatura ambiente antes de servir." }
  ],
  "images": [
    "https://example.com/empanadas-coco-1.webp",
    "https://example.com/empanadas-coco-2.webp"
  ],
  "rating": null,
  "tips": [
    "Usar agua tibia para activar correctamente la levadura.",
    "Respetar los dos reposos de la masa para obtener esponjosidad y buen levado.",
    "No hacer doblez en el borde; solo cerrar y presionar con tenedor o manos.",
    "El relleno debe estar tibio o casi frío al rellenar para evitar que la masa se deforme.",
    "Pincelar con huevo para sellar y lograr buen color dorado."
  ]
},
{
  "id": 54,
  "uid": "P-STY_000054",
  "name": "Empanadas de Dulce de Leche",
  "description": "Empanadas dulces con masa neutra de margarina y queso crema, rellenas de dulce de leche estabilizado con yema de huevo. La superficie se espolvorea con azúcar y canela recién horneadas, creando contraste dulce y aromático.",
  "imageUrl": "https://example.com/empanadas-dulce-de-leche.jpg",
  "detailedInfo": "La masa combina margarina y queso crema para obtener suavidad y manejabilidad. El relleno de dulce de leche se mezcla con yema de huevo para evitar desbordes durante el horneado. El acabado con azúcar y canela se aplica en caliente para que se adhiera perfectamente a la superficie de la empanada.",
  "ingredients": [
    { "name": "Margarina", "quantity": "270 g (3 barras de 90 g)" },
    { "name": "Queso crema", "quantity": "180 g (1 barra)" },
    { "name": "Harina de trigo", "quantity": "3 1/2 tazas" },
    { "name": "Dulce de leche", "quantity": "1 lata (aprox. 400 g)" },
    { "name": "Yema de huevo", "quantity": "1 unidad" },
    { "name": "Azúcar y canela para espolvorear", "quantity": "al gusto" }
  ],
  "steps": [
    { "step": "Acremar la margarina y el queso crema con las manos hasta obtener mezcla suave." },
    { "step": "Agregar la harina gradualmente y formar un bollo homogéneo, sin sobre-amasar." },
    { "step": "Formar bolitas de masa de 30-40 g cada una y reposar 10 minutos en refrigerador opcionalmente." },
    { "step": "Estirar las bolitas entre dos papeles encerados o de horno hasta grosor deseado." },
    { "step": "Preparar el relleno: mezclar el dulce de leche con la yema de huevo hasta integrar completamente." },
    { "step": "Rellenar las bolitas con dulce de leche, cerrar y sellar bien con repulgue o con los dedos." },
    { "step": "Hornear en horno precalentado a 180 °C por 25-30 minutos hasta que la base esté cocida." },
    { "step": "Retirar del horno y espolvorear inmediatamente con mezcla de azúcar y canela mientras las empanadas están calientes." }
  ],
  "images": [
    "https://example.com/empanadas-dulce-de-leche-1.webp",
    "https://example.com/empanadas-dulce-de-leche-2.webp"
  ],
  "rating": null,
  "tips": [
    "Mezclar la yema con el dulce de leche estabiliza el relleno y evita desbordes.",
    "No sobre-amasar la masa para mantener textura suave y manejable.",
    "Aplicar azúcar y canela mientras la empanada está caliente para mejor adhesión.",
    "Si se desea, refrigerar las bolitas de masa antes de estirar para facilitar el manejo.",
    "Pesar las bolitas asegura uniformidad en tamaño y tiempo de horneado."
  ]
},
{
  "id": 55,
  "uid": "P-STY_000055",
  "name": "Empanadas de Membrillo",
  "description": "Empanadas dulces rápidas usando tapas pre-hechas, rellenas con membrillo y espolvoreadas con azúcar para un acabado brillante y caramelizado.",
  "imageUrl": "https://example.com/empanadas-membrillo.jpg",
  "detailedInfo": "Esta receta utiliza tapas de empanadas pre-hechas como base, concentrándose en un relleno de membrillo denso y dulce. La técnica de sellado con agua y el repulgue asegura que el relleno no se escape durante el horneado. El acabado con huevo y azúcar proporciona brillo y caramelización.",
  "ingredients": [
    { "name": "Tapas de empanadas", "quantity": "12 unidades" },
    { "name": "Membrillo", "quantity": "250 g" },
    { "name": "Huevo batido", "quantity": "1 unidad" },
    { "name": "Azúcar", "quantity": "1-2 cucharadas para espolvorear" }
  ],
  "steps": [
    { "step": "Precalentar el horno y preparar la bandeja forrándola con papel de aluminio y enmantecando." },
    { "step": "Colocar dos cubos de membrillo en el centro de cada tapa de empanada." },
    { "step": "Mojar los bordes con agua y presionar bien para sellar, luego realizar el repulgue." },
    { "step": "Pincelar todas las empanadas con huevo batido y espolvorear con azúcar." },
    { "step": "Hornear a temperatura media-alta (aprox. 190-200 °C) hasta que la masa esté dorada." },
    { "step": "Retirar del horno y dejar enfriar ligeramente antes de servir." }
  ],
  "images": [
    "https://example.com/empanadas-membrillo-1.webp",
    "https://example.com/empanadas-membrillo-2.webp"
  ],
  "rating": null,
  "tips": [
    "Mojar los bordes con agua garantiza que el membrillo no se escape.",
    "El punto de horneado se debe controlar por el color dorado de la masa, no por tiempo exacto.",
    "El repulgue correcto asegura que el relleno se mantenga dentro de la empanada.",
    "No necesita reposo, puede hornearse inmediatamente después de armar.",
    "Usar tapas pre-hechas facilita y acelera la preparación sin comprometer la textura."
  ]
},
{
  "id": 56,
  "uid": "P-STY_000056",
  "name": "Empanadas de Manzana y Nuez",
  "description": "Empanadas dulces con relleno agridulce de manzana caramelizada y nueces, envueltas en una masa delgada, crujiente y ligeramente 'a galletada', con un toque de canela.",
  "imageUrl": "https://example.com/empanadas-manzana-nuez.jpg",
  "detailedInfo": "La receta equilibra la acidez y dulzor de la manzana caramelizada con la textura de la nuez, envuelta en una masa que se vuelve crujiente y elástica gracias al vino blanco. El relleno se debe enfriar completamente antes de armar las empanadas para evitar desbordes. El pincelado con huevo y leche ('Dora') da color y brillo a la masa horneada.",
  "ingredients": [
    { "name": "Harina de trigo", "quantity": "420 g" },
    { "name": "Sal", "quantity": "1 g" },
    { "name": "Azúcar", "quantity": "12 g" },
    { "name": "Mantequilla a temperatura ambiente", "quantity": "50 g" },
    { "name": "Vino blanco", "quantity": "20 ml" },
    { "name": "Agua tibia", "quantity": "50 ml, aprox. hasta unir la masa" },
    { "name": "Manzana", "quantity": "2 unidades medianas (aprox. 300 g), peladas y picadas" },
    { "name": "Nueces", "quantity": "50 g, picadas" },
    { "name": "Azúcar (para el relleno)", "quantity": "25 g" },
    { "name": "Canela en polvo", "quantity": "2 g" },
    { "name": "Huevo entero", "quantity": "1 unidad (para pincelar)" },
    { "name": "Leche", "quantity": "50 ml (para pincelar)" }
  ],
  "steps": [
    { "step": "Mezclar harina, sal y azúcar. Incorporar mantequilla y vino blanco, añadir agua tibia poco a poco hasta formar masa elástica." },
    { "step": "Amasar por 5 minutos hasta que la masa no se pegue en las manos. Refrigerar envuelta en plástico por 20 minutos." },
    { "step": "Cocinar manzanas con mantequilla, azúcar, canela y nueces a fuego fuerte hasta hervir, luego bajar a fuego mínimo y cocinar 30 minutos. Enfriar y refrigerar 3 horas." },
    { "step": "Estirar la masa en láminas finas. Cortar círculos y colocar relleno frío en el centro." },
    { "step": "Mojar bordes con agua, cerrar, sacar aire y sellar con repulgue o tenedor. Hacer pequeña perforación en la parte superior." },
    { "step": "Preparar la mezcla 'Dora' de huevo y leche. Pincelar las empanadas con esta mezcla." },
    { "step": "Hornear a 220 °C por 8-12 minutos hasta dorar y crujir. Alternativamente, freír en aceite a 170-175 °C hasta dorar." },
    { "step": "Dejar enfriar ligeramente antes de servir." }
  ],
  "images": [
    "https://example.com/empanadas-manzana-nuez-1.webp",
    "https://example.com/empanadas-manzana-nuez-2.webp"
  ],
  "rating": null,
  "tips": [
    "Enfriar completamente el relleno antes de armar las empanadas para evitar desbordes.",
    "Hacer una pequeña perforación en la parte superior de cada empanada para que el vapor escape durante el horneado.",
    "No sobre-amasar la masa para mantener la textura crujiente y 'a galletada'.",
    "Pincelar con huevo y leche para un acabado dorado y brillante.",
    "Si se desea, agregar un toque de canela extra al momento de espolvorear."
  ]
},
{
  "id": 57,
  "uid": "P-STY_000057",
  "name": "Milhojas de Crema Pastelera",
  "description": "Postre de capas crujientes de hojaldre rellenas con crema pastelera sedosa infusionada con canela y limón, terminado con azúcar glass caramelizado para un toque crujiente y dulce.",
  "imageUrl": "https://example.com/milhojas-crema.jpg",
  "detailedInfo": "La milhojas se basa en el contraste de texturas: la corteza de hojaldre crujiente frente a la suavidad de la crema pastelera. La infusión de leche con limón y canela aporta aroma, mientras que el azúcar glass caramelizado ofrece un acabado profesional y crujiente. Es importante enfriar tanto el hojaldre como la crema antes de armar para mantener las capas intactas.",
  "ingredients": [
    { "name": "Hojaldre rectangular (pre-hecho)", "quantity": "1 lámina" },
    { "name": "Yemas de huevo", "quantity": "5 unidades" },
    { "name": "Maicena (fécula de maíz)", "quantity": "50 g" },
    { "name": "Azúcar", "quantity": "100 g" },
    { "name": "Leche", "quantity": "500 ml" },
    { "name": "Rama de canela", "quantity": "1 unidad" },
    { "name": "Cáscara de limón", "quantity": "1 tira, solo parte amarilla" },
    { "name": "Azúcar glass", "quantity": "al gusto para espolvorear y caramelizar" }
  ],
  "steps": [
    { "step": "Cortar la lámina de hojaldre en 3 partes iguales y pinchar la superficie con un tenedor." },
    { "step": "Colocar las láminas sobre bandeja con papel de hornear, cubrir con otra bandeja encima y hornear a 200 °C por 20 minutos hasta dorar." },
    { "step": "Dejar enfriar completamente las láminas de hojaldre antes de rellenar." },
    { "step": "Batir las yemas con el azúcar y la maicena hasta obtener mezcla homogénea y pálida." },
    { "step": "Calentar la leche con la canela y la cáscara de limón. Retirar antes de que hierva y quitar canela y cáscara." },
    { "step": "Verter la leche templada sobre la mezcla de yemas lentamente, batiendo constantemente." },
    { "step": "Devolver la mezcla a la cacerola y cocinar a fuego medio-bajo hasta que espese y hierva, batiendo constantemente." },
    { "step": "Cubrir la crema con papel film tocando la superficie y refrigerar 1-2 horas hasta que esté fría y firme." },
    { "step": "Colocar la primera capa de hojaldre, cubrir con crema pastelera, repetir con la segunda capa y finalizar con la tercera capa de hojaldre." },
    { "step": "Espolvorear azúcar glass sobre la capa superior y caramelizar con soplete inmediatamente antes de servir." }
  ],
  "images": [
    "https://example.com/milhojas-crema-1.webp",
    "https://example.com/milhojas-crema-2.webp"
  ],
  "rating": null,
  "tips": [
    "Pinchar la masa y hornear con bandeja encima para que quede delgada y crujiente.",
    "Añadir la leche caliente lentamente sobre las yemas para evitar cuajado y grumos en la crema.",
    "Cubrir la crema con film 'a piel' para evitar costras y mantener textura sedosa.",
    "Caramelizar el azúcar glass al final para contraste crujiente y acabado profesional."
  ]
},
{
  "id": 58,
  "uid": "P-STY_000058",
  "name": "Milhojas de Dulce de Leche (Hojaldre Casero)",
  "description": "Postre de capas crujientes de hojaldre casero rellenas con dulce de leche repostero, decorado con chocolate semi-amargo y blanco y laterales cubiertos de crocante de hojaldre.",
  "imageUrl": "https://example.com/milhojas-dl.jpg",
  "detailedInfo": "La milhojas se basa en un hojaldre casero con tres pliegues dobles para obtener máxima separación de capas y textura crujiente. El relleno de dulce de leche repostero aporta estabilidad y sabor intenso. La decoración con chocolate semi-amargo y blanco, junto con crocante de hojaldre, eleva el contraste y presentación final.",
  "ingredients": [
    { "name": "Manteca (o mantequilla) a T.A.", "quantity": "400 g" },
    { "name": "Harina para empaste", "quantity": "100 g" },
    { "name": "Harina para amasijo", "quantity": "400 g" },
    { "name": "Agua", "quantity": "220 ml" },
    { "name": "Sal", "quantity": "10 g" },
    { "name": "Dulce de leche repostero", "quantity": "800 g" },
    { "name": "Azúcar impalpable", "quantity": "50 g" },
    { "name": "Chocolate semi-amargo", "quantity": "100 g" },
    { "name": "Chocolate blanco", "quantity": "20 g" }
  ],
  "steps": [
    { "step": "Preparar el empaste mezclando manteca con 100 g de harina hasta integrar. Formar un rectángulo y refrigerar 30-40 min." },
    { "step": "Preparar el amasijo mezclando 400 g harina, sal y 220 ml agua. Amasar 3-4 min y reposar 30 min a T.A." },
    { "step": "Estirar el amasijo y envolver el empaste frío. Hacer Pliegue Doble N°1 y refrigerar 30 min." },
    { "step": "Repetir el Pliegue Doble dos veces más (total 3 pliegues), girando 90° cada vez." },
    { "step": "Estirar la masa final a 3-4 mm de espesor, recortar bordes y pinchar con tenedor. Reposar 20 min en refrigerador." },
    { "step": "Primer horneado: espolvorear azúcar impalpable y hornear 20 min a 200 °C. Segundo horneado: cubrir con papel manteca, aplastar con bandeja pesada, hornear 20-25 min." },
    { "step": "Recortar bordes para igualar capas y triturar los recortes para decorado lateral. Dejar enfriar." },
    { "step": "Armar la milhojas: untar 200 g de dulce de leche entre capa y capa hasta completar el pastel." },
    { "step": "Cubrir laterales con el dulce de leche restante y pegar los recortes triturados para formar el crocante." },
    { "step": "Cubrir la superficie con chocolate semi-amargo derretido hasta los bordes y decorar con chocolate blanco en líneas finas." }
  ],
  "images": [
    "https://example.com/milhojas-dl-1.webp",
    "https://example.com/milhojas-dl-2.webp"
  ],
  "rating": null,
  "tips": [
    "El empaste debe estar frío y firme para garantizar laminación perfecta y capas crujientes.",
    "Después de cada pliegue, girar la masa 90° para mantener estructura homogénea y evitar roturas.",
    "Doble cocción con bandeja pesada evita que el hojaldre infle demasiado y quede plano y crujiente.",
    "Usar dulce de leche repostero firme asegura estabilidad del relleno y mantiene la forma del pastel."
  ]
},
{
  "id": 59,
  "uid": "P-STY_000059",
  "name": "Milhojas Napoleón con Muselina de Vainilla",
  "description": "Milhojas de estilo francés con capas de hojaldre caramelizado y relleno de muselina de vainilla. Decoración profesional con glaseado de albúmina y topping de chocolate en patrón Napoleón.",
  "imageUrl": "https://example.com/milhojas-napoleon.jpg",
  "detailedInfo": "La estrategia de sabor se centra en la combinación del hojaldre crujiente y caramelizado con la muselina de vainilla, que es una crema pastelera enriquecida con mantequilla montada y gelatina para estabilidad. El glaseado de albúmina proporciona un acabado brillante y crujiente, con decoración de chocolate para el patrón Napoleón.",
  "ingredients": [
    { "name": "Hojaldre casero (masa)", "quantity": "1 lámina rectangular" },
    { "name": "Azúcar glas", "quantity": "c/n" },
    { "name": "Yemas de huevo", "quantity": "c/n" },
    { "name": "Azúcar", "quantity": "c/n" },
    { "name": "Harina", "quantity": "c/n" },
    { "name": "Maicena", "quantity": "c/n" },
    { "name": "Leche", "quantity": "500 ml" },
    { "name": "Pasta de vainilla", "quantity": "1-2 g" },
    { "name": "Gelatina hidratada", "quantity": "5 g" },
    { "name": "Mantequilla a T.A. (para la crema)", "quantity": "50 g" },
    { "name": "Mantequilla montada (para muselina)", "quantity": "190 g" },
    { "name": "Albúmina (clara deshidratada)", "quantity": "15 g" },
    { "name": "Agua (para disolver albúmina)", "quantity": "50 ml" },
    { "name": "Extracto de vainilla", "quantity": "2 ml" },
    { "name": "Azúcar glas (para glaseado)", "quantity": "50 g" },
    { "name": "Chocolate (topping)", "quantity": "20 g" }
  ],
  "steps": [
    { "step": "Preparar la crema base mezclando yemas, azúcar, harina/maicena y un poco de leche hasta homogeneizar. Añadir pasta de vainilla." },
    { "step": "Hervir el resto de la leche y verter sobre la mezcla de yemas, batiendo constantemente. Cocinar a fuego suave hasta espesar." },
    { "step": "Retirar del fuego y añadir gelatina hidratada y mantequilla a T.A. Mezclar bien para estabilizar." },
    { "step": "Cubrir la crema con film tocando la superficie y refrigerar 1-2 horas hasta enfriar completamente." },
    { "step": "Montar la mantequilla restante (190 g) hasta que esté cremosa. Batir la crema pastelera fría y añadirla gradualmente a la mantequilla montada para formar la muselina." },
    { "step": "Estirar el hojaldre hasta 5 mm de grosor. Cortar bordes y caramelizar con azúcar glas." },
    { "step": "Hornear con otra bandeja encima para aplicar peso, a 200 °C por 23-25 minutos, hasta dorar y crujir." },
    { "step": "Usar manga pastelera con boquilla redonda para disponer la muselina sobre las capas de hojaldre en pequeñas bolas. Presionar ligeramente cada capa." },
    { "step": "Preparar glaseado: disolver albúmina en agua, añadir extracto de vainilla y batir a velocidad media. Incorporar azúcar glas hasta obtener consistencia espesa pero fluida." },
    { "step": "Cubrir la superficie con glaseado usando manga, dibujar líneas paralelas con chocolate y luego marcar líneas perpendiculares con palillo para formar patrón Napoleón." },
    { "step": "Reservar en frigorífico antes de consumir para que la muselina adquiera textura ideal (suave y estable)." }
  ],
  "images": [
    "https://example.com/milhojas-napoleon-1.webp",
    "https://example.com/milhojas-napoleon-2.webp"
  ],
  "rating": null,
  "tips": [
    "Muselina: la combinación de crema pastelera fría con mantequilla montada asegura textura ligera y estable.",
    "Añadir gelatina a la crema pastelera caliente da firmeza para soportar capas altas de hojaldre.",
    "Caramelizar el hojaldre con azúcar glas antes de hornear garantiza crujido extra y efecto profesional.",
    "Glaseado de albúmina proporciona brillo y crujido, ideal para aplicar el patrón Napoleón rápidamente."
  ]
},
{
  "id": 60,
  "uid": "P-STY_000060",
  "name": "Milhojas de Merengue Casero",
  "description": "Milhojas con hojaldre crujiente y relleno de merengue italiano. Decoración final con azúcar glas y canela molida para aroma cálido y presentación profesional.",
  "imageUrl": "https://example.com/milhojas-merengue.jpg",
  "detailedInfo": "El contraste entre el hojaldre crujiente y el merengue italiano estable es la clave del éxito. El merengue se cocina parcialmente con almíbar caliente, creando una textura brillante, firme y sedosa. El azúcar glas y la canela aportan el toque final de dulzor y aroma.",
  "ingredients": [
    { "name": "Hojaldre comercial (masa)", "quantity": "1 lámina" },
    { "name": "Azúcar para espolvorear", "quantity": "c/n" },
    { "name": "Claras de huevo (talla L)", "quantity": "5 unidades (~186 g)" },
    { "name": "Sal", "quantity": "1 pizca" },
    { "name": "Azúcar (para montar claras)", "quantity": "40 g" },
    { "name": "Zumo de limón", "quantity": "3 cdas (~45 ml)" },
    { "name": "Agua (para almíbar)", "quantity": "120 ml" },
    { "name": "Azúcar (para almíbar)", "quantity": "300 g" },
    { "name": "Azúcar glas (para decoración)", "quantity": "c/n" },
    { "name": "Canela molida", "quantity": "c/n" }
  ],
  "steps": [
    { "step": "Abrir la lámina de hojaldre y dividir en dos partes iguales." },
    { "step": "Pinchar toda la superficie con un tenedor y espolvorear azúcar." },
    { "step": "Hornear con bandeja pesada encima a 200 °C por 30 minutos. Retirar y enfriar completamente sobre rejilla." },
    { "step": "Montar las claras con pizca de sal a baja velocidad. Cuando espumen, añadir 40 g de azúcar y seguir batiendo." },
    { "step": "Agregar el zumo de limón y subir la velocidad de batido hasta lograr picos suaves." },
    { "step": "Preparar almíbar con 300 g de azúcar y 120 ml de agua, cocinando hasta punto de hebra." },
    { "step": "Verter el almíbar caliente en forma de hilo sobre las claras, batiendo a mínima velocidad. Subir la potencia hasta enfriar el bol y obtener picos firmes." },
    { "step": "Colocar una plancha de hojaldre, extender el merengue uniformemente con espátula." },
    { "step": "Colocar la segunda plancha de hojaldre encima y presionar suavemente." },
    { "step": "Sellar los laterales empujando el merengue sobresaliente con espátula." },
    { "step": "Espolvorear con azúcar glas y hacer líneas finas de canela molida sobre la superficie." },
    { "step": "Refrigerar hasta servir. Para cortar, usar cuchillo de sierra para evitar aplastar el merengue y deshacer el hojaldre." }
  ],
  "images": [
    "https://example.com/milhojas-merengue-1.webp",
    "https://example.com/milhojas-merengue-2.webp"
  ],
  "rating": null,
  "tips": [
    "El almíbar caliente 'cocina' las claras creando merengue firme y estable.",
    "Batir las claras inicialmente a baja velocidad evita burbujas grandes y asegura textura sedosa.",
    "Hornear hojaldre con bandeja pesada y espolvorear azúcar garantiza crocancia.",
    "Para cortar y servir, usar cuchillo de sierra, respetando la textura del merengue y hojaldre."
  ]
},
{
  "id": 61,
  "uid": "P-STY_000061",
  "name": "Tarta de Hojaldre, Crema y Frutas",
  "description": "Tarta de hojaldre crujiente con crema de Mascarpone estabilizada y frutas frescas (fresas, arándanos, frambuesas y moras). La crema se monta con gelatina para mantener la forma y la frescura del postre.",
  "imageUrl": "https://example.com/tarta-hojaldre-frutas.jpg",
  "detailedInfo": "Base de hojaldre caramelizado, crema de Mascarpone estable y frutas frescas. Contraste de texturas: crujiente, cremosa y jugosa. La crema se estabiliza con gelatina, permitiendo un montaje firme y elegante. Se puede añadir crema de chocolate como decoración opcional.",
  "ingredients": [
    { "name": "Hojaldre de mantequilla", "quantity": "1 lámina" },
    { "name": "Azúcar para espolvorear hojaldre", "quantity": "2 cucharadas (~25 g)" },
    { "name": "Nata para montar (mín. 35% MG)", "quantity": "400 g" },
    { "name": "Queso Mascarpone", "quantity": "100 g" },
    { "name": "Azúcar glas", "quantity": "80 g" },
    { "name": "Vainilla en pasta", "quantity": "2 cucharaditas (~10 ml)" },
    { "name": "Gelatina en polvo", "quantity": "1 cucharadita (~5 g)" },
    { "name": "Agua para hidratar gelatina", "quantity": "15 ml" },
    { "name": "Frutas frescas (fresas, arándanos, frambuesas, moras)", "quantity": "c/n" },
    { "name": "Crema de chocolate (opcional)", "quantity": "c/n" }
  ],
  "steps": [
    { "step": "Espolvorear el hojaldre con azúcar por ambos lados y presionar ligeramente con rodillo." },
    { "step": "Hornear con bandeja pesada encima a 200 °C hasta dorar y caramelizar. Dejar enfriar completamente." },
    { "step": "Cortar los bordes y dividir la plancha de hojaldre en tres rectángulos iguales." },
    { "step": "Hidratar la gelatina en agua durante 5 minutos." },
    { "step": "Batir el Mascarpone frío unos segundos. Añadir la nata muy fría y batir hasta que esté medio montada." },
    { "step": "Incorporar el azúcar glas y la pasta de vainilla, mezclando suavemente." },
    { "step": "Añadir la gelatina derretida lentamente, batiendo a baja velocidad hasta obtener una crema firme y esponjosa." },
    { "step": "Colocar la primera capa de hojaldre. Con manga pastelera, disponer copetes de crema y distribuir fruta cortada sobre ella." },
    { "step": "Colocar la segunda capa de hojaldre y repetir relleno y fruta. Terminar con la tercera capa de hojaldre." },
    { "step": "Decorar con copetes de crema, hilos de chocolate opcionales y virutas de hojaldre en los bordes." },
    { "step": "Reservar en refrigeración. Agregar la fruta decorativa justo antes de servir si se prepara con anticipación." }
  ],
  "images": [
    "https://example.com/tarta-hojaldre-frutas-1.webp",
    "https://example.com/tarta-hojaldre-frutas-2.webp"
  ],
  "rating": null,
  "tips": [
    "La gelatina estabiliza la crema, evitando que se desinfle o humedezca con las frutas.",
    "Espolvorear azúcar y hornear con peso asegura un hojaldre crujiente y caramelizado.",
    "Batir primero el Mascarpone antes de añadir la nata garantiza una mezcla homogénea y sin grumos.",
    "Cortar frutas grandes en trozos pequeños permite una distribución uniforme y facilita el corte de porciones."
  ]
},
{
  "id": 62,
  "uid": "P-STY_000062",
  "name": "Bavarois de Vainilla",
  "description": "Postre tipo mousse francés hecho con Crème Anglaise aromatizada con vainilla y gelificada con gelatina, combinado con nata batida para obtener una textura aireada y suave.",
  "imageUrl": "https://example.com/bavarois-vainilla.jpg",
  "detailedInfo": "El Bavarois combina la riqueza de una crema inglesa con la ligereza de la nata montada. La gelatina estabiliza la base, permitiendo que la mousse mantenga forma mientras permanece cremosa. Se puede añadir cacao en polvo para una versión de chocolate.",
  "ingredients": [
    { "name": "Yemas de huevo", "quantity": "80 g (~4 unidades)" },
    { "name": "Azúcar", "quantity": "125 g" },
    { "name": "Leche entera", "quantity": "500 ml" },
    { "name": "Vaina de vainilla", "quantity": "1 unidad (semillas raspadas)" },
    { "name": "Gelatina en hojas", "quantity": "10 g (5 hojas de 2 g cada una)" },
    { "name": "Nata para montar (35% MG)", "quantity": "400 ml" },
    { "name": "Cacao en polvo (opcional, para versión chocolate)", "quantity": "2 a 4 cucharadas" }
  ],
  "steps": [
    { "step": "Calentar la leche con la vaina de vainilla y azúcar hasta justo antes de hervir." },
    { "step": "Hidratar la gelatina en agua fría." },
    { "step": "Batir las yemas hasta que blanqueen ligeramente. Templar las yemas con un poco de leche caliente y reincorporar a la olla." },
    { "step": "Cocinar a fuego suave hasta que la crema nappe la cuchara (~82 °C). Colar para eliminar grumos y la vaina." },
    { "step": "Añadir la gelatina hidratada y escurrida a la Crème Anglaise caliente y mezclar suavemente hasta disolver." },
    { "step": "Enfriar rápidamente la base sobre baño maría inverso (hielo y agua) mientras se bate constantemente hasta que esté tibia y con textura de miel." },
    { "step": "Batir la nata hasta punto semimontado (cremosa, espumosa, sin picos duros). No sobrebatir." },
    { "step": "Incorporar la nata semimontada a la base de Crème Anglaise con movimientos envolventes suaves. Las temperaturas deben ser similares para evitar grumos o derretimiento de la nata." },
    { "step": "Verter la mezcla en moldes individuales o en molde grande y refrigerar mínimo 3-4 horas hasta que la gelatina haya cuajado completamente." },
    { "step": "Opcional: añadir cacao en polvo a la base antes de incorporar la nata para versión chocolate." }
  ],
  "images": [
    "https://example.com/bavarois-vainilla-1.webp",
    "https://example.com/bavarois-vainilla-2.webp"
  ],
  "rating": null,
  "tips": [
    "La clave de la ligereza del Bavarois es la nata batida a punto mousse: cremosa y espumosa, no rígida.",
    "Nunca hervir la Crème Anglaise; debe nappear la cuchara para asegurar textura y seguridad de las yemas.",
    "El enfriado rápido evita que la gelatina se sedimente y asegura una textura homogénea.",
    "Para versión chocolate, añadir el cacao antes de integrar la nata y batir suavemente para mantener aireación."
  ]
},
{
  "id": 63,
  "uid": "P-STY_000063",
  "name": "Bavarois de Frutilla Simplificado",
  "description": "Versión rápida y ligera de Bavarois usando leche evaporada montada y jalea de frutilla para un postre aireado y firme, ideal para copas individuales.",
  "imageUrl": "https://example.com/bavarois-frutilla.jpg",
  "detailedInfo": "Esta receta simplifica el Bavarois tradicional reemplazando la Crème Anglaise con leche evaporada montada y jalea de fruta. La textura espumosa se logra gracias a la leche refrigerada y el reposo mínimo en frío. Se puede variar el sabor usando cualquier jalea de fruta.",
  "ingredients": [
    { "name": "Leche evaporada Ideal Nestlé", "quantity": "1 tarro (refrigerado mínimo 5 horas)" },
    { "name": "Jalea (gelatina) de frutilla", "quantity": "1 caja (80 - 100 g)" },
    { "name": "Agua caliente", "quantity": "2 tazas (400 ml)" },
    { "name": "Salsa de frutos rojos", "quantity": "c/n, opcional" },
    { "name": "Chocolate rallado", "quantity": "c/n, para decoración" },
    { "name": "Frutillas (fresas)", "quantity": "c/n, para decoración" }
  ],
  "steps": [
    { "step": "Disolver completamente la jalea en las 2 tazas de agua recién hervida." },
    { "step": "Enfriar la mezcla de jalea a temperatura ambiente, preferiblemente sobre baño maría inverso (agua fría y hielo). No refrigerar para evitar gelificación prematura." },
    { "step": "Opcional: preparar salsa de frutos rojos cocinando frambuesas con azúcar y colocarla en el fondo de las copas antes de verter el Bavarois." },
    { "step": "Batir la leche evaporada muy fría hasta que triplique su volumen y se forme una espuma ligera." },
    { "step": "Agregar la jalea fría a la leche evaporada montada en forma de hilo, batiendo constantemente para lograr mezcla homogénea y aireada." },
    { "step": "Verter la mezcla en copas o moldes individuales y refrigerar mínimo 20 minutos hasta que esté firme." },
    { "step": "Decorar con chocolate rallado y frutillas antes de servir." }
  ],
  "images": [
    "https://example.com/bavarois-frutilla-1.webp",
    "https://example.com/bavarois-frutilla-2.webp"
  ],
  "rating": null,
  "tips": [
    "La leche evaporada debe estar ultra-fría para montarse correctamente; de lo contrario, la textura será líquida.",
    "La jalea debe estar completamente disuelta y fría, nunca tibia ni gelificada, para integrarse correctamente con la leche montada.",
    "Se puede usar cualquier sabor de jalea para variar el postre sin modificar la técnica.",
    "Reposar mínimo 20 minutos en refrigeración garantiza firmeza y compactación antes de decorar."
  ]
},
{
  "id": 64,
  "uid": "P-STY_000064",
  "name": "Bavarois de Maracuyá (Técnica de Licuado Rápido)",
  "description": "Bavarois ligero y aireado de maracuyá, preparado sin horneado, usando leche evaporada fría, leche condensada y jugo de maracuyá licuado para una textura esponjosa y firme.",
  "imageUrl": "https://example.com/bavarois-maracuya.jpg",
  "detailedInfo": "Esta versión simplificada del Bavarois reemplaza la nata batida con un licuado prolongado de leche evaporada fría, leche condensada y jugo de maracuyá. La acidez de la fruta estabiliza las proteínas de la leche, generando firmeza y volumen. Las pepas de maracuyá se reservan para la decoración y aportan contraste crujiente.",
  "ingredients": [
    { "name": "Leche evaporada", "quantity": "1 tarro (muy fría, refrigerada mínimo 5 horas)" },
    { "name": "Leche condensada", "quantity": "1 lata" },
    { "name": "Jugo de maracuyá", "quantity": "c/n, extraído y colado" },
    { "name": "Pepas de maracuyá", "quantity": "c/n, para decoración" },
    { "name": "Barquillos", "quantity": "opcional, para decorar" }
  ],
  "steps": [
    { "step": "Abrir los maracuyás y colar la pulpa para separar las pepas del jugo. Reservar las pepas para decoración." },
    { "step": "Colocar en la licuadora la leche condensada, el jugo de maracuyá y la leche evaporada muy fría." },
    { "step": "Licuar la mezcla durante aproximadamente 5 minutos, hasta generar espuma y obtener mezcla aireada y homogénea." },
    { "step": "Verter la mezcla espumosa directamente en vasitos o copas." },
    { "step": "Refrigerar los vasitos entre 2 y 3 horas para que la espuma se estabilice y adquiera firmeza." },
    { "step": "Decorar con las pepas de maracuyá reservadas y, opcionalmente, barquillos." }
  ],
  "images": [
    "https://example.com/bavarois-maracuya-1.webp",
    "https://example.com/bavarois-maracuya-2.webp"
  ],
  "rating": null,
  "tips": [
    "La leche evaporada debe estar muy fría para poder montar durante el licuado y obtener textura aireada.",
    "El licuado prolongado reemplaza la función de la nata montada, incorporando aire y volumen.",
    "Este postre no requiere horneado; se hace completamente en frío.",
    "La acidez del maracuyá ayuda a que la mezcla se espese y se estabilice en refrigeración, pudiendo omitir gelatina.",
    "Reservar las pepas de maracuyá para la decoración garantiza contraste de texturas: cremoso vs. crujiente."
  ]
},
{
  "id": 65,
  "uid": "P-STY_000065",
  "name": "Bavaroise de Chocolate Clásico",
  "description": "Postre francés frío y sedoso elaborado con una base de salsa inglesa y chocolate fundido, aireado con crema de leche semimontada. De textura ligera, cremosa y con sabor intenso a cacao.",
  "imageUrl": "https://example.com/bavaroise-chocolate.jpg",
  "detailedInfo": "El Bavaroise de Chocolate es una mousse fría a base de salsa inglesa, enriquecida con cobertura de chocolate y estabilizada con gelatina. Su textura aireada se logra al incorporar crema semimontada cuando la base alcanza la temperatura ideal (50 °C). Es un clásico de la pastelería francesa que combina técnica, temperatura y control del aire para obtener un resultado firme pero esponjoso. Puede presentarse solo o con glaseado espejo, ganache batida o cacao en polvo para decoración.",
  "ingredients": [
    { "name": "Leche entera", "quantity": "200 ml" },
    { "name": "Azúcar", "quantity": "40 g" },
    { "name": "Yemas de huevo", "quantity": "3 unidades" },
    { "name": "Cobertura de chocolate semiamargo (60-70%)", "quantity": "120 g, fundido" },
    { "name": "Gelatina sin sabor", "quantity": "8 g (hidratada en 40 g de agua fría)" },
    { "name": "Crema de leche (35% grasa)", "quantity": "250 ml, semimontada" }
  ],
  "steps": [
    { "step": "Hidratar la gelatina en el agua fría y dejar reposar hasta formar una masa firme." },
    { "step": "Mezclar en una olla la leche, el azúcar y las yemas. Batir y cocinar a fuego bajo hasta alcanzar el punto napa (80–85 °C), sin dejar hervir." },
    { "step": "Retirar del fuego y añadir la gelatina hidratada para disolverla completamente con el calor residual." },
    { "step": "Incorporar el chocolate fundido a la salsa inglesa caliente y mezclar hasta obtener una base homogénea y brillante." },
    { "step": "Dejar atemperar la mezcla hasta 50 °C para evitar que el calor derrita la crema semimontada." },
    { "step": "Batir la crema de leche fría hasta tres cuartos de punto (semimontada, cremosa pero no rígida)." },
    { "step": "Unir la base de chocolate atemperada con la crema, utilizando movimientos envolventes con espátula para conservar el aire incorporado." },
    { "step": "Verter en moldes o copas y refrigerar de 3 a 4 horas, hasta que cuaje completamente." },
    { "step": "Decorar con virutas de chocolate, cacao en polvo o glaseado espejo antes de servir." }
  ],
  "images": [
    "https://example.com/bavaroise-chocolate-1.webp",
    "https://example.com/bavaroise-chocolate-2.webp"
  ],
  "rating": null,
  "tips": [
    "El punto napa se logra cuando la mezcla cubre la espátula y, al pasar el dedo, deja una línea visible que no se borra.",
    "No dejar hervir la salsa inglesa, ya que coagularía las yemas y arruinaría la textura.",
    "Atemperar siempre la base antes de agregar la crema para mantener la textura aireada.",
    "La crema debe estar fría y batida solo a tres cuartos para facilitar su integración.",
    "Puede servirse con glaseado espejo o ganache montada para un acabado profesional."
  ]
},
{
  "id": 66,
  "uid": "P-STY_000066",
  "name": "Bavaroise de Café",
  "description": "Postre francés frío y cremoso a base de salsa inglesa de café y crema de leche semimontada. Su textura ligera se logra al incorporar aire con cuidado y estabilizar con gelatina.",
  "imageUrl": "https://example.com/bavaroise-cafe.jpg",
  "detailedInfo": "Este Bavaroise de Café se elabora con una base de salsa inglesa caliente, aromatizada con café y estabilizada con gelatina hidratada. Una vez enfriada, se mezcla con crema semimontada para obtener una textura aireada. El postre se completa con migas crocantes de chocolate y frutos secos tostados, generando contraste de textura. Se recomienda respetar las temperaturas de cocción y batido para preservar la estructura y la ligereza.",
  "ingredients": [
    { "name": "Leche entera", "quantity": "200 ml" },
    { "name": "Azúcar", "quantity": "40 g" },
    { "name": "Yemas de huevo", "quantity": "2 unidades" },
    { "name": "Café soluble", "quantity": "5 g" },
    { "name": "Gelatina sin sabor", "quantity": "10 g (hidratada en 50 g de agua fría)" },
    { "name": "Crema de leche (35% grasa)", "quantity": "250 ml, semimontada" },
    { "name": "Mantequilla", "quantity": "20 g" },
    { "name": "Galletas de chocolate molidas", "quantity": "40 g" },
    { "name": "Frutos secos (nueces, almendras, uvas pasas)", "quantity": "30 g" }
  ],
  "steps": [
    { "step": "Hidratar la gelatina en agua fría y dejar reposar hasta obtener una masa compacta." },
    { "step": "Mezclar en una olla la leche, el azúcar y las yemas. Cocinar a fuego muy bajo hasta alcanzar el punto napa (80–85 °C), sin hervir." },
    { "step": "Retirar del fuego y agregar el café soluble. Luego incorporar la gelatina hidratada y mezclar hasta disolver completamente." },
    { "step": "Transferir la mezcla a un bol frío y dejar enfriar hasta que esté tibia antes de unir con la crema." },
    { "step": "Batir la crema de leche fría hasta medio punto (textura espesa pero aún fluida)." },
    { "step": "Incorporar la base de café enfriada a la crema semimontada, usando movimientos envolventes para mantener el aire." },
    { "step": "Verter en copas o moldes individuales y refrigerar de 3 a 4 horas, hasta que esté firme." },
    { "step": "Tostar los frutos secos en sartén seco, agregar la mantequilla y mezclar con las galletas molidas para formar las migas de chocolate." },
    { "step": "Servir el Bavaroise acompañado con las migas y frutos secos por encima." }
  ],
  "images": [
    "https://example.com/bavaroise-cafe-1.webp",
    "https://example.com/bavaroise-cafe-2.webp"
  ],
  "rating": null,
  "tips": [
    "El punto napa se alcanza cuando la mezcla cubre la espátula y, al pasar el dedo, deja una línea que no se cierra.",
    "No calentar en exceso la salsa inglesa para evitar que se corte la yema.",
    "Atemperar la base antes de agregar la crema para que no se pierda el aire incorporado.",
    "La crema debe estar fría (no congelada) para lograr un batido estable y sin corte.",
    "El contraste entre la textura cremosa y las migas crocantes es esencial para el equilibrio del postre."
  ]
},
{
  "id": 67,
  "uid": "P-STY_000067",
  "name": "Mousse de Fresa",
  "description": "Postre ligero y aireado elaborado con solo tres ingredientes: crema de leche, gelatina de fresa y agua caliente. De textura suave y firme, ideal como postre rápido o base para mousses frutales.",
  "imageUrl": "https://example.com/mousse-fresa.jpg",
  "detailedInfo": "Esta mousse de fresa utiliza una técnica simplificada en la que la gelatina disuelta se mezcla directamente con la crema de leche fría, generando una textura esponjosa gracias al batido rápido. Es una receta base que puede adaptarse a otros sabores de gelatina como limón, durazno o maracuyá. Perfecta para postres rápidos sin necesidad de horno ni técnicas complejas.",
  "ingredients": [
    { "name": "Crema de leche (35% grasa)", "quantity": "250 ml, bien fría" },
    { "name": "Gelatina de fresa en polvo", "quantity": "1 sobre (80 g)" },
    { "name": "Agua caliente", "quantity": "250 ml" }
  ],
  "steps": [
    { "step": "Disolver la gelatina de fresa en el agua caliente, mezclando bien hasta que no queden grumos." },
    { "step": "Dejar enfriar completamente la gelatina disuelta hasta temperatura ambiente. No debe estar caliente." },
    { "step": "Verter en una licuadora la crema de leche fría junto con la gelatina enfriada y batir durante 2 minutos para incorporar aire y lograr una textura espumosa." },
    { "step": "Distribuir la mezcla en vasitos o moldes individuales." },
    { "step": "Refrigerar por al menos 3 horas, hasta que el postre esté firme y con textura de mousse." }
  ],
  "images": [
    "https://example.com/mousse-fresa-1.webp",
    "https://example.com/mousse-fresa-2.webp"
  ],
  "rating": null,
  "tips": [
    "Usar la crema bien fría mejora la textura final y permite incorporar más aire al batir.",
    "Asegurarse de que la gelatina esté completamente disuelta antes de mezclar con la crema para evitar grumos.",
    "No agregar la gelatina caliente a la crema, ya que podría cortarla o perder el efecto aireado.",
    "Puede prepararse con cualquier sabor de gelatina en polvo para variar el gusto del postre.",
    "Servir con frutas frescas o una capa de gelatina adicional para presentación profesional."
  ]
},
{
  "id": 68,
  "uid": "P-STY_000068",
  "name": "Mousse de Fresa (Técnica Clásica sin Gelatina)",
  "description": "Mousse frío y esponjoso de fresa elaborado con nata semimontada y merengue, sin necesidad de gelatina. Su textura ligera y aireada se logra combinando doble agente aireador: crema y claras de huevo.",
  "imageUrl": "https://example.com/mousse-fresa.jpg",
  "detailedInfo": "Este mousse de fresa se prepara triturando fresas frescas y combinándolas con nata semimontada y merengue francés, suizo o italiano. La clave está en integrar los componentes con movimientos envolventes para conservar el aire y lograr una textura ligera. Se recomienda refrigerar al menos 3 horas antes de servir.",
  "ingredients": [
    { "name": "Fresas frescas", "quantity": "400 g, trituradas" },
    { "name": "Nata (crema de leche) para montar", "quantity": "200 ml, fría" },
    { "name": "Claras de huevo", "quantity": "3 unidades (90 g)" },
    { "name": "Azúcar", "quantity": "50 g (3 cdas)" }
  ],
  "steps": [
    { "step": "Limpiar y triturar las fresas. Opcional: pasar por colador para quitar semillas." },
    { "step": "Batir la nata fría hasta semimontarla (medio punto)." },
    { "step": "Batir las claras de huevo añadiendo azúcar progresivamente hasta formar un merengue firme." },
    { "step": "Agregar un poco del puré de fresas a la nata semimontada y mezclar con movimientos envolventes." },
    { "step": "Incorporar la mezcla de puré y nata al resto de la nata semimontada, mezclando suavemente." },
    { "step": "Añadir el merengue al final, mezclando con cuidado para no perder aire." },
    { "step": "Verter la mezcla en copas o vasitos." },
    { "step": "Refrigerar mínimo 3 horas y decorar con trocitos de fresa y menta antes de servir." }
  ],
  "images": [
    "https://example.com/mousse-fresa-1.webp",
    "https://example.com/mousse-fresa-2.webp"
  ],
  "rating": null,
  "tips": [
    "La esponjosidad del mousse depende de la combinación de nata semimontada y claras a punto de nieve.",
    "La nata debe estar muy fría para montar correctamente y evitar que la grasa se separe.",
    "Este postre es completamente frío; el reposo en nevera es esencial para adquirir la textura deseada.",
    "El merengue se incorpora al final con movimientos suaves para no perder el aire.",
    "Para mejor conservación y estabilidad, usar merengue italiano o suizo. El merengue francés es más ligero pero menos duradero."
  ]
}

















//Leche no frita
//Miguelitos
//Conos de hojaldre
//Tortas










    ]
  }
  